{
  "daftar_pahlawan": [
    {
      "nama": "A.H. Nasution ",
      "nama2": "Jendral Besar Dr.Abdul Haris Nasution",
      "kategori": "Pahlawan Nasional",
      "asal": "Sumatera Utara",
      "lahir": "Selasa, 3 Desember 1918 di Kotanopan, Mandailing Natal, Sumatera Utara",
      "usia": "81 tahun",
      "gugur": "Selasa Wage, 5 September 2000 di Jakarta, Indonesia",
      "lokasimakam": "Taman Makam Pahlawan (TMP) Kalibata, Jakarta.",
      "history": "Jenderal Besar TNI, Panglima Angkatan Perang Republik Indonesia, Ketua Ketua Majelis Permusyawaratan Rakyat ke-2 (MPRS), Menteri Pertahanan ke-12, Kepala Staf TNI Angkatan Darat (KASAD, KSAD) sebanyak 2 Kali. Ahli perang gerilya, peletak dasar perang gerilya, penulis buku yang fenomenal dengan judul Fundamentals of Guerrilla Warfare, yang diterjemahkan ke berbagai bahasa asing, dan menjadi buku wajib akademi militer di sejumlah negara, termasuk sekolah elite militer dunia, West Point, Amerika Serikat.Jenderal Besar Dr. Abdul Haris Nasution (lahir di Kotanopan, Sumatera Utara, 3 Desember 1918 – meninggal di Jakarta, 6 September 2000 pada umur 81 tahun) adalah seorang pahlawan nasional Indonesia yang merupakan salah satu tokoh yang menjadi sasaran dalam peristiwa Gerakan 30 September, namun yang menjadi korban adalah putrinya Ade Irma Suryani Nasution dan ajudannya, Lettu Pierre Tendean.Sebagai seorang tokoh militer, Nasution sangat dikenal sebagai ahli perang gerilya. Pak Nas demikian sebutannya dikenal juga sebagai penggagas dwifungsi ABRI. Orde Baru yang ikut didirikannya (walaupun ia hanya sesaat saja berperan di dalamnya). Beliau juga dikenal sebagai peletak dasar perang gerilya. Gagasan perang gerilya dituangkan dalam bukunya yang fenomenal, Fundamentals of Guerrilla Warfare. Selain diterjemahkan ke berbagai bahasa asing, karya itu menjadi buku wajib akademi militer di sejumlah negara, termasuk sekolah elite militer dunia, West Point, Amerika Serikat.Pada Maret 1946, ia diangkat menjadi Panglima Divisi III/Priangan. Mei 1946, ia dilantik Presiden Soekarno sebagai Panglima Divisi Siliwangi.Pada 5 Oktober 1997, bertepatan dengan hari ABRI, Nasution dianugerahi pangkat Jendral Besar bintang lima. Nasution tutup usia di RS Gatot Soebroto pada 6 September 2000 dan dimakamkan di TMP Kalibata, Jakarta.",
      "img": "https://image.ibb.co/cexrRK/a_h_nasution.jpg"
    },
    {
      "nama": "A.Wahab Hasbullah",
      "nama2": "KH. Abdul Wahab Chasbullah, Kyai Wahab",
      "kategori": "Pahlawan Nasional",
      "asal": "Jawa Timur",
      "lahir": "LLahir :Sabtu, 31 Maret 1888 di Jombang, Jawa Timur",
      "usia": "83 Tahun",
      "gugur": "Rabu, 29 Desember 1971 di Jombang, Jawa Timur",
      "lokasimakam": "Pondok Pesantren Tambak Beras Jombang Jawa timur",
      "history": "Tokoh kemerdekaan, Tokoh Islam, salah seorang pendiri NU (Nahdlatul Ulama). Ketua Tim Komite Hijaz. Pendiri harian umum Soeara Nahdlatul Oelama (NO) dan Berita Nahdlatul Ulama. Pendiri Organisasi Pemuda Islam bernama Nahdlatul Wathan (Kebangkitan Tanah Air). Panglima Laskar Mujahidin (Hizbullah) ketika melawan penjajah Jepang. Pelopor kebebasan dalam keberagamaan terutama kebebasan berpikir dan berpendapat di kalangan Umat Islam Indonesia. Inspirator Gerakan Pemuda Ansor. Rais Am NU.KH Abdul Wahab Hasbullah adalah seorang ulama yang berpandangan modern, dakwahnya dimulai dengan mendirikan surat kabar, yaitu harian umum “Soeara Nahdlatul Oelama” atau Soeara NO dan Berita Nahdlatul Ulama. Beliau bersama dengan KH Hasyim Asy'ari menghimpun tokoh pesantren dan keduanya mendirikan Nahdlatul Ulama (Kebangkitan Ulama) pada tahun 1926. Kiai Wahab juga berperan membentuk Majelis Syuro Muslimin Indonesia (Masyumi). Pada masa perjuangan mempertahankan kemerdekaan, Kiai Wahab bersama Hasyim Asy'ari dari Jombang dan Kiai Abbas dari Cirebon merumuskan Resolusi Jihad sebagai dukungan terhadap perjuangan kemerdekaan.Kyai Wahab pernah menjadi Ketua Tim Komite Hijaz. Beliau juga sebagai pendiri Organisasi Pemuda Islam bernama Nahdlatul Wathan (Kebangkitan Tanah Air), pernah sebagai Panglima Laskar Mujahidin (Hizbullah) ketika melawan penjajah Jepang. Kyai Wahab Hasbullah adalah pelopor kebebasan berpikir di kalangan Umat Islam Indonesia. Beliau merupakan seorang ulama yang menekankan pentingnya kebebasan dalam keberagamaan terutama kebebasan berpikir dan berpendapat. Salah satunya dengan membentuk kelompok diskusi Tashwirul Afkar (Pergolakan Pemikiran) di Surabaya.Sesudah Hasyim Asy'ari meninggal dunia, Kiai Wahab menjadi Rais Am NU. Beliau meningkatkan dukungan NU kepada Pemerintah Indonesia dalam memenangi perang melawan Pemerintah Belanda. Belau meninggal di Jombang 29 Desember 1971 pada umur 83 tahun, dan dimakamkan di Pondok Pesantren Tambak Beras Jombang Jawa timur.",
      "img": "https://image.ibb.co/dPoWRK/a_wahab_hasbullah.jpg"
    },
    {
      "nama": "Abdul Muis",
      "nama2": "Abdoel Moeis",
      "kategori": "Pahlawan Kemerdekaan Nasional",
      "asal": "Sumatera Barat",
      "lahir": "Selasa, 3 Juli 1883  di Sungai Puar, Agam, Sumatera Barat",
      "usia": "75 tahun",
      "gugur": "Rabu, 17 Juni 1959 di Bandung, Jawa Barat",
      "lokasimakam": "Lokasi Makam :Taman Makam Pahlawan (TMP) Cikutra, Bandung, Jawa Barat.",
      "history": "Pejuang Kemerdekaan Indonesia, Politisi, Jurnalis, Penulis Buku. Menteri Luar Negeri. Pemimpin kedua di SI (Sarekat Islam). Anggota BPUPKI. Ketua Dewan Kehormatan PWI.Abdoel Moeis (lahir di Sungai Puar, Agam, Sumatera Barat, Selasa Legi 3 Juli 1883 – meninggal di Bandung, Jawa Barat, Rabu Pon 17 Juni 1959 pada umur 75 tahun) adalah seorang sastrawan, politisi, wartawan Indonesia. Dia merupakan pengurus besar Sarekat Islam dan pernah menjadi anggota Volksraad mewakili organisasi tersebut. Abdul Muis dikukuhkan sebagai Pahlawan Nasional yang pertama oleh Presiden RI, Soekarno, pada 30 Agustus 1959. Tahun 1917 ia dipercaya sebagai utusan Sarekat Islam pergi ke negeri Belanda untuk mempropagandakan komite Indie Weerbaar. Dalam kunjungan itu, dia mendorong tokoh-tokoh Belanda untuk mendirikan Technische Hooge School – Institut Teknologi Bandung (ITB) di Priangan. Selain berpidato dia juga berjuang melalui berbagai media cetak. Dalam tulisannya di harian berbahasa Belanda De Express, Abdul Muis mengecam seorang Belanda yang sangat menghina bumiputera. Pada tahun 1920, ia terpilih sebagai Ketua Pengurus Besar Perkumpulan Buruh Pegadaian. Setahun kemudian memimpin pemogokan kaum buruh di Yogyakarta. Tahun 1923 beliau mengunjungi Padang, Sumatera Barat. Disana ia mengundang para penghulu adat untuk bermusyawarah, menentang pajak yang memberatkan masyarakat Minangkabau. Karena kegiatannya tersebut ia dilarang berpolitik. Selain itu ia juga dikenakan passentelsel, yang melarangnya tinggal di Sumatera Barat. Kemudian ia diasingkan ke Garut, Jawa Barat. Di kota ini ia menyelesaikan novelnya yang terkenal : Salah Asuhan. Tahun 1926 ia terpilih menjadi anggota Regentschapsraad Garut. Dan enam tahun kemudian diangkat menjadi Regentschapsraad Controleur. Jabatan itu diembannya hingga Jepang masuk ke Indonesia (1942).Setelah kemerdekaan, ia mendirikan Persatuan Perjuangan Priangan yang fokus pada pembangunan di Jawa Barat dan masyarakat Sunda. Tahun 1959 ia wafat dan dimakamkan di TMP Cikutra, Bandung.",
      "img": "https://image.ibb.co/jj670e/abdul_muis.jpg"
    },
    {
      "nama": "Abdu Halim",
      "nama2": "KH. Abdoel Halim",
      "kategori": "Pahlawan Nasional",
      "asal": "Jawa Barat  ",
      "lahir": "Minggu , 26 Juni 1887 di Desa Cibolerang, Kecamatan Jatiwangi, Majalengka, Jawa Barat",
      "usia": "74 tahun",
      "gugur": "Kamis , 17 Mei 1962 di Bandung, Jawa Barat",
      "lokasimakam": "MPN KH Abdul Halim, Kompleks Pondok Pesantren Santi Asromo, Desa Pasirayu, Kecamatan Sindang, Kabupaten Majalengka, Jawa Barat.",
      "history": "K.H. Abdoel Halim adalah Pejuang Kemerdekaan, Penulis, Pendidik, dan Organisatoris Ulung. Anggota BPUPKI (1945). Anggota Komite Nasional indonesia Pusat (KNIP) dan Anggota Konstituante (tahun 1955). Bupati Majalengka, Pendiri Pesantren Santi Asromo dan sekolah lainnya (tahun 1942). Pendiri Majlis Ilmu (tahun 1911). Pendiri Hayatul Qulub (tahun 1912), Pendiri sekolah/madrasah Jam'iyah I'anah al-Muta'alimin (tahun 1916), Pendiri Persyarikatan Ulama, Fatimiyah beserta usaha pendukungnya (tahun 1917).Beliau adalah pahlawan Indonesia yang berjuang dalam memperjuangkan kemerdekaan Indonesia hingga mempertahankan dari Agresi Militer Belanda. Dalam mempertahankan kemerdekaan Abdul Halim berbasis di Gunung Ceremai untuk menghadapi Agresi Militer Belanda II dengan berperang gerilya. Ia memimpin dalam penghadangan militer Belanda di wilayah Keresidenan Cirebon. Ia, ikut dalam BPUPKI dalam rangka persiapan kemerdekaan Indonesia sebagai anggota BPUPKI. Beliau pernah menjadi Bupati Majalengka oleh Residen Cirebon, serta produktif menulis. Buku yang ditulisnya diantaranya adalah Dawat Al-mal, Tarich Islam, Neratja Hidoep, Risalat, Ijtima`iyyat wa Ilahuha, Kitab 262 Hadist Indonesia, Tafsir Juz `Amma, dan Koperasi dalam Islam Gelar pahlawan nasional diberikan kepada Abdul Halim bertepatan pada peringatan Hari Pahlawan tanggal 10 November 2008 (Keppres No. 41/TK/2008, tanggal 6 November 2008) ",
      "img": "https://image.ibb.co/hrfZfe/abdulhalim.jpg"
    },
    {
      "nama": "Abdulrahman Saleh ",
      "nama2": "Marsda.Prof.dr.Abdulrachman Saleh,Sp.F.",
      "kategori": "Pahlawan Nasional",
      "asal": "DIY (Yogyakarta) ",
      "lahir": "Kamis Kliwon, 1 Juli 1909   di Jakarta, Indonesia",
      "usia": "38 tahun",
      "gugur": "Selasa, 29 Juli 1947   di Maguwoharjo, Sleman, DI Yoyakarta.",
      "lokasimakam": "Kompleks Monumen Perjuangan TNI AU Dusun Ngoto, Desa Tamanan, Banguntapan, Bantul, DI Yogyakarta",
      "history": "Tokoh Awal di Angkatan Udara, Aktifis Kemerdekaan. Bapak Fisiologi Kedokteran Indonesia. Tokoh, Pendiri, dan Ketua organisasi Radio Republik Indonesia (RRI), beliau juga banyak membantu dalam hal keuangan dan teknis. Beliau putra dr. Mohammad Saleh (salah seorang pendiri Budi Utomo, terkenal sebagai dokter yang dermawan dan banyak membantu perjuangan rakyat Probolinggo Jawa Timur).",
      "img": "https://image.ibb.co/k4Mwtz/abdulrahman_saleh.jpg"
    },
    {
      "nama": "Achmad Rifai ",
      "nama2": "KH. Admad Rifa’i",
      "kategori": "Pahlawan Nasional",
      "asal": "Jawa Tengah",
      "lahir": "Sabtu, 9 Muharam 1200 H (12 November 1785)   di Tempuran, Kendal, Jawa Tengah",
      "usia": "83 tahun",
      "gugur": "Rabu, 25 Robiul Akhir 1286 H (4 Agustus 1869)   di Manado, Sulawesi Utara",
      "lokasimakam": "Kompleks Makam Kiai Modjo, Pekuburan Jawa Tondano di Kelurahan Kampung Jawa,Kecamatan Tondano Utara, Kabupaten Minahasa, Sulawesi Utara.",
      "history": "Pemikir Islam dan Penulis terkenal karena sikap anti penjajah Belanda. Sebanyak lebih dari 60 buku/kitab yang ditulisnya. Dalam berdakwah ia mengobarkan semangat anti penjajah dan gagasannya bisa dikategorikan pembaharuan, purifikasi (pemurnian), dan pencerahan. Juga fikihisasi karena ajarannya bersifat fikih. Membangun komunitas Rifaiyah.Beliau adalah Tokoh Awal di Angkatan Udara, Aktifis Kemerdekaan, Tokoh Radio Republik Indonesia (RRI) dan Bapak Fisiologi Kedokteran Indonesia.Dakwah yang mengobarkan semangat anti penjajah itu semakin meresahkan pemerintah kolonial Belanda, akhirnya ia diasingkan ke Ambon oleh pemerintah kolonial Belanda. Kemudian ia dipindahkan ke Manado hingga akhirnya meninggal dunia pada tanggal 25 Robiul Akhir 1286 H (4 Agustus 1869), pada usia 83 tahun, di Manado, Sulawesi Utara. Beliau dimakamkan di Kompleks Makam Kiai Modjo, Pekuburan Jawa Tondano di Kelurahan Kampung Jawa, Kecamatan Tondano Utara, Kabupaten Minahasa, Sulawesi Utara, Indonesia.",
      "img": "https://image.ibb.co/dt1J6K/achmad_rifai.jpg"
    },
    {
      "nama": "Achmad Subardjo ",
      "nama2": "Prof.Mr.R.Achmad Soebardjo Djojoadisoerjo",
      "kategori": "Pahlawan Nasional",
      "asal": "DKI Jakarta",
      "lahir": "Senin, 23 Maret 1896   di Karawang, Jawa Barat",
      "usia": "82 tahun",
      "gugur": "Jumat, 15 Desember 1978   di Jakarta, Indonesia",
      "lokasimakam": "Cipayung, Bogor, Jawa Barat",
      "history": "Tokoh Pejuang Kemerdekaan Indonesia, Diplomat. Anggota BPUPKI dan PPKI. Menteri Luar Negeri Indonesia yang pertama.Konsep naskah proklamasi disusun oleh Bung Karno, Bung Hatta, dan Ahmad Subarjo di rumah Laksamana Muda Maeda.Setelah selesai dan beragumentasi dengan para pemuda, dinihari 17 Agustus 1945, Bung Karno pun segera memerintahkan Sayuti Melik untuk mengetik naskah proklamasi. Pada tanggal 18 Agustus 1945, Soebardjo dilantik sebagai Menteri Luar Negeri pada Kabinet Presidensial, kabinet Indonesia yang pertama, dan kembali menjabat menjadi Menteri Luar Negeri sekali lagi pada tahun 1951 - 1952. Selain itu, ia juga menjadi Duta Besar Republik Indonesia di Switzerland antara tahun 1957 - 1961. Dalam bidang pendidikan, Soebardjo merupakan profesor dalam bidang Sejarah Perlembagaan dan Diplomasi Republik Indonesia di Fakultas Kesusasteraan, Universitas Indonesia. Achmad Soebardjo Djojoadisoerjo meninggal dunia dalam usia 82 tahun di Rumah Sakit Pertamina, Kebayoran Baru, akibat flu yang menimbulkan komplikasi. Ia dimakamkan di rumah peristirahatnya di Cipayung, Bogor. Pemerintah mengangkat almarhum sebagai Pahlawan Nasional pada tahun 2009.",
      "img": "https://image.ibb.co/fy1J6K/achmad_subardjo.jpg"
    },
    {
      "nama": "Adam Malik ",
      "nama2": "H.Adam Malik Batubara",
      "kategori": "Pahlawan Nasional ",
      "asal": "Sumatera Selatan",
      "lahir": "Sabtu, 16 September 1905   di Palembayan, Sumatera Barat",
      "usia": "63 tahun",
      "gugur": "Senin , 23 Desember 1968   di Rumah Sakit Charitas Palembang, Sumatera Selatan",
      "lokasimakam": "Taman Makam Pahlawan (TMP) Ksatria Ksetra Siguntang, Palembang, Sumatera Selatan.",
      "history": "Aktifis Kemerdekaan. Wakil Perdana Menteri dan Menteri Kemakmuran. Gubernur Militer Sumatera Selatan. Menteri Perdagangan, Menteri Pertanian. Rektor Universitas Sriwijaya.Ia adalah Wakil Presiden Republik Indonesia (1978 - 1983), Ketua DPR/MPR (1977 - 1978), Menteri Luar Negeri Indonesia (1966 - 1978), Ketua Majelis Umum PBB, menteri beberapa departemen, pelopor berdirinya Kantor Berita Antara, dsb. Bersama Menteri Luar Negeri negara-negara ASEAN, Adam Malik memelopori terbentuknya ASEAN tahun 1967. Sebagai seorang diplomat, wartawan bahkan birokrat, Adam Malik sering mengatakan “semua bisa diatur”. Sebagai diplomat ia memang dikenal selalu mempunyai 1001 jawaban atas segala macam pertanyaan dan permasalahan yang dihadapkan kepadanya. Tapi perkataan “semua bisa diatur” itu juga sekaligus sebagai lontaran kritik bahwa di negara ini “semua bisa di atur” dengan uang. Setelah mengabdikan diri demi bangsa dan negaranya, H.Adam Malik meninggal di Bandung pada 5 September 1984 karena kanker lever. Kemudian, isteri dan anak-anaknya mengabadikan namanya dengan mendirikan Museum Adam Malik. Pemerintah juga memberikan berbagai tanda kehormatan. Atas jasa-jasanya, Adam Malik dianugerahi berbagai macam penghargaan, diantaranya adalah Bintang Mahaputera kl. IV pada tahun 1971, Bintang Adhi Perdana kl.II pada tahun 1973, dan diangkat sebagai Pahlawan Nasional pada tahun 1998.",
      "img": "https://image.ibb.co/heBkmK/adam_malik.jpg"
    },
    {
      "nama": "Adenan Kapau Gani ",
      "nama2": "Mayjen.dr.Adnan Kapau Gani",
      "kategori": "Pahlawan Nasional ",
      "asal": "Sumatera Selatan",
      "lahir": "Sabtu Legi, 16 September 1905  di Palembayan, Sumatera Barat",
      "usia": "63 tahun ",
      "gugur": "Senin Kliwon, 23 Desember 1968   di Rumah Sakit Charitas Palembang, Sumatera Selatan",
      "lokasimakam": "Taman Makam Pahlawan (TMP) Ksatria Ksetra Siguntang, Palembang, Sumatera Selatan.",
      "history": "Aktifis Kemerdekaan. Wakil Perdana Menteri dan Menteri Kemakmuran. Gubernur Militer Sumatera Selatan. Menteri Perdagangan, Menteri Pertanian. Rektor Universitas Sriwijaya.Ia seorang dokter dan menjadi Wakil Perdana Menteri Indonesia ke-1 (3 Juli 1947 - 29 Januari 1948), Menteri Kemakmuran pada Kabinet Sjahrir III (2 Oktober 1946 - 27 Juni 1947), Menteri Perdagangan Republik Indonesia ke-3 (2 Oktober 1946 - 29 Januari 1948), dan Menteri Pertanian Republik Indonesia ke-4 (2 Oktober 1946 - 29 Januari 1948). Sejak remaja Gani aktif dalam kegiatan politik dan organisasi sosial. Pada era 1920-an, ia giat di berbagai organisasi kedaerahan seperti Jong Sumatranen Bond dan Jong Java. Pada tahun 1928 ia terlibat dalam Kongres Pemuda II di Jakarta. Pada tahun 1941, Gani membintangi sebuah film yang berjudul Asmara Moerni dan berpasangan dengan Djoewariah, ia menganggap perlu film tersebut untuk meningkatkan kualitas film lokal. Ketika menjabat sebagai Menteri Kemakmuran, ia bersama dengan Sutan Sjahrir dan Mohammad Roem menjabat sebagai delegasi Indonesia ke sidang pleno ketiga Perjanjian Linggarjati. Dia juga bekerja untuk membangun jaringan nasional perbankan serta beberapa organisasi perdagangan. Setelah revolusi berakhir pada tahun 1949, Gani menjadi Gubernur Militer Sumatera Selatan. Pada tahun 1954, ia diangkat menjadi rektor Universitas Sriwijaya di Palembang. Untuk mengenang jasa-jasanya, selain dianugerahi gelar Pahlawan Nasional Indonesia, namanya juga diabadikan sebagai nama rumah sakit di Palembang (Rumah Sakit AK Gani) dan menjadi nama ruas jalan beberapa kota di Indonesia.",
      "img": "https://image.ibb.co/mYAd6K/adean_kapau_gani.jpg"
    },
    {
      "nama": "Adisucipto",
      "nama2": "Marsda.Mas Agustinus Adisoetjibto",
      "kategori": "Pahlawan Nasional ",
      "asal": "DIY (Yogyakarta)",
      "lahir": "Senin Wage, 3 Juli 1916   di Salatiga, Jawa Tengah",
      "usia": "31 tahun",
      "gugur": "Selasa Pahing, 29 Juli 1947   di Bantul, Yogyakarta",
      "lokasimakam": "Kompleks Monumen Perjuangan TNI AU Dusun Ngoto, Desa Tamanan, Banguntapan, Bantul, DI Yogyakarta.",
      "history": "Pejuang Kemerdekaan Indonesia. Bapak Penerbang Republik Indonesia. Tokoh Awal di Angkatan Udara. Pendiri Sekolah Penerbang di Yogyakarta (15 November 1945). Menjadi Wakil Kepala Staf yang pertama dengan pangkat Komodor Muda Udara (sejak 9 April 1946). Gugur bersama Abdulrachman Saleh saat menembus blokade udara Belanda (29 Juli 1947).Pada tanggal 15 November 1945, Adisoetjipto mendirikan Sekolah Penerbang di Yogyakarta, tepatnya di Lapangan Udara Maguwo, yang kemudian diganti namanya menjadi Bandara Adisutjipto, untuk mengenang jasanya sebagai pahlawan nasional.Pada saat Agresi Militer Belanda I, Adisujipto dan Abdulrahman Saleh diperintahkan terbang ke India. Penerobosan blokade udara Belanda menuju India dan Pakistan berhasil dilakukan. Namun dalam perjalanan pulang membawa bantuan obat-obatan dari Malaya, pesawat Dakota VT-CLA ditumpanginya jatuh ditembak oleh dua pesawat P-40 Kittyhawk Belanda di Dusun Ngoto pada tanggal 29 Juli 1947.Beliau dimakamkan di pemakaman umum Kuncen I dan II, dan kemudian pada tanggal 14 Juli 2000 dipindahkan ke Monumen Perjuangan di Ngoto, Bangunharjo, Sewon, Bantul, Yogyakarta.",
      "img": "https://image.ibb.co/b9wwtz/adisucipto.jpg"
    },
    {
      "nama": "Ageng Tirtayasa ",
      "nama2": "Sultan Ageng Tirtajasa, Sultan Abdul Fathi Abdul Fattah",
      "kategori": "Pahlawan Nasional ",
      "asal": "Banten",
      "lahir": "1631 di Banten, Indonesia",
      "usia": "61 tahun",
      "gugur": "1692 di Penjara Batavia (Jakarta), Indonesia",
      "lokasimakam": "Makam Raja-Raja (Sultan) Banten, Mesjid Agung Banten.",
      "history": "Ageng Tirtayasa adalah putra Sultan Abdul Ma'ali Ahmad (memerintah 1640-1650) serta cucu dari Sultan Abdul Mufahir Mahmud Abdul Kadir (memerintah 1605-1640). Masa mudanya Sultan Ageng Tirtayasa diberi gelar Pangeran Surya. Kemudian setelah ayahnya wafat, sang Kakek mengangkatnya sebagai sultan muda bergelar Pangeran Ratu atau Pangeran Dipati. Beliau diangkat menjadi Sultan dengan gelar Sultan Abdul Fathi Abdul Fattah setelah Kakeknya meninggal dunia.Sultan (Raja/Pemimpin) Kesultanan Banten pada periode 1651 - 1683 yang memimpin perjuangan melawan penjajah Belanda (VOC). Beliau berusaha mewujudkan Banten sebagai kerajaan Islam terbesar, meningkatkan kesejahteraan rakyat dengan membuka sawah-sawah baru dan mengembangkan irigasi. Di bidang keagamaan, beliau mengangkat Syekh Yusuf Al-Makasari (juga Pahlawan Nasional) sebagai mufti kerajaan dan penasehat sultan.Sultan Ageng Tirtayasa meninggal pada tahun 1692 dan dimakamkan di samping Sultan-Sultan yang mendahuluinya di sebelah utara Mesjid Agung Banten yang terletak di Desa Banten Lama, Kecamatan Kasemen, Kota Serang, Propinsi Banten.",
      "img": "https://image.ibb.co/d5SfLe/ageng_tirtayasa.jpg"
    },
    {
      "nama": "Agung Hanyokrokusumo ",
      "nama2": "Sultan Agung Anyokrokusumo",
      "kategori": "Pahlawan Nasional ",
      "asal": "DIY (Yogyakarta)",
      "lahir": "1593   di Kutagede, Kesultanan Mataram",
      "usia": "52 tahun",
      "gugur": "1645   di Karta (Plered, Bantul), Kesultanan Mataram",
      "lokasimakam": "Pemakaman Imogiri di Imogiri, Kabupaten Bantul, Provinsi Daerah Istimewa Yogyakarta, Indonesia",
      "history": "Sultan Mataram terbesar, berperang melawan penindasan Belanda. Seorang Pejuang dan Budayawan. Memadukan Kalender Hijriyah dengan Kalender Saka, menjadi Kalender Jawa Islam.Di bawah kepemimpinannya, Mataram berkembang menjadi kerajaan terbesar di Jawa dan Nusantara pada saat itu. Beliau berperang melawan penindasan Belanda. Sultan Agung selain seorang pejuang juga seorang budayawan. Beliau memadukan Kalender Hijriyah dengan Kalender Saka, menjadi Kalender Jawa Islam Atas jasa-jasanya sebagai pejuang dan budayawan, Sultan Agung telah ditetapkan menjadi pahlawan nasional Indonesia berdasarkan S.K. Presiden No. 106/TK/1975 tanggal 3 November 1975.",
      "img": "https://image.ibb.co/bJBUDz/agung_hanyokrokusumo.jpg"
    },
    {
      "nama": "Agus Salim",
      "nama2": "KH.Agoes Salim",
      "kategori": "Pahlawan Kemerdekaan Nasional ",
      "asal": "Sumatera Barat",
      "lahir": "Rabu, 8 Oktober 1884   di Koto Gadang, Agam, Sumatera Barat",
      "usia": "70 tahun",
      "gugur": "Kamis Pahing, 4 November 1954   di Jakarta, Indonesia",
      "lokasimakam": "Taman Makam Pahlawan (TMP) Kalibata, Jakarta.",
      "history": "Pejuang Kemerdekaan Indonesia, Politisi, Jurnalis, Penulis Buku. Menteri Luar Negeri. Pemimpin kedua di SI (Sarekat Islam). Anggota BPUPKI. Ketua Dewan Kehormatan PWI.Pendidikan dasar Agus Salim ditempuh di Europeesche Lagere School (ELS), sekolah khusus untuk anak-anak Eropa. Ia lalu melanjutkan pendidikan ke Hoogere Burger School (HBS) di Batavia. Ketika lulus, ia berhasil menjadi lulusan terbaik di HBS se-Hindia Belanda. Setelah lulus, ia bekerja sebagai penerjemah dan pembantu notaris di sebuah kongsi pertambangan di Indragiri, Riau. Pada 1906, ia berkangkat ke Jeddah, Arab Saudi untuk bekerja di Konsulat Belanda di sana. Di sana, ia berguru kepada pamannya, Syekh Ahmad Khatib. Agus Salim kemudian menekuni dunia jurnalistik sejak 1915 di harian Neratja sebagai Redaktur II. Setelah itu, ia diangkat menjadi Ketua Redaksi. Hingga akhirnya ia menjadi Pimpinan harian Hindia Baroe di Jakarta. Kemudian, ia pun mendirikan surat kabar Fadjar Asia. Selanjutnya, ia menjadi redaktur di harian Moestika di Yogyakarta, dan membuka kantor Advies en Informatie Bureau Penerangan Oemoem (AIPO).Bersamaan dengan itu, ia terjun dalam dunia politik sebagai pemimpin Sarekat Islam. Karir politiknya dimulai pada 1915, ketika ia bergabung dengan Sarekat Islam (SI) dan menjadi pemimpin kedua di SI setelah H.O.S. Tjokroaminoto. Sejak itu, Agus Salim banyak terlibat dalam pentas politik bangsa ini, terutama berperan pada masa perjuangan kemerdekaan. Peran sertanya dalam perjuangan kemerdekaan RI antara lain sebagai anggota Volksraad (1921-1924), anggota panitia 9 BPUPKI yang menyiapkan UUD 1945, Menteri Muda Luar Negeri Kabinet Sjahrir II 1946 dan Kabinet II 1947, pembukaan hubungan diplomatik Indonesia dengan negara-negara Arab. Selain itu, ia juga menjadi Menteri Luar Negeri pada Kabinet Amir Sjarifuddin (1947) dan Menteri Luar Negeri Kabinet Hatta (1948 - 1949).K.H. Agus Salim ditetapkan sebagai Pahlawan Nasional dengan Keppres No. 657 Tahun 1961, tanggal 27 Desember 1961.",
      "img": "https://image.ibb.co/fASfLe/agus_salim.jpg"
    },
    {
      "nama": "Ahmad Dahlan ",
      "nama2": "KH.Achmad Dahlan",
      "kategori": "Pahlawan Kemerdekaan Nasional ",
      "asal": "DIY (Yogyakarta)",
      "lahir": "Sabtu Pahing, 1 Agustus 1868   di Yogyakarta, Indonesia",
      "usia": "54 tahun",
      "gugur": "Jumat Kliwon, 23 Februari 1923   di Yogyakarta, Indonesia",
      "lokasimakam": "RT 41 RW 11, Kampung Karangkajen, Brontokusuman, Mergangsan, Yogyakarta",
      "history": "Pendiri Muhammadiyah. Pejuang bidang Pendidikan. Pembaharu cara berpikir dan beramal dalam Islam. Suami dari Siti Walidah yang juga Pahlawan Nasional.Atas jasa-jasa KH. Ahmad Dahlan dalam membangkitkan kesadaran bangsa Indonesia melalui pembaharuan Islam dan pendidikan, maka Pemerintah Republik Indonesia menetapkannya sebagai Pahlawan Nasional dengan surat Keputusan Presiden no. 657 tahun 1961. KH. Ahmad Dahlan telah mempelopori kebangkitan ummat Islam untuk menyadari nasibnya sebagai bangsa terjajah yang masih harus belajar dan berbuat. Dengan organisasi Muhammadiyah yang didirikannya, telah banyak memberikan ajaran Islam yang murni kepada bangsanya. Ajaran yang menuntut kemajuan, kecerdasan, dan beramal bagi masyarakat dan umat, dengan dasar iman dan Islam. Dengan organisasinya, Muhammadiyah telah mempelopori amal usaha sosial dan pendidikan yang amat diperlukan bagi kebangkitan dan kemajuan bangsa, dengan jiwa ajaran Islam. Dengan organisasinya, Muhammadiyah bagian wanita (Aisyiyah) telah mempelopori kebangkitan wanita Indonesia untuk mengecap pendidikan dan berfungsi sosial, setingkat dengan kaum pria. Istrinya Nyai Ahmad Dahlan atau Siti Walidah juga seorang Pahlawan Nasional.Kisah hidup dan perjuangan Ahmad Dahlan telah diabadikan dalam bentuk film dengan judul Sang Pencerah.",
      "img": "https://image.ibb.co/hb5Zfe/ahmad_dahlan.jpg"
    },
    {
      "nama": "Ahmad Yani",
      "nama2": "Jenderal Achmad Yani",
      "kategori": "Pahlawan Revolusi",
      "asal": "Jawa Tengah",
      "lahir": "Senin Legi, 19 Juni 1922   di Purworejo, Jawa Tengah",
      "usia": "43 tahun",
      "gugur": "Jumat Legi, 1 Oktober 1965   di Lubang Buaya, Jakarta",
      "lokasimakam": "Taman Makam Pahlawan (TMP) Kalibata, Jakarta.",
      "history": "Pejuang Kemerdekaan. Menteri/Panglima Angkatan Darat (KSAD), korban kebiadaban (dibunuh) Gerakan 30 September.",
      "img": "https://image.ibb.co/dQj5mK/ahmad_yani.jpg"
    },
    {
      "nama": "Albertus Soegijapranata",
      "nama2": "Mgr A. Sugiopranoto,S.J.",
      "kategori": "Pahlawan Kemerdekaan Nasional",
      "asal": "Jawa Tengah",
      "lahir": "Rabu Kliwon, 25 November 1896   di Surakarta, Jawa Tengah",
      "usia": "66 tahun",
      "gugur": "Senin Wage, 22 Juli 1963   di Steyl, Belanda",
      "lokasimakam": "Taman Makam Pahlawan (TMP) Giri Tunggal, Semarang, Jawa Tengah.",
      "history": "Uskup Agung Katolik Semarang. Seorang Patriot dan Nasionalis sejati. Beliau dipuji karena kekuatannya selama pendudukan Jepang dan revolusi nasional. Beliau bukan hanya seorang uskup, melainkan pemimpin Indonesia yang teruji sebagai pemimpin yang baik dan layak menjadi pahlawan nasional. Juni 2012, Sutradara Garin Nugroho membuat film biopik tentang Soegijapranata, yang diberi judul Soegija. Pidato Soegijapranata saat Kongres Katolik Seluruh Indonesia di Semarang tahun 1954, mengatakan, jika kita merasa sebagai orang Kristen yang baik, kita semestinya juga menjadi seorang patriot yang baik.Ia merupakan anak kelima dari sembilan bersaudara, dengan ayah Karijosoedarmo, seorang abdi dalem di Susuhunan Surakarta, dan ibu Soepiah. Keluarga tersebut merupakan keluarga Muslim abangan, dan kakek Soegija, Soepa, seorang kyai. Namanya Soegija diambil dari kata sugih dalam bahasa Jawa, yang berarti kaya.Soegijapranata dibanggakan oleh orang Jawa yang beragama Katolik; mereka memuji kekuatannya selama pendudukan Jepang dan revolusi nasional. Penulis Anhar Gonggong menyatakan bahwa Soegijapranata bukan hanya seorang uskup, melainkan pemimpin Indonesia yang teruji sebagai pemimpin yang baik dan memang layak dijadikan pahlawan nasional. Sejarawan Indonesia Anton Haryono menyatakan bahwa kenaikan Soegijapranata menjadi uskup sangat monumental, mengingat bahwa ia baru ditahbiskan sembilan tahun sebelumnya, dan tetap diangkat meskipun ada pastor lain yang lebih berpengalaman. Pada bulan Juni 2012 sutradara Garin Nugroho mengeluarkan film biopik tentang Soegijapranata, yang diberi judul Soegija. Pada pidato Soegijapranata saat Kongres Katolik Seluruh Indonesia di Semarang pada tahun 1954, beliau mengatakan : Jika kita merasa sebagai orang Kristen yang baik, kita semestinya juga menjadi seorang patriot yang baik ",
      "img": "https://image.ibb.co/kbtbtz/albertus_soegijapranata.jpg"
    },
    {
      "nama": "Ali Haji",
      "nama2": "Raja Ali Haji Bin Raja Haji Ahmad",
      "kategori": "Pahlawan Nasional",
      "asal": "Kepulauan Riau",
      "lahir": "1808   di Selangor",
      "usia": "65 tahun",
      "gugur": "1873   di Pulau Penyengat, Kepulauan Riau, Indonesia.",
      "lokasimakam": "Pulau Penyengat, Kota Tanjung Pinang",
      "history": "Sejarawan, pujangga, dan penulis buku. Pencatat pertama dasar-dasar tata bahasa Melayu, yang kelak dalam Kongres Pemuda Indonesia 28 Oktober 1928 ditetapkan sebagai Bahasa Indonesia.Raja Ali Haji Ahmad merupakan keturunan kedua (cucu) dari Raja Haji Fisabilillah, Yang Dipertuan IV dari Kesultanan Lingga-Riau dan juga merupakan bangsawan Bugis. Karya monumentalnya, Gurindam Dua Belas (1847), menjadi pembaru arus sastra pada zamannya.Bukunya berjudul Kitab Pengetahuan Bahasa, yaitu Kamus Loghat Melayu-Johor-Pahang-Riau-Lingga penggal yang pertama merupakan kamus ekabahasa pertama di Nusantara. Ia juga menulis Syair Siti Shianah, Syair Suluh Pegawai, Syair Hukum Nikah, dan Syair Sultan Abdul Muluk. Raja Ali Haji juga patut diangkat jasanya dalam penulisan sejarah Melayu.Tahun kapan meninggalnya Raja Ali Haji bin Raja Haji Ahmad sempat menjadi perdebatan.Banyak sumber yang menyebutkan bahwa ia meninggal pada tahun 1872. Namun, ternyata ada fakta lain yang membalikkan pandangan umum tersebut. Pada tanggal 31 Desember 1872, Raja Ali Haji bin Raja Haji Ahmad pernah menulis surat kepada Herman Von De Wall, sarjana kebudayaan Belanda yang kemudian menjadi sahabat terdekatnya, yang meninggal di Tanjungpinang pada tahun 1873. Dari fakta ini dapat dikatakan bahwa RAH meninggal pada tahun yang sama (1873) di Pulau Penyengat.Makam Raja Ali Haji bin Raja Haji Ahmad berada di komplek pemakaman Engku Putri Raja Hamidah. Persisnya, terletak di luar bangunan utama Makam Engku Putri. Karya Raja Ali Haji bin Raja Haji Ahmad, Gurindam Dua Belas diabadikan di sepanjang dinding bangunan makamnya. Sehingga, setiap pengunjung yang datang dapat membaca serta mencatat karya maha agung tersebut. Ia ditetapkan oleh pemerintah Republik Indonesia sebagai pahlawan nasional pada 5 November tahun 2004.",
      "img": "https://image.ibb.co/df3WRK/ali_haji.jpg"
    },
    {
      "nama": "Alimin ",
      "nama2": "Alimin bin Prawirodirdjo",
      "kategori": "Pahlawan Kemerdekaan Nasional ",
      "asal": "Jawa Tengah",
      "lahir": "1889   di Solo, Jawa Tengah, Indonesia",
      "usia": "75 tahun",
      "gugur": "Rabu Pahing, 24 Juni 1964   di Jakarta, Indonesia",
      "lokasimakam": "Taman Makam Pahlawan (TMP) Kalibata, Jakarta.",
      "history": "Tokoh pergerakan kemerdekaan Indonesia serta tokoh komunis Indonesia",
      "img": "https://image.ibb.co/eaqZfe/alimin.jpg"
    },
    {
      "nama": "Amir Hamzah ",
      "nama2": "Tengkoe Amir Hamzah Pangeran Indra Poetera",
      "kategori": "Pahlawan Nasional",
      "asal": "Sumatera Utara",
      "lahir": "Selasa, 28 Februari 1911 di Tanjung Pura, Langkat, Sumatera Utara",
      "usia": "35 tahun",
      "gugur": "Rabu Legi, 20 Maret 1946 di Kwala Begumit, Binjai, Langkat, Sumatera Utara",
      "lokasimakam": "Kompleks Masjid Azizi, di Tanjungpura, Kabupaten Langkat, Sumatera Utara",
      "history": "Sastrawan (Penyair) dan sering disebut Raja Penyair Zaman Pujangga Baru. Satu-satunya Penyair Indonesia berkelas internasional pada era pra-Revolusi Nasional Indonesia.Lahir dari lingkungan keluarga bangsawan Melayu di Kesultanan Langkat membuat Amir Hamzah akrab dalam suasana alam sastra kebudayaan Melayu. Agaknya, lingkungan inilah yang mempengaruhi minat Amir Hamzah pada dunia sastra, terutama sastra Melayu. Amir Hamzah adalah seorang sastrawan pra Indonesia yang oleh sastrawan periode Indonesia seperti HB Jassin dikelompokkan dalam Angkatan Pujangga Baru. Meskipun berasal dari kalangan bangsawan berkultur Melayu, tetapi tidak seluruh corak sastra Amir Hamzah dipengaruhi oleh sastra Melayu. Memasuki usia remaja, Amir Hamzah menyelesaikan masa belajarnya di Jawa, di sekolah menengah (MULO) Medan dan pindah di MULO Jakarta, Aglemeene Middelbare School (AMS) jurusan Sastra Timur di Solo, lantas kembali lagi ke Jakarta di Sekolah Tinggi Hukum. Semasa studi di AMS Solo, Amir Hamzah menulis sebagian besar sajak-sajak pertamanya. Latar pendidikan sekolah di Tanjung Pura yang menggunakan bahasa Belanda dan sekolah menengah di Jawa serta kegiatan pergerakan di Solo membuat horison pengetahuan Amir Hamzah semakin kaya dengan perpaduan kebudayaan modern (Eropa), kebudayaan Jawa, bahkan secara umum kebudayaan Asia. Horison perjumpaan kebudayaan dalam diri Amir Hamzah dapat dilihat dari karya Buah Rindu (ditulis 1928-1935) yang memadukan syair Melayu dalam sajak Eropa. Tentu saja ini penilaian yang bersifat mimetik. Penilaian mimetik yaitu pendekatan kritik sastra dalam pandangan semesta pemikiran yang melingkupi kelahiran sebuah sastra (Teeuw, 1984:50). Amir Hamzah wafat di Kuala Begumit dalam suatu tragedi kematian yang tragis pada tanggal 20 Maret 1946. Amir Hamzah meninggal dunia saat berusia 35 tahun. Sebagian peneliti menyebut kematian Amir Hamzah sebagai korban revolusi sosial di era awal kemerdekaan. Amir Hamzah dimakamkan di pemakaman Mesjid Azizi, Tanjung Pura, Langkat. Ia diangkat menjadi Pahlawan Nasional Indonesia berdasarkan SK Presiden RI Nomor 106/tahun 1975 , tanggal 3 November 1975. Karena hasil karyanya tersebut maka Pemerintah Kabupaten Langkat membangun Monumen Tengku Amir Hamzah guna mengenang segala jasa beliau terhadap daerah asalnya sendiri.",
      "img": "https://image.ibb.co/hKOn0e/amir_hamzah.jpg"
    },
    {
      "nama": "Andi Djemma",
      "nama2": "Andi Djemma",
      "kategori": "Pahlawan Nasional",
      "asal": "Sulawesi Selatan",
      "lahir": "Selasa, 15 Januari 1901   di Palopo, Sulawesi Selatan",
      "usia": "65 tahun",
      "gugur": "Selasa, 23 Februari 1965   di Makassar, Sulawesi Selatan",
      "lokasimakam": "Taman Makam Pahlawan Panaikang, Makassar, Sulawesi Selatan",
      "history": "Raja (Datu) Luwu. Aktifis Kemerdekaan, memimpin Perlawanan Semesta Rakyat Luwu terhadap Belanda selama Revolusi Nasional.Menjelang kemerdekaan Indonesia pada 15 Agustus 1945, Andi Djemma memimpin Gerakan Soekarno Muda dan memimpin Perlawanan Semesta Rakyat Luwu pada 23 Januari 1946. Tanggal itu sekarang diperingati sebagai Hari Perlawanan Rakyat Semesta.Pada 5 Oktober 1945, Andi Djemma sempat mengultimatum pihak Sekutu agar segera melucuti tentaranya dan kembali ke tangsinya di Palopo. Ultimatum itu dibalas Gubernur Jenderal Belanda, Van Mook, dengan ultimatum juga. Andi Djemma yang mempunyai lima putera itu baru tertangkap Belanda pada 3 Juli 1946 dan diasingkan ke Ternate. Ia akhirnya meninggal di Makassar pada 23 Februari 1965.",
      "img": "https://image.ibb.co/nM5d6K/andi_djemma.jpg"
    },
    {
      "nama": "Andi Mapanyuki",
      "nama2": "Andi Mappanyukki Sultan Ibrahim",
      "kategori": "Pahlawan Nasional",
      "asal": "Sulawesi Selatan",
      "lahir": "1885 di Bone, Sulawesi Selatan",
      "usia": "82 tahun",
      "gugur": "Selasa, 18 April 1967   di Jonggaya (Jl. Kumala no.160) Makassar, Sulawesi ",
      "lokasimakam": "Taman Makam Pahlawan (TMP) Panaikang, Makassar, Sulawesi Selatan",
      "history": "Raja Bone ke-XXXII dengan gelar Sultan Ibrahim. Pejuang Kemerdekaan, memimpin perlawanan terhadap Belanda. Ayah dari Andi Abdullah Bau Massepe (juga Pahlawan Nasional).Beliau sejak berusia 20 tahun sudah mengangkat senjata untuk berperang mengusir kolonial Belanda, perang yang dijalaninya di masa muda itu ketika mempertahankan pos pertahanan kerajaan Gowa di daerah Gunung Sari. Pada tahun 1931 atas usulan dewan adat beliau diangkat menjadi Raja Bone ke-XXXII dengan gelar Sultan Ibrahim, sehingga beliau bernama lengkap Andi Mappanyukki Sultan Ibrahim. Karena menolak bersekutu dengan Belanda, Beliau pun “diturunkan” sebagai raja Bone oleh kekuatan dan kekuasaan Belanda, kemudian diasingkan bersama Istri permaisurinya I' Mane'ne Karaengta Ballasari dan Putra Putrinya selama 3,5 tahun di Rantepao, Tana Toraja. Andi Pangerang Petta Rani yang lahir dari Istrinya yang bernama I Batasi Daeng Taco dan dari Istrinya yang bernama Besse Bulo lahirlah Putranya yaitu Andi Abdullah Bau Massepe yang dikenal juga sebagai pejuang kemerdekaan dan mendapat gelar Pahlawan Nasional. Adapun Putrinya yang dilahirkan dari Istri Permaisurinya I Mane'ne Karaengta Balla Sari Bernama Andi Bau Tenri Padang Opu Datu ikut berjuang bersama suaminya Andi Djemma Datu Luwu (Raja Luwu) yang berasal dari Sulawesi Selatan. Beliau Mangkat pada tanggal 18 April 1967 di Jongaya (Jl. Kumala no.160 Makassar dan masih terjaga dan terawat sampai sekarang sebagai Rumah Ex. Raja Bone Andi Mappanyukki), dimana daerah beliau juga dilahirkan. Makamnya tidak diletakkan di pemakaman raja-raja Gowa atau Bone lazimnya, tetapi oleh masyarakat dan pemerintah Republik Indonesia Makamnya di letakkan di Taman makam Pahlawan Panaikang Makassar (Ujung Pandang) dengan upacara kenegaraan.",
      "img": "https://image.ibb.co/bZh2Yz/andi_mapanyuki.jpg"
    },
    {
      "nama": "Arie Frederik Lasut",
      "nama2": "A.F.Lasut",
      "kategori": "Pahlawan Nasional",
      "asal": "Sulawesi Utara",
      "lahir": "Sabtu, 6 Juli 1918   di Kapataran, Lembean Timur, Minahasa, Sulawesi Utara",
      "usia": "30 tahun",
      "gugur": "Sabtu, 7 Mei 1949   di Pakem, Sleman, Yogyakarta",
      "lokasimakam": "TPU Sasanalaya, Jl Ireda No. 4 Yogyakarta.",
      "history": "Kepala Pertambangan dan Geologi RI ke 1. Terlibat dalam perang kemerdekaan Indonesia serta pengembangan pertambangan dan geologi. Akhirnya ditembak mati oleh Belanda.Arie menempuh pendidikan di HIS (Hollands Inlandsche School) di Tondano dan melanjutkan di HIK (Hollands Inlandsche Kweekschool) di Ambon. Tahun 1933 ia melanjutkan ke HIK di Bandung. Ia dapat melanjutkan ke Bandung karena prestasinya hebat. Setahun kemudian Arie Lasut pindah ke Jakarta dan masuk AMS (Algemeene Middelbare School). Ia lulus AMS tahun 1937 dan melanjutkan studi ke Geneeskundige Hooge School (sekarang Fakultas Kedokteran Universitas Indonesia). Arie Lasut berhenti dari sekolah ini karena kesulitan dana. Tahun 1938 Arie Lasut bekerja di Departement van Economiesche Zaken (Departemen Urusan Ekonomi). Bulan Septemper 1945 ada Instruksi Presiden untuk mengambil alih instansi-instansi dari pemerintah Jepang. Lasut ikut serta dalam pengambilalihan jawatan geologis dari Jepang yang berhasil dilakukan secara damai (Arie Lasut memang dikenal sebagai ahli pertambangan dan geologi). Jawatan itu kemudian dinamakan Jawatan Pertambangan dan Geologi. Kantor jawatan terpaksa harus dipindah beberapa kali untuk menghindari agresi Belanda setelah proklamasi kemerdekaan Indonesia. Kantor jawatan sempat pindah ke Tasikmalaya, Magelang, dan Yogyakarta dari tempat semulanya di Bandung. Sekolah pelatihan geologis juga dibuka selama kepemimpinan Lasut sebagai kepala jawatan saat itu. Selain usahanya di jawatan, Lasut turut aktif dalam organisasi Kebaktian Rakyat Indonesia Sulawesi (KRIS) yang bertujuan untuk membela kemerdekaan Indonesia. Dia juga adalah anggota Komite Nasional Indonesia Pusat, awal mula dewan perwakilan rakyat. Lasut terus diincar oleh Belanda karena pengetahuannya tentang pertambangan dan geologi di Indonesia, tetapi ia tidak pernah mau bekerja sama dengan mereka. Pada pagi hari tanggal 7 Mei 1949, Lasut diambil oleh Belanda dari rumahnya dan dibawa ke Pakem, sekitar 7 kilometer di utara Yogyakarta. Di sana ia ditembak mati. Beberapa bulan kemudian jenazahnya dipindahkan ke pekuburan Sasanalaya Jl. Ireda di Yogyakarta di samping istrinya yang telah lebih dulu meninggal pada bulan Desember 1947. Upacara penguburan dihadiri oleh Mr Assaat, pejabat presiden pada saat itu. Arie Frederik Lasut mendapat penghargaan Pahlawan Pembela Kemerdekaan oleh pemerintah Indonesia pada tanggal 20 Mei 1969 dengan Surat Keputusan Presiden Republik Indonesia Nomor 012/TK/1969.",
      "img": "https://image.ibb.co/djv0Le/arie_frederik_lasut.jpg"
    },
    {
      "nama": "Bagindo Azizchan",
      "nama2": "Bagindo Azizchan",
      "kategori": "Pahlawan Nasional",
      "asal": "Sumatera Barat",
      "lahir": "Jumat, 30 September 1910   di Padang, Sumatera Barat",
      "usia": "36 tahun",
      "gugur": "Sabtu, 19 Juli 1947   di Padang, Sumatera Barat",
      "lokasimakam": "Taman Makam Pahlawan (TMP) Bahagia, Bukittinggi, Sumatera Barat.",
      "history": "Walikota Padang ke 2. Meninggal setelah terlibat dalam sebuah pertempuran melawan Belanda.",
      "img": "https://image.ibb.co/fLJ3qe/bagindo_azizchan.jpg"
    },
    {
      "nama": "Basuki Rahmat",
      "nama2": "Jenderal Basuki Rachmat",
      "kategori": "Pahlawan Nasional",
      "asal": "Jawa Timur",
      "lahir": "Jumat, 4 November 1921   di Tuban, Jawa Timur",
      "usia": "45 tahun",
      "gugur": "Rabu, 8 Januari 1969   di Jakarta, Indonesia",
      "lokasimakam": "Taman Makam Pahlawan (TMP) Kalibata, Jakarta.",
      "history": "Jenderal Basuki Rahmat adalah seorang jenderal dan politikus Indonesia. Ia merupakan seorang pahlawan nasional Indonesia. Sebelum menjadi militer, sebenarnya Basuki muda ingin menjadi guru hingga meneruskan pendidikannya di Sekolah Guru Muhammadiyah, Yogyakarta. Akan tetapi jalan hidup membuatnya mengikuti pendidikan Pembela Tanah Air. Selepas pendidikan Basuki ditempatkan di Pacitan dengan pangkat shodancho (Komandan Pelopor). Memasuki era perjuangan kemerdekaan, ia juga turut dalam pembentukan Badan Keamanan Rakyat Maospati, Jawa Timur. Bakat kepemimpinannya yang menonjol membuat ia ditunjuk menjadi Komandan Batalyon 2 Resimen 31 Divisi IV Ronggolawe dan kemudian ditunjuk menjadi Komandan Batalyon 16 Brigade 5 Divisi I Jawa Timur. Basuki Rahmat lalu ditunjuk sebagai Panglima Komando Daerah Militer (KODAM) VIII / Brawijaya di Surabaya dengan pangkat Mayor Jenderal. Ia ikut mengambil peran penting dalam menyadarkan Prajurit Jajaran Kodam agar tidak terhasut PKI. Dalam posisi pemerintahan beliau pernah menjabat sebagai Menteri Veteran Letnan dalam Kabinet Dwikora pimpinan Soekarno pada periode 1964-1966. Ia juga merupakan salah satu saksi kunci perisitiwa Supersemar beserta Jenderal Amirmachmud dan Jenderal M. Jusuf. Melalui Supersemar itu, terjadilah titik balik. PKI yang sebelumnya mulai melancarkan tindak kekerasan, akhirnya bisa dihancurkan. Dalam memulihkan keadaan itu, jasa Basuki Rahmat sangat besar. Basuki tutup usia di Jakarta pada 8 Januari 1969 akibat penyakit jantung. Beliau dimakamkan di Taman Makam Pahlawan Kalibata. Atas jasanya pada negara, Jenderal TNI Anumerta Basuki Rahmat diberi gelar pahlawan nasional pada 9 Januari 1969.",
      "img": "https://image.ibb.co/bxB1bK/basuki_rahmat.jpg"
    },
    {
      "nama": "Bau Massepe",
      "nama2": "Letjen. Andi Abdullah Bau Massepe",
      "kategori": "Pahlawan Nasional",
      "asal": "Sulawesi Selatan",
      "lahir": "1918   di Massepe, Kabupaten Sidenreng Rappang, Sulawesi Selatan",
      "usia": "29 tahun",
      "gugur": "Minggu, 2 Februari 1947   di Pare-Pare, Sulawesi Selatan",
      "lokasimakam": "Taman Makam Pahlawan (TMP) Kota Pare-Pare, Sulawesi Selatan.",
      "history": "Pejuang heroik dan Panglima pertama TRI Divisi Hasanuddin. Pewaris tahta Kerajaan Bone, Gowa, Suppa, Allita, Sidenreng Rappang dan Sawito. Putra dari Andi Mappanyukki (juga Pahlawan Nasional).",
      "img": "https://image.ibb.co/kzr1bK/bau_massepe.jpg"
    },
    {
      "nama": "Bernard Wilhelm Lapiran",
      "nama2": "BW Lapian",
      "kategori": "Pahlawan Nasional",
      "asal": "Sulawesi Utara",
      "lahir": "Kamis, 30 Juni 1892   di Kawangkoan, Indonesia",
      "usia": "84 tahun",
      "gugur": "Selasa, 5 April 1977   di Jakarta, Indonesia",
      "lokasimakam": "Taman Makam Pahlawan (TMP) Kalibata, Jakarta",
      "history": "Tokoh pejuang nasionalis yang aktif di dunia jurnalisme dan sering disebut tokoh 3 zaman. Anggota Dewan Minahasa. Menjadi Kepala Distrik dan pada 1945 menjadi Wali Kota Manado. Menyerbu markas NICA di Teling dan berhasil membebaskan para tokoh perjuang Indonesia. Berperan besar pada Peristiwa Merah Putih 14 Februari 1946 di Manado. BW Lapian ditangkap tentara penjajah Belanda dan dipenjara di Tangsi Teling 11 Maret 1946. Setelah itu dipindahkan ke penjara di Cipinang lalu ke penjara Sukamiskin, akhirnya dibebaskan 20 Desember 1949. Penerima penghargaan Bintang Gerilya dan Bintang Mahaputra. Menjadi Gubernur Sulawesi di era pemerintahan Sukarno.Bernard Wilhelm Lapian (BW Lapian) adalah Pahlawan Nasional Indonesia (Keppres No. 116/TK/2015, tanggal 4 November 2015). Semasa bekerja di Batavia, beliau menulis di surat kabar Pangkal Kemadjoean yang memperlihatkan sikap nasionalisme untuk membebaskan warga Indonesia dari kolonialisme. Pada 1930 hingga 1934, Lapian menjadi anggota Dewan Minahasa dan memperjuangkan pembangunan fasilitas publik, infrastruktur, rumah sakit, dan lainnya bagi kepentingan rakyat. Semasa pendudukan Jepang, Lapian pernah menjadi Gunco (Kepala Distrik) dan pada 1945 menjadi Wali Kota Manado. Karena menolak mengembalikan kekuasaan pemerintah kepada Nederlandsch Indië Civil Administration (NICA), ia pernah dijebloskan ke dalam penjara di Teling, Manado. Pada 1947 dipindahkan ke penjara Cipinang, Jakarta dan pada 1948 dipindahkan lagi ke penjara Sukamiskin, Bandung, sebelum akhirnya dibebaskan pada 20 Desember 1949. Saat menjadi Gubernur Sulawesi di Makassar, Lapian bertugas menyelesaikan masalah perlawanan pemberontak Kahar Muzakar di Sulawesi Selatan secara damai. Bernard Wilhem Lapian berperan besar pada momen heroik Peristiwa Merah Putih 14 Februari 1946 di Manado. Peristiwa itu merebut tangsi militer Belanda di Teling Manado. Ia memimpin pasukan pemuda bersama Letkol Ch Taulu dan Serda SD Wuisan merobek bagian biru bendera Belanda hingga berkibar bendera Merah Putih.",
      "img": "https://image.ibb.co/fr3Q3z/bernard_wilhelm_lapian.jpg"
    },
    {
      "nama": "Cipto Mangunkusumo",
      "nama2": "dr. Tjipto Mangoenkoesoemo",
      "kategori": "Pahlawan Kemerdekaan Nasional",
      "asal": "Jawa Tengah",
      "lahir": "1886   di Pecangakan, Ambarawa, Semarang",
      "usia": "57 tahun",
      "gugur": " Senin, 8 Maret 1943   di Jakarta, Indonesia",
      "lokasimakam": "Taman Makam Pahlawan (TMP) Ambarawa, Jawa Tengah.",
      "history": "Tokoh pergerakan kemerdekaan Indonesia. Ketua Komite Bumi Putera. Tokoh Indische Partij. Bersama dengan Ernest Douwes Dekker dan Ki Hajar Dewantoro dikenal sebagai Tiga Serangkai.",
      "img": "https://image.ibb.co/ft8Q3z/cipto_mangunkusumo.jpg"
    },
    {
      "nama": "Cut Nyak Dhien",
      "nama2": "Tjut Njak Dhien",
      "kategori": "Pahlawan Kemerdekaan Nasional",
      "asal": "NAD (Aceh)",
      "lahir": "1848 di Lampadang, Kerajaan Aceh (Aceh Besar, Wilayah VI Mukim)",
      "usia": "60 tahun",
      "gugur": "Jumat, 6 November 1908   di Sumedang, Jawa Barat",
      "lokasimakam": "Gunung Puyuh, Sumedang, Jawa Barat.",
      "history": "Pemimpin Gerilya Aceh yang berperang melawan Pasukan Kolonial Belanda pada masa perang Aceh (1873-1904). Istri Teuku Umar (juga Pahlawan Nasional).Pada usia 12 tahun, ia sudah dinikahkan oleh orangtuanya pada tahun 1862 dengan Teuku Cek Ibrahim Lamnga, putra dari uleebalang Lamnga XIII. Mereka memiliki satu anak laki-laki. Setelah wilayah VI Mukim diserang, ia mengungsi, sementara suaminya Ibrahim Lamnga bertempur melawan Belanda. Ibrahim Lamnga tewas di Gle Tarum pada tanggal 29 Juni 1878 yang menyebabkan Cut Nyak Dhien sangat marah dan bersumpah hendak menghancurkan Belanda. Teuku Umar, salah satu tokoh yang melawan Belanda, melamar Cut Nyak Dhien. Pada awalnya Cut Nyak Dhien menolak, tetapi karena Teuku Umar memperbolehkannya ikut serta dalam medan perang, Cut Nyak Dhien setuju untuk menikah dengannya pada tahun 1880. Mereka dikaruniai anak yang diberi nama Cut Gambang. Setelah pernikahannya dengan Teuku Umar, ia bersama Teuku Umar bertempur bersama melawan Belanda. Namun, Teuku Umar gugur saat menyerang Meulaboh pada tanggal 11 Februari 1899, sehingga ia berjuang sendirian di pedalaman Meulaboh bersama pasukan kecilnya. Cut Nyak Dien saat itu sudah tua dan memiliki penyakit encok dan rabun, sehingga satu pasukannya yang bernama Pang Laot melaporkan keberadaannya karena iba. Ia akhirnya ditangkap dan dibawa ke Banda Aceh. Di sana ia dirawat dan penyakitnya mulai sembuh. Namun, keberadaannya menambah semangat perlawanan rakyat Aceh. Ia juga masih berhubungan dengan pejuang Aceh yang belum tertangkap. Akibatnya, Dhien dibuang ke Sumedang. Tjoet Nyak Dhien meninggal pada tanggal 6 November 1908 dan dimakamkan di Gunung Puyuh, Sumedang, Jawa Barat.",
      "img": "https://image.ibb.co/jDKiyU/cut_nyak_dhien_kerudung.jpg"
    },
    {
      "nama": "Cut Nyak Meutia",
      "nama2": "Tjut Meutia",
      "kategori": "Pahlawan Kemerdekaan Nasional",
      "asal": "NAD (Aceh)",
      "lahir": "1870   di Keureutoe, Pirak, Aceh Utara, NAD, Indonesia.",
      "usia": "40 tahun",
      "gugur": " Senin, 24 Oktober 1910   di Alue Kurieng, NAD (Aceh), Indonesia.",
      "lokasimakam": "Alue Kurieng, NAD (Aceh).",
      "history": "Pemimpin Gerilya Aceh yang berperang melawan Pasukan Kolonial Belanda. Gugur pada pertempuran di Alue Kurieng tanggal 24 Oktober 1910.",
      "img": "https://image.ibb.co/e99Xiz/cut_nyak_meutia.jpg"
    },
    {
      "nama": "D.I Pandjaitan",
      "nama2": "Mayjen. Donald Issac Panjaitan",
      "kategori": "Pahlawan Revolusi",
      "asal": "Sumatra Utara",
      "lahir": "Jumat, 19 Juni 1925   di Balige, ",
      "usia": "40 tahun",
      "gugur": "Jumat Legi, 1 Oktober 1965   di Lubang Buaya, Jakarta",
      "lokasimakam": " Taman Makam Pahlawan (TMP) Kalibata, Jakarta.",
      "history": " Jenderal Angkatan Darat, Asisten IV Menteri/Panglima Angkatan Darat, korban kebiadaban (dibunuh) Gerakan 30 September",
      "img": "https://image.ibb.co/bNG6Ae/d_i_pandjaitan.jpg"
    },
    {
      "nama": "Dewi Sartika",
      "nama2": "Raden Dewi Sartika",
      "kategori": "Pahlawan Nasional",
      "asal": "Jawa Barat",
      "lahir": "Kamis Legi, 4 Desember 1884   di Cicalengka, Bandung, Jawa Barat",
      "usia": "62 tahun",
      "gugur": "Kamis Legi, 11 September 1947   di Tasikmalaya, Jawa Barat",
      "lokasimakam": "Kompleks Pemakaman Bupati Bandung di Jalan Karang Anyar, Bandung, Jawa Barat.",
      "history": "Tokoh perintis pendidikan untuk kaum wanita. Mendirikan Sekolah Pertama untuk Perempuan.",
      "img": "https://image.ibb.co/e3X2iz/dewi_sartika.jpg"
    },
    {
      "nama": "Diponegoro",
      "nama2": "Pangerang Diponegoro, Raden Mas Ontowiryo",
      "kategori": "Pahlawan Nasional",
      "asal": "DIY (Yogyakarta)",
      "lahir": "Jumat Wage, 11 November 1785   di Yogyakarta, Indonesia",
      "usia": "69 tahun",
      "gugur": "Senin, 8 Januari 1855   di Makassar, Sulawesi Selatan",
      "lokasimakam": "Jalan Diponegoro, Kelurahan Melayu, Kecamatan Wajo, Makassar, Sulawesi Selatan.",
      "history": "Pemimpin Perang Jawa Terbesar melawan Belanda (Perang Diponegoro, 1825-1830). Penghargaan tertinggi diberikan Dunia (UNESCO) pada 21 Juni 2013 menetapkan Babad Diponegoro sebagai Memory of the World.",
      "img": "https://image.ibb.co/fV2rbK/diponegoro.jpg"
    },
    {
      "nama": "Djatikusumo ",
      "nama2": "Jenderal Goesti Pangeran Harjo Djatikoesoemo",
      "kategori": "Pahlawan Nasional",
      "asal": "Jawa Tengah",
      "lahir": "Minggu, 1 Juli 1917   di Surakarta, Jawa Tengah",
      "usia": "75 tahun",
      "gugur": "Sabtu, 4 Juli 1992   di Jakarta, Indonesia",
      "lokasimakam": "Wonogiri, Jawa Tengah",
      "history": " Pejuang dari Keraton Surakarta. Kepala Staf TNI Angkatan Darat yang pertama. Duta Besar RI. Menteri Kebudayaan dan Pariwisata yang pertama. Menteri Perhubungan.",
      "img": "https://image.ibb.co/cJu4wK/djatikusumo.jpg"
    },
    {
      "nama": "Douwes Dekker",
      "nama2": "Dr. Ernest Douwes Dekker",
      "kategori": "Pahlawan Kemerdekaan Nasional ",
      "asal": "Jawa Timur",
      "lahir": "Rabu, 8 Oktober 1879   di Pasuruan, Jawa Timur",
      "usia": "70 tahun",
      "gugur": "Senin, 28 Agustus 1950   di Bandung, Jawa Barat",
      "lokasimakam": "Taman Makam Pahlawan (TMP) Cikutra, Bandung, Jawa Barat.",
      "history": "Pejuang Pergerakan Kemerdekaan Indonesia, Politikus, Wartawan, Aktivis, Penulis. Salah satu dari Tiga Serangkai. Penggagas nama Nusantara. Peletak dasar nasionalisme Indonesia di awal abad ke-20.",
      "img": "https://image.ibb.co/fm3xGK/douwes_dekker.jpg"
    },
    {
      "nama": "Fakhruddin ",
      "nama2": "K.H. Fachruddin, Muhammad Jazuli",
      "kategori": "Pahlawan Kemerdekaan Nasional",
      "asal": "DIY (Yogyakarta)",
      "lahir": "1890   di Yogyakarta, Indonesia",
      "usia": "39 tahun",
      "gugur": "Kamis, 28 Februari 1929   di Yogyakarta,Indonesia",
      "lokasimakam": "Taman Makam Pahlawan (TMP) Kuncen, Yogyakarta.",
      "history": "Pejuang Pergerakan Kemerdekaan Indonesia. Seorang Tokoh Muhammadiyah yang serba bisa. Perunding dalam Negosiasi untuk Perlindungan Jamaah Haji dari Nusantara (Indonesia, 1921-1929).Fakhruddin dianggap sebagai seorang tokoh yang serba bisa. Karena itu, silih berganti tugas penting diserahkan kepadanya, antara lain mengurus bagian dakwah, bagian taman pustaka, dan bagian pengajaran. Tahun 1921 ia diutus ke Mekah selama 8 tahun untuk meneliti nasib para jemaah haji yang berasal dari Indonesia karena mereka seringkali mendapat perlakuan kurang baik dari pejabat-pejabat Mekah. Sekembalinya, memprakarsai pembentukan Badan Penolong Haji. Selain itu, ia pernah pula diutus ke Kairo sebagai wakil umat Islam Indonesia untuk menghadiri Konferensi Islam.Kesibukannya mengurus Muhammadiyah dan usahanya, membuatnya kurang memperhatikan kesehatannya. Menjelang kongres Muhammadiyah di Yogyakarta pada tahun 1929, ia jatuh sakit. Pada tanggal 28 Februari 1929, ia akhirnya meninggal dunia di Yogyakarta dan dikebumikan di Pakuncen, Yogyakarta.",
      "img": "https://image.ibb.co/eqjnGK/fakhruddin.jpg"
    },
    {
      "nama": "Fatmawati ",
      "nama2": "Hj. Fatmawati Soekarno",
      "kategori": "Pahlawan Nasional",
      "asal": "Bengkulu",
      "lahir": "Senin, 5 Februari 1923   di Bengkulu, Indonesia",
      "usia": "57 tahun",
      "gugur": "Rabu Kliwon, 14 Mei 1980   di Kuala Lumpur, Malaysia",
      "lokasimakam": "TPU Karet Bivak, Jakarta",
      "history": "Penjahit Bendera Nasional Indonesia Pertama, Aktifis Sosial, Istri Presiden Sukarno",
      "img": "https://image.ibb.co/cFW1bK/fatmawati.jpg"
    },
    {
      "nama": "FL Tobing ",
      "nama2": "dr. Ferdinand Lumbantobing",
      "kategori": "Pahlawan Kemerdekaan Nasional",
      "asal": "Sumatera Utara",
      "lahir": "Minggu, 19 Februari 1899   di Sibuluan, Sibolga, Sumatera Utara",
      "usia": "63 tahun ",
      "gugur": "Minggu, 7 Oktober 1962   di Jakarta, Indonesia",
      "lokasimakam": "Desa Kolang, Kabupaten Tapanuli Tengah, Sumatera Utara",
      "history": "Dokter dan Politisi, Berjuang untuk Hak-Hak Pekerja Paksa. Gubernur Sumatera Utara. Menteri Tenaga Kerja dan Transmigrasi. Menteri Penerangan. Menteri Kesehatan.Pada tahun 1943 ia diangkat menjadi Syu Sangi Kai' (DPD) Tapanuli dan juga sebagai Chuo Sangi In (DPP).Setelah kemerdekaan ia diangkat menjabat beberapa jabatan penting seperti Menteri Penerangan dan Menteri Kesehatan (ad interim). Selain itu ia juga pernah menjabat sebagai Gubernur Sumatera Utara.Beliau dimakamkan di Desa Kolang, Kabupaten Tapanuli Tengah, Sumatera Utara.",
      "img": "https://image.ibb.co/eyD3qe/fl_tobing.jpg"
    },
    {
      "nama": "Frans Kaisiepo",
      "nama2": "Frans Kaisiepo",
      "kategori": "Pahlawan Nasional",
      "asal": "Papua",
      "lahir": "Senin, 10 Oktober 1921   di Wardo, Biak, Papua, Indonesia",
      "usia": "57 tahun",
      "gugur": "Selasa, 10 April 1979   di Jayapura, Papua, Indonesia",
      "lokasimakam": "Taman Makam Pahlawan (TMP) Cendrawasih, Jayapura, Papua, Indonesia.",
      "history": "Nasionalis Papua dan Aktifis Kemerdekaan Indonesia yang membantu Pembentukan NKRI (Negara Kesatuan Republik Indonesia). Gubernur Papua ke 4.",
      "img": "https://image.ibb.co/jO4nGK/frans_kaisiepo.jpg"
    },
    {
      "nama": "Gatot Mangkupraja ",
      "nama2": "Gatot Mangkupraja ",
      "kategori": "Pahlawan Nasional",
      "asal": "Jawa Barat",
      "lahir": "Minggu, 25 Desember 1898   di Sumedang, Jawa Barat",
      "usia": "69 tahun",
      "gugur": "Jumat, 4 Oktober 1968   di Bandung, Jawa Barat",
      "lokasimakam": "Pemakaman Umum Sirnaraga, Bandung, Jawa Barat.",
      "history": "Aktifis Kemerdekaan dan Politisi. Yang mengusulkan pembentukan Tentara Pembela Tanah Air (PETA).Keterlibatan Gatot Mangkoepradja dalam pergerakan nasional diawali ketika ia bergabung dengan Perhimpunan Indonesia (PI). Ketika Partai Nasional Indonesia (PNI) berdiri di Bandung pada tanggal 4 Juli 1927, Gatot Mangkoepradja segera menggabungkan diri dengan organisasi yang dipimpin oleh Ir. Soekarno itu. Akibat menjunjung tinggi konsep revolusi Indonesia, maka pada tanggal 24 Desember 1929 Pemerintah Hindia Belanda mengeluarkan perintah penangkapan terhadap Gatot Mangkoepradja dan para pemimpin PNI lainnya. Penangkapan terhadap Gatot Mangkoepradja baru dapat dilakukan pada tanggal 29 Desember 1929 di Yogyakarta. Gatot ditangkap bersama-sama dengan Ir. Soekarno. Mereka kemudian dibawa ke Bandung dan dijebloskan ke Penjara Banceuy.Pada tanggal 18 Agustus 1930, Gatot Mangkoepradja mulai dihadapkan ke Landraad Bandung bersama-sama dengan Ir. Soekarno, Maskoen Soemadiredja, dan Soepriadinata. Mereka dijerat dengan tuduhan Pasal 169 bis dan 153 bis Wetboek van Strafrecht (KUHP-nya zaman kolonial). Mereka diadili dengan Hakim Ketua: Mr. Siegenbeek van Heukelom dengan Jaksa Penuntut: R. Soemadisoerja. Peristiwa ini dikenal dengan nama Indonesia Menggugat.Pada tanggal 25 April 1931, akibat perpecahan PNI menjadi Partindo dan PNI-Baru, maka Gatot Mangkoepradja bergabung dengan Partindo karena ia merasa partai ini mempunyai persamaan ideologi dengan PNI. Namun tak lama, akhirnya ia keluar dari Partindo karena merasa kecewa dengan Soekarno dan bergabung dengan PNI-Baru pimpinan Hatta.Pada masa penjajahan Jepang, Gatot Mangkoepradja yang telah dikenal baik oleh Jepang diberi wewenang untuk menjalankan Gerakan 3 A yaitu Nippon Pelindung Asia, Nippon Cahaya Asia, Nippon Pemimpin Asia. Akan tetapi usaha Jepang ini gagal karena Gatot Mangkoepradja tidak mau kooperatif. Karena penolakan ini maka ia ditahan oleh Kempeitei. Setelah keluar dari tahanan, beliau mengajukan usul kepada Jepang untuk membentuk Tentara Pembela Tanah Air (PETA). Akhirnya pada tanggal 3 Oktober 1943 dibentuklah secara resmi Pasukan Sukarela Pembela Tanah Air (PETA) melalui Osamu Seirei No. 44 Tahun 1943.Setelah kemerdekaan Gatot Mangkoepradja kembali bergabung dengan PNI pada tahun 1948. Setahun kemudian ia menjabat Sekretaris Jenderal PNI menggantikan Sabillal Rasjad yang ditarik ke BP KNIP. Ia meninggalkan PNI pada tahun 1955 karena kecewa bahwa anggota PNI tidak boleh turut serta dalam organisasi kedaerahan.Setelah peristiwa Gestapu tahun 1965, Gatot Mangkoepradja menyatakan dirinya masuk ke Partai IPKI karena partai ini berjuang untuk menyelamatkan Pancasila dari ancaman komunisme.Gatot Mangkoepradja meninggal dunia pada tanggal 4 Oktober 1968 dan dimakamkan di pemakaman umum Sirnaraga, Bandung.",
      "img": "https://image.ibb.co/djgHGK/gatot_mangkupraja.jpg"
    },
    {
      "nama": "Gatot Soebroto ",
      "nama2": "Raden Hadji Oemar Said Tjokroaminoto",
      "kategori": "Pahlawan Kemerdekaan Nasional ",
      "asal": "Jawa Tengah",
      "lahir": "Kamis, 10 Oktober 1907   di Banyumas, Jawa Tengah",
      "usia": "54 tahun",
      "gugur": "Senin, 11 Juni 1962   di Jakarta, Indonesia",
      "lokasimakam": "Desa Sidomulyo, Kecamatan Ungaran, Kabupaten Semarang, Jawa Tengah",
      "history": "Tokoh perjuangan militer Indonesia dalam merebut kemerdekaan. Panglima Tentara & Teritorium (T&T) IV Diponegoro. Wakil Staff Kepala Angkatan Darat. Setamat pendidikan dasar di HIS, Gatot Subroto tidak melanjutkan ke jenjang yang lebih tinggi, namun memilih menjadi pegawai. Namun tak lama kemudian pada tahun 1923 memasuki sekolah militer KNIL di Magelang. Setelah Jepang menduduki Indonesia, serta merta Gatot Subroto pun mengikuti pendidikan PETA di Bogor. Setelah kemerdekaan, Gatot Subroto memilih masuk Tentara Keamanan Rakyat TKR dan kariernya berlanjut hingga dipercaya menjadi Panglima Divisi II, Panglima Corps Polisi Militer, dan Gubernur Militer Daerah Surakarta dan sekitarnya.Setelah ikut berjuang dalam Perang Kemerdekaan, pada tahun 1949 Gatot Subroto diangkat menjadi Panglima Tentara & Teritorium (T&T) IV I Diponegoro.Pada tahun 1953, beliau sempat mengundurkan diri dari dinas militer, namun tiga tahun kemudian diaktifkan kembali sekaligus diangkat menjadi Wakil Kepala Staf Angkatan Darat (Wakasad).Beliau adalah penggagas akan perlunya sebuah akademi militer gabungan (AD,AU,AL) untuk membina para perwira muda. Gagasan tersebut diwujudkan dengan pembentukan Akademi Angkatan Bersenjata Republik Indonesia (AKABRI) pada tahun 1965.",
      "img": "https://image.ibb.co/kX38Oz/gatot_soebroto.jpg"
    },
    {
      "nama": "H.O.S. Tjokroaminoto ",
      "nama2": "Raden Hadji Oemar Said Tjokroaminoto)",
      "kategori": "Pahlawan Kemerdekaan Nasional",
      "asal": "Jawa Timur",
      "lahir": "Rabu, 16 Agustus 1882 di Desa Bukur Madiun, Jawa Timur",
      "usia": "52 tahun",
      "gugur": "Senin, 17 Desember 1934   di Yogyakarta, Indonesia",
      "lokasimakam": "Taman Makam Pahlawan (TMP) Pekuncen, Wirobrajan, Yogyakarta.",
      "history": "Bernama lengkap Raden Hadji Oemar Said Tjokroaminoto, pahlawan nasional sekarang lebih dikenal dengan nama H.O.S Cokroaminoto, lahir di Desa Bukur, Kecamatan Jiwan, Kabupaten Madiun, Jawa Timur, 16 Agustus 1882. Beliau merupakan seorang pemimpin salah satu organisasi yaitu Sarekat Islam (SI). Beliau kemudian meninggal pada umur 52 tahun yaitu tanggal 17 Desember 1934 di Yogyakarta.Tjokroaminoto adalah anak kedua dari 12 bersaudara dari ayah bernama R.M. Tjokroamiseno, salah seorang pejabat pemerintahan pada saat itu. Kakeknya, R.M. Adipati Tjokronegoro, pernah juga menjabat sebagai Bupati Ponorogo.Tjokroaminoto adalah salah satu pelopor pergerakan di indonesia dan sebagai guru para pemimpin-pemimpin besar di indonesia, berangkat dari pemikiran ialah yang melahirkan berbagai macam ideologi bangsa indonesia pada saat itu, rumah ia sempat dijadikan rumah kost para pemimpin besar untuk menimbah ilmu padanya, yaitu Semaoen, Alimin, Muso, Soekarno, Kartosuwiryo, bahkan Tan Malaka pernah berguru padanya, ia adalah orang yang pertama kali menolak untuk tunduk pada Belanda, setelah ia meninggal lahirlah warna-warni pergerakan indonesia yang dibangun oleh murid-muridnya, yakni kaumsosialis/komunis yang dianut oleh Semaoen, Muso, Alimin, Soekarno yang nasionalis, dan Kartosuwiryo yang islam merangkap sebagai sekretaris pribadi. Namun, ketiga muridnya itu saling berselisih menurut paham masing-masing. Pengaruh kekuatan politik pada saat itu memungkinkan para pemimpin yang sekawanan itu saling berhadap-hadapan hingga terjadi Pemberontakan Madiun 1948 yang dilakukan Partai komunis Indonesia karena memproklamasikan 'Republik Soviet Indonesia' yang dipimpin Muso dan dengan terpaksa presiden Soekarno mengirimkan pasukan elite TNI yakni Divisi Siliwangi yang mengakibatkan 'abang' sapaan akrab Soekarno kepada Muso pemimpin Partai komunis pada saat itu tertembak mati 31 Oktober, dan dilanjutkan pemberontakan oleh Negara Islam Indonesia(NII) yang dipimpin oleh Kartosuwiryo dan akhirnya hukuman mati yang dijatuhkan oleh Soekarno kepada kawannya Kartosuwiryo pada 12 September 1962.Pada bulan Mei 1912, HOS Tjokroaminoto mendirikan organisasi Sarekat Islam yang sebelumnya dikenal Serikat Dagang Islam dan terpilih menjadi ketua.Ia dimakamkan di TMP Pekuncen, Yogyakarta, setelah jatuh sakit sehabis mengikuti Kongres SI di Banjarmasin.Salah satu trilogi darinya yang termasyhur adalah Setinggi-tinggi ilmu, semurni-murni tauhid, sepintar-pintar siasat. Ini menggambarkan suasana perjuangan Indonesia pada masanya yang memerlukan tiga kemampuan pada seorang pejuang kemerdekaan.Dari berbagai muridnya yang paling ia sukai adalah Soekarno hingga ia menikahkan Soekarno dengan anaknya yakni Siti Oetari, istri pertama Soekarno.Pesannya kepada Para murid-muridnya ialah 'jika kalian ingin menjadi Pemimpin besar, menulislah seperti wartawan dan bicaralah seperti orator' perkataan ini membius murid-muridnya hingga membuat Soekarno setiap malam berteriak belajar pidato hingga membuat kawannya yaitu Muso, Alimin, Kartosuwiryo, Darsono, dan yang lainnya terbangung dan tertawa menyaksikannya.",
      "img": "https://image.ibb.co/jXFBbK/h_o_s_tjokroaminoto.jpg"
    },
    {
      "nama": "Halim Perdanakusuma ",
      "nama2": "Marsda. Abdul Halim Perdana Kusuma)",
      "kategori": "Pahlawan Nasional ",
      "asal": "Jawa Timur",
      "lahir": "Sabtu, 18 November 1922 di Sampang, Madura, Jawa Timur",
      "usia": "25 tahun",
      "gugur": "Minggu, 14 Desember 1947 di Lumut, Perak, Malaysia",
      "lokasimakam": "Taman Makam Pahlawan (TMP) Kalibata, Jakarta.",
      "history": "Abdul Halim Perdanakusuma, dilahirkan tanggal 18 November 1922 di Sampang Madura, Jawa Timur, meninggal di Malaysia, 14 Desember 1947 pada umur 25 tahun) adalah seorang pahlawan nasional Indonesia. Ayahnya, Haji Abdul Gani Wongsotaruno adalah Patih Sumenep, Madura, Jawa Timur. Beliau adalah putra ketiga dari lima bersaudara. Sesuai keahlian dan pengalaman yang dimilikinya selama perang dunia ke 2 di Asia maupun Eropa, Halim diserahi tugas sebagai Perwira Operasi. Ia bertanggungjawab atas pelaksanaan tugas operasi udara. Tugas itu meliputi banyak bidang, antara lain menembus blokade udara Belanda, mengatur siasat serangan udara atas daerah lawan, operasi penerjunan pasukan di luar Jawa dan penyelenggaraan operasi penerbangan dalam rangka pembinaan wilayah. Dalam kaitan usaha mencari bantuan ke luar negeri, Halim bersama Opsir Udara Iswahjudi pergi ke Bangkok pada bulan Desember 1947 menggunakan pesawat Avro Anson VH-BBY (RI-003). Sesudah menyelesaikan tugas di Bangkok, RI-003 kembali berangkat menuju Singapura. Dalam perjalanan kembali inilah tiba-tiba di daerah Perak-Malaysia pesawat tersebut terjebak dalam cuaca buruk. Pesawat jatuh di Pantai Tanjung Hantu Perak-Malaysia sekitar pukul 16.30 tanggal 14 Desember 1947. Jenazah Komodor Muda Udara Halim Perdanakusuma ditemukan, sedangkan jenazah Iswahjudi tidak ditemukan. Pada tanggal 19 Desember 1947 dilakukan upacara pemakaman menurut agama Islam di Teluk Murok terletak sekitar 5 km dari Lumut, Malaysia. Pada hari Pahlawan 10 November 1975, kerangka jenazah almarhum dipindahkan dan dimakamkan kembali dengan upacara kemiliteran di tempat yang lebih layak, yakni di Taman Makam Pahlawan Kalibata Jakarta. Sebagai penghargaan atas jasa dan pengabdiannya terhadap Angkatan Udara maka pimpinan TNI Angkatan Udara menaikkan pangkatnya menjadi Laksamana Muda Udara (sekarang Marsekal Muda Udara) Anumerta. Untuk mengabadikan namanya, pada tanggal 17 Agustus 1952 nama Pangkalan Udara Cililitan diubah menjadi Pangkalan Udara Halim Perdanakusuma. Pemerintah juga mengabadikan namanya pada kapal perang KRI Abdul Halim Perdanakusuma. Selain itu juga memperoleh Bintang Mahaputra tingkat IV (15 Februari 1961). Penghargaan tertinggi diberikan pemerintah berupa gelar Pahlawan Nasional ((Keppres No. 63/TK/1975, tanggal 9 Agustus 1975).",
      "img": "https://image.ibb.co/gdSPwK/halim_perdanakusuma.jpg"
    },
    {
      "nama": "Hamengkubuwana I ",
      "nama2": "Sri Sultan Hamengkubuwana I ",
      "kategori": "Pahlawan Nasional",
      "asal": " DIY (Yogyakarta)",
      "lahir": "Jumat, 6 Agustus 1717 di Kartasura, Indonesia",
      "usia": "74 tahun",
      "gugur": "Sabtu, 24 Maret 1792   di Yogyakarta, Indonesia",
      "lokasimakam": "Astana Imogiri, Bantul, DI Yogyakarta.",
      "history": "Hamengkubuwana I meninggal dunia tanggal 24 Maret 1792. Kedudukannya sebagai raja Yogyakarta digantikan putranya yang bergelar Hamengkubuwana II.Hamengkubuwana I adalah peletak dasar-dasar Kesultanan Yogyakarta. Ia dianggap sebagai raja terbesar dari keluarga Mataram sejak Sultan Agung. Yogyakarta memang negeri baru namun kebesarannya waktu itu telah berhasil mengungguli Surakarta. Angkatan perangnya bahkan lebih besar daripada jumlah tentara VOC di Jawa.Hamengkubuwana I tidak hanya seorang raja bijaksana yang ahli dalam strategi berperang, namun juga seorang pecinta keindahan. Karya arsitektur pada jamannya yang monumental adalah Taman Sari Keraton Yogyakarta.Taman Sari di rancang oleh orang berkebangsaan Portugis yang terdampar di laut selatan dan menjadi ahli bangunan Kasultanan dengan nama Jawa Demang Tegis.Meskipun permusuhannya dengan Belanda berakhir damai namun bukan berarti ia berhenti membenci bangsa asing tersebut. Hamengkubuwana I pernah mencoba memperlambat keinginan Belanda untuk mendirikan sebuah benteng di lingkungan keraton Yogyakarta. Ia juga berusaha keras menghalangi pihak VOC untuk ikut campur dalam urusan pemerintahannya. Pihak Belanda sendiri mengakui bahwa perang melawan pemberontakan Pangeran Mangkubumi adalah perang terberat yang pernah dihadapi VOC di Jawa (sejak 1619 - 1799).Rasa benci Hamengkubuwana I terhadap penjajah asing ini kemudian diwariskan kepada Hamengkubuwana II, raja selanjutnya. Maka, tidaklah berlebihan jika pemerintah Republik Indonesia menetapkan Sultan Hamengkubuwana I sebagai pahlawan nasional pada tanggal 10 November 2006 beberapa bulan sesudah gempa melanda wilayah Yogyakarta.",
      "img": "https://image.ibb.co/euHPwK/hamengkubuwana_i.jpg"
    },
    {
      "nama": "Hamengkubuwana IX",
      "nama2": "Sri Sultan Hamengkuwubono IX",
      "kategori": "Pahlawan Nasional",
      "asal": "DIY (Yogyakarta)",
      "lahir": "Jumat, 12 April 1912   di Yogyakarta, Indonesia",
      "usia": "76 tahun",
      "gugur": "Minggu, 2 Oktober 1988   di Washington, D.C., Amerika Serikat",
      "lokasimakam": "Astana Imogiri, Bantul, DI Yogyakarta",
      "history": "Lahir di Yogyakarta dengan nama Bendoro Raden Mas Dorodjatun di Ngasem, Hamengkubuwana IX adalah putra dari Sri Sultan Hamengkubuwana VIII dan Raden Ajeng Kustilah. Di umur 4 tahun Hamengkubuwana IX tinggal pisah dari keluarganya. Dia memperoleh pendidikan di HIS di Yogyakarta, MULO di Semarang, dan AMS di Bandung. Pada tahun 1930-an beliau berkuliah di Rijkuniversiteit (sekarang Universiteit Leiden), Belanda ('Sultan Henkie').Hamengkubuwana IX dinobatkan sebagai Sultan Yogyakarta pada tanggal 18 Maret 1940 dengan gelar 'Sampeyan Dalem Ingkang Sinuhun Kanjeng Sultan Hamengkubuwana Senapati-ing-Ngalaga Abdurrahman Sayidin Panatagama Khalifatullah ingkang Jumeneng Kaping Sanga'. Ia merupakan sultan yang menentang penjajahan Belanda dan mendorong kemerdekaan Indonesia. Selain itu, dia juga mendorong agar pemerintah RI memberi status khusus bagi Yogyakarta dengan predikat Istimewa.[1] Sebelum dinobatkan, Sultan yang berusia 28 tahun bernegosiasi secara alot selama 4 bulan dengan diplomat senior Belanda Dr. Lucien Adam mengenai otonomi Yogyakarta. Di masa Jepang, Sultan melarang pengiriman romusha dengan mengadakan proyek lokal saluran irigasi Selokan Mataram. Sultan bersama Paku Alam IX adalah penguasa lokal pertama yang menggabungkan diri ke Republik Indonesia. Sultan pulalah yang mengundang Presiden untuk memimpin dari Yogyakarta setelah Jakarta dikuasai Belanda dalam Agresi Militer Belanda I.",
      "img": "https://image.ibb.co/g70Niz/hamengkubuwana_ix.jpg"
    },
    {
      "nama": "Hamka",
      "nama2": "Prof. Dr.H.Abdul Malik Karim Amrullah",
      "kategori": "Pahlawan Nasional",
      "asal": "Sumatera Barat",
      "lahir": "Senin, 17 Februari 1908 di Sungai Batang, Tanjung Raya, Agam, Sumatera Barat",
      "usia": "73 tahun",
      "gugur": "Jumat, 24 Juli 1981 di Jakarta, Indonesia",
      "lokasimakam": "Taman Pemakaman Umum (TPU) Tanah Kusir, Jakarta Selatan.",
      "history": "Ketua Majelis Ulama Indonesia yang pertama. Pimpinan Pusat Muhammadiyah. Seorang Sastrawan, Aktifis Politik, Wartawan, Penulis, Ulama, Editor, Ahli Filsafat.",
      "img": "https://image.ibb.co/fyLzVe/hamka.jpg"
    },
    {
      "nama": "Harun Thohir ",
      "nama2": "Kopral KKO Harun bin Said, Thohir bin Mandar, Tahir",
      "kategori": "Pahlawan Nasional",
      "asal": "Jawa Timur",
      "lahir": "Jumat, 4 April 1947 di Pulau Bawean, Kabupaten Gresik, Jawa Timur",
      "usia": "21 tahun",
      "gugur": "Kamis, 17 Oktober 1968 di Singapura",
      "lokasimakam": "Taman Makam Pahlawan (TMP) Kalibata, Jakarta",
      "history": "Kopral Anumerta Harun Said bin Muhammad Ali (lahir di Pulau Bawean, Kabupaten Gresik, Jawa Timur, 4 April 1947 – meninggal di Singapura, 17 Oktober 1968 pada umur 21 tahun) adalah salah satu dari dua anggota KKO (Korps Komando Operasi; kini disebut Marinir) Indonesia yang ditangkap di Singapura pada saat terjadinya Konfrontasi dengan Malaysia.Bersama dengan seorang anggota KKO lainnya bernama Usman, ia dihukum gantung oleh pemerintah Singapura pada Oktober 1968 dengan tuduhan meletakkan bom di wilayah pusat kota Singapura yang padat pada 10 Maret 1965 (lihat Pengeboman MacDonald House).Atas jasa-jasanya kepada negara, Kopral KKO TNI Anumerta Harun bin Said alias Thohir bin Mandar Anggota Korps Komando AL-RI Harun bin Said dianugerahi gelar Pahlawan Nasional berdasarkan SK Presiden RI No.050/TK/Tahun 1968, tgl 17 Okt 1968.Ia dimakamkan di TMP Kalibata, Jakarta.",
      "img": "https://image.ibb.co/dSaNiz/harun_thohir.jpg"
    },
    {
      "nama": "Hasan Basry",
      "nama2": "Brigjen H. Hasan Basry",
      "kategori": "Pahlawan Nasional",
      "asal": "Kalimantan Selatan",
      "lahir": "Minggu, 17 Juni 1923 di Kandangan, Hulu Sungai Selatan",
      "usia": "61 tahun",
      "gugur": "Minggu, 15 Juli 1984 di Jakarta, Indonesia",
      "lokasimakam": "Simpang Empat, Liang Anggang, Kota Banjarbaru, Kalimantan Selatan",
      "history": "",
      "img": "https://image.ibb.co/cJvzVe/hasan_basry.jpg"
    },
    {
      "nama": "Hasanuddin",
      "nama2": "Sultan Hasanuddin",
      "kategori": "Pahlawan Nasional",
      "asal": "Sulawesi Selatan",
      "lahir": "Minggu, 12 Januari 1631 di Makassar, Sulawesi Selatan",
      "usia": "39 tahun",
      "gugur": "Kamis, 12 Juni 1670   di Makassar, Sulawesi Selatan",
      "lokasimakam": "Katangka, Kabupaten Gowa, Sulawesi Selatan",
      "history": "Sultan Hasanuddin lahir di Makasar, merupakan putera kedua dari Sultan Malikussaid, Raja Gowa ke-15. Sultan Hasanuddin memerintah Kerajaan Gowa, ketika Belanda yang diwakili Kompeni sedang berusaha menguasai perdagangan rempah-rempah. Gowa merupakan kerajaan besar di wilayah timur Indonesia yang menguasai jalur perdagangan. Pada tahun 1666, di bawah pimpinan Laksamana Cornelis Speelman, Kompeni berusaha menundukkan kerajaan-kerajaan kecil, tetapi belum berhasil menundukkan Gowa. Di lain pihak, setelah Sultan Hasanuddin naik takhta, ia berusaha menggabungkan kekuatan kerajaan-kerajaan kecil di Indonesia bagian timur untuk melawan Kompeni.Pertempuran terus berlangsung, Kompeni menambah kekuatan pasukannya hingga pada akhirnya Gowa terdesak dan semakin lemah sehingga pada tanggal 18 November 1667 bersedia mengadakan Perdamaian Bungaya di Bungaya. Gowa merasa dirugikan, karena itu Sultan Hasanuddin mengadakan perlawanan lagi. Akhirnya pihak Kompeni minta bantuan tentara ke. Batavia. Pertempuran kembali pecah di berbagai tempat. Sultan Hasanuddin memberikan perlawanan sengit. Bantuan tentara dari luar menambah kekuatan pasukan Kompeni, hingga akhirnya Kompeni berhasil menerobos benteng terkuat Gowa yaitu Benteng Sombaopu pada tanggal 12 Juni 1669. Sultan Hasanuddin kemudian mengundurkan diri dari takhta kerajaan dan wafat pada tanggal 12 Juni 1670.",
      "img": "https://image.ibb.co/cvXPwK/hasanuddin.jpg"
    },
    {
      "nama": "Hasyim Ashari",
      "nama2": "K.H. Mohammad Hasjim Asjarie/Asyarie",
      "kategori": "Pahlawan Kemerdekaan Nasional ",
      "asal": "Jawa Timur",
      "lahir": "Sabtu, 10 April 1875   di Desa Gedang, Kecamatan Diwek, Kabupaten Jombang, Jawa Timur",
      "usia": "72 tahun",
      "gugur": "Minggu, 7 September 1947   di Jombang, Jawa Timur",
      "lokasimakam": "Tebu Ireng, Jombang, Jawa Timur",
      "history": "Kyai Haji Mohammad Hasjim Asy'arie - bagian belakangnya juga sering dieja Asy'ari atau Ashari (lahir di Desa Gedang, Kecamatan Diwek, Kabupaten Jombang, Jawa Timur, 10 April 1875 – meninggal di Jombang, Jawa Timur, 25 Juli 1947 pada umur 72 tahun; 4 Jumadil Awwal 1292 H- 6 Ramadhan 1366 H; dimakamkan di Tebu Ireng, Jombang) adalah salah seorang Pahlawan Nasional Indonesia yang merupakan pendiri Nahdlatul Ulama, organisasi massa Islam yang terbesar di Indonesia. Di kalangan Nahdliyin dan ulama pesantren ia dijuluki dengan sebutan 'Hadratus Syeikh' yang berarti maha guru. Pada tahun 1899, sepulangnya dari Mekah, K.H. Hasjim Asy'ari mendirikan Pesantren Tebu Ireng, yang kelak menjadi pesantren terbesar dan terpenting di Jawa pada abad 20.Pada tahun 1926, K.H Hasjim Asy'ari menjadi salah satu pemrakarsa berdirinya Nadhlatul Ulama (NU), yang berarti kebangkitan ulama.",
      "img": "https://image.ibb.co/jtzhiz/hasyim_ashari.jpg"
    },
    {
      "nama": "Hazairin",
      "nama2": "Prof. Dr.Hazairin, SH",
      "kategori": "Pahlawan Nasional",
      "asal": "Bengkulu",
      "lahir": " Rabu, 28 November 1906 di Bukittinggi, Sumatera Barat",
      "usia": "69 tahun",
      "gugur": "Kamis , 11 Desember 1975   di Jakarta, Indonesia",
      "lokasimakam": "Taman Makam Pahlawan (TMP) Kalibata, Jakarta",
      "history": "Hazairin lahir di tengah-tengah keluarga taat beragama, dari pasangan Zakaria Bahri (Bengkulu) dan Aminah (Minangkabau). Ayahnya adalah seorang guru dan kakeknya, Ahmad Bakar, adalah seorang ulama. Dari kedua orang tersebut, Hazairin mendapat dasar pelajaran ilmu agama dan bahasa Arab. Pakar Hukum Adat, Aktifis Kemerdekaan, Pendidik. Menteri Dalam Negeri Republik Indonesia ke-11.",
      "img": "https://image.ibb.co/ek6TOz/hazairin.jpg"
    },
    {
      "nama": "Herman Johannes ",
      "nama2": "Prof. Dr.Ir.Herman Johannes",
      "kategori": "Pahlawan Nasional",
      "asal": "NTT (Nusa Tenggara Timur)",
      "lahir": "Selasa, 28 Mei 1912   di Rote, NTT, Indonesia",
      "usia": "80 tahun",
      "gugur": "Sabtu, 17 Oktober 1992   di Yogyakarta, Indonesia",
      "lokasimakam": "Pemakaman Keluarga UGM di Sawitsari, Caturtunggal, Depok, Yogyakarta",
      "history": "Prof. Dr. Ir. Herman Johannes, sering juga ditulis sebagai Herman Yohannes atau Herman Yohanes (lahir di Rote, NTT, 28 Mei 1912 – meninggal di Yogyakarta, 17 Oktober 1992 pada umur 80 tahun) adalah cendekiawan, politikus, ilmuwan Indonesia, guru besar Universitas Gadjah Mada (UGM), dan Pahlawan Nasional Indonesia. Ia pernah menjabat Rektor UGM (1961-1966), Koordinator Perguruan Tinggi (Koperti) tahun 1966-1979, anggota Dewan Pertimbangan Agung (DPA) RI (1968-1978), dan Menteri Pekerjaan Umum (1950-1951). Pengalamannya bergerilya membuat Herman Johannes juga ikut serta dalam Serangan Umum 1 Maret 1949 yang menyerbu kota Yogyakarta di pagi buta dan bisa menduduki ibukota Republik selama enam jam. Herman Johannes juga menjadi saksi sumbangan Sri Sultan Hamengkubuwono IX kepada perjuangan kemerdekaan Indonesia. Bersama Letnan Soesilo Soedarman dan Letnan Djajadi, Mayor Johannes pernah bertugas ke Wedi, Klaten, untuk melakukan koordinasi perjuangan. Mereka bertiga berangkat memakai seragam baru hadiah dari Sultan Yogya. Sultan pun memberi gaji seratus rupiah Oeang Republik Indonesia (ORI) setiap bulan kepada para taruna Akademi Militer.Dalam sebuah makalahnya Herman Johannes pernah mengemukakan bahwa Sri Sultan dan Paku Alam bersama Komisi PBB menjemput para gerilyawan masuk kota Yogyakarta pada 29 Juni 1949. Pasukan Akademi Militer masuk kota dari arah Pengok dan dijemput langsung Paku Alam VIII, dan Herman Johannes kemudian harus berpisah dengan teman-teman seperjuangannya utuk kembali ke dunia pendidikan. Jasanya di dalam perang kemerdekaan membuat Herman Johannes dianugerahi Bintang Gerilya pada tahun 1958 oleh Pemerintah RI. Almarhum Herman Johannes mendapat anugerah gelar Pahlawan Nasional dari Presiden Yudhoyono dalam rangka peringatan Hari Pahlawan 2009.",
      "img": "https://image.ibb.co/chQNiz/herman_johannes.jpg"
    },
    {
      "nama": "I Gusti Ketut Jlantik ",
      "nama2": "Patih Jelantik",
      "kategori": "Pahlawan Nasional",
      "asal": "Bali",
      "lahir": "1800, tukadmungga, buleleng, Indonesia",
      "usia": "tahun",
      "gugur": "1849 di Perbukitan Bale Pundak, Gunung Batur, Kintamani, Bali",
      "lokasimakam": "Buleleng, Bali(Monumen)",
      "history": "I Gusti Ketut Jelantik  adalah pahlawan nasional Indonesia yang berasal dari Karangasem, Bali. Ia merupakan patih Kerajaan Buleleng. Ia berperan dalam Perang Jagaraga yang terjadi di Bali pada tahun 1849. Perlawanan ini bermula karena pemerintah kolonial Hindia Belanda ingin menghapuskan hak tawan karang yang berlaku di Bali, yaitu hak bagi raja-raja yang berkuasa di Bali untuk mengambil kapal yang kandas di perairannya beserta seluruh isinya. Ucapannya yang terkenal ketika itu ialah 'Apapun tidak akan terjadi. Selama aku hidup aku tidak akan mangakui kekuasaan Belanda di negeri ini'. Perang ini berakhir sebagai suatu puputan, seluruh anggota kerajaan dan rakyatnya bertarung mempertahankan daerahnya sampai titik darah penghabisan. Namun akhirnya ia harus mundur ke Gunung Batur, Kintamani. Pada saat inilah beliau gugur.",
      "img": "https://image.ibb.co/gbqSGK/i_gusti_ketut_jlantik.jpg"
    },
    {
      "nama": "I Gusti Ketut Puja ",
      "nama2": "Mr. I Goesti Ketoet Poedja",
      "kategori": "Pahlawan Nasional",
      "asal": "Bali",
      "lahir": "Selasa, 19 Mei 1908 di Singaraja, Bali, Indonesia",
      "usia": "68 tahun",
      "gugur": "Rabu, 4 Mei 1977 di RS Cipto Mangunkusumo, Jakarta",
      "lokasimakam": "Bali (Monumen)",
      "history": "I Gusti Ketut Pudja (lahir 19 Mei 1908 – meninggal 4 Mei 1977 pada umur 68 tahun) adalah pahlawan nasional Indonesia. Ia ikut serta dalam perumusan negara Indonesia melalui Panitia Persiapan Kemerdekaan Indonesia mewakili Sunda Kecil (saat ini Bali dan Nusa Tenggara).I Gusti Ketut Pudja juga hadir dalam perumusan naskah teks proklamasi di rumah Laksamana Maeda. Ia kemudian diangkat Soekarno sebagai Gubernur Sunda Kecil.Pada tahun 2011, I Gusti Ketut Pudja ditetapkan oleh Pemerintah Republik Indonesia sebagai pahlawan nasional bersama 6 orang lainnya.",
      "img": "https://image.ibb.co/h4oEwK/i_gusti_ketut_puja.jpg"
    },
    {
      "nama": "I Gusti Ngurah Made Agung",
      "nama2": "Raja Badung VII / Raja Denpasar VI",
      "kategori": "Pahlawan Nasional",
      "asal": "Bali",
      "lahir": "Rabu, 5 April 1876   di Denpasar, Bali",
      "usia": "30 tahun",
      "gugur": " Kamis, 20 September 1906 di Perang Puputan Badung, Bali",
      "lokasimakam": "Denpasar, Bali",
      "history": "I Gusti Ngurah Made Agung adalah Pahlawan Nasional Indonesia (Keppres No. 116/TK/2015, tanggal 4 November 2015). I Gusti Ngurah Made Agung merupakan Raja Badung VII. Ia konsisten menentang penjajahan Belanda melalui berbagai karya sastra. Ia juga menolak melanjutkan perjanjian Kuta yang dibuat Raja Bali sebelumnya dengan pemerintah kolonial Hindia Belanda. Ia menentang penjajahan Belanda melalui karya-karya sastranya yang membangkitkan semangat perjuangan. Di antara karya sastranya adalah Geguritan Dharma Sasana, Geguritan Niti Raja Sasana, Geguritan Nengah Jimbaran, Kidung Loda, Kakawin Atlas, dan Geguritan Hredaya Sastra.Pada September 1906, Pemerintah Hindia Belanda membentuk pasukan besar di bawah pimpinan Jenderal Mayor M. B. Rost van Tonningen karena blokade ekonomi tidak berhasil menghancurkan Kerajaan Badung. Pembentukan pasukan ini tidak membuat Raja Badung VII menyerah. Sebaliknya, ia memilih untuk berperang melawan pasukan Belanda tersebut hingga gugur di medan pertempuran pada 20 September 1906. Pertempuran ini lebih dikenal dengan nama Puputan Badung.",
      "img": "https://image.ibb.co/i0J9gK/i_gusti_ngurah_made_agung.jpg"
    },
    {
      "nama": "I Gusti Ngurah Rai ",
      "nama2": "Brigjen I Gusti Ngurah Rai",
      "kategori": "Pahlawan Nasional",
      "asal": "Bali",
      "lahir": "Selasa Kliwon, 30 Januari 1917 di Desa Carangsari, Petang, Kabupaten Badung, Bali",
      "usia": "29 tahun",
      "gugur": "Rabu, 20 November 1946   di Marga, Tabanan, Bali",
      "lokasimakam": "Taman Makam Pahlawan (TMP) Candi Margarana, Kabupaten Tabanan, Bali.",
      "history": "Kolonel TNI Anumerta I Gusti Ngurah Rai (lahir di Desa Carangsari, Petang, Kabupaten Badung, Bali, Hindia Belanda, 30 Januari 1917 – meninggal di Marga, Tabanan, Bali, Indonesia, 20 November 1946 pada umur 29 tahun) adalah seorang pahlawan Indonesia dari Kabupaten Badung, Bali.Ngurah Rai memiliki pasukan yang bernama 'Ciung Wenara' melakukan pertempuran terakhir yang dikenal dengan nama Puputan Margarana. (Puputan, dalam bahasa bali, berarti 'habis-habisan', sedangkan Margarana berarti 'Pertempuran di Marga'; Marga adalah sebuah desa ibukota kecamatan di pelosok Kabupaten Tabanan, Bali)Bersama 1.372 anggotanya pejuang MBO (Markas Besar Oemoem) Dewan Perjoeangan Republik Indonesia Sunda Kecil (DPRI SK) dibuatkan nisan di Kompleks Monumen de Kleine Sunda Eilanden, Candi Marga, Tabanan. Detil perjuangan I Gusti Ngurah Rai dan resimen CW dapat disimak dari beberapa buku, seperti 'Bergerilya Bersama Ngurah Rai' (Denpasar: BP, 1994) kesaksian salah seorang staf MBO DPRI SK, I Gusti Bagus Meraku Tirtayasa peraih 'Anugrah Jurnalistik Harkitnas 1993', buku 'Orang-orang di Sekitar Pak Rai: Cerita Para Sahabat Pahlawan Nasional Brigjen TNI (anumerta) I Gusti Ngurah Rai' (Denpasar: Upada Sastra, 1995), atau buku 'Puputan Margarana Tanggal 20 November 1946' yang disusun oleh Wayan Djegug A Giri (Denpasar: YKP, 1990).Pemerintah Indonesia menganugerahkan Bintang Mahaputra dan kenaikan pangkat menjadi Brigjen TNI (anumerta). Namanya kemudian diabadikan dalam nama bandar udara di Bali, Bandara Ngurah Rai.",
      "img": "https://image.ibb.co/mgZ4Fe/i_gusti_ngurah_rai.jpg"
    },
    {
      "nama": "I.J. Kasimo H.",
      "nama2": "Mr. Ignatius Joseph Kasimo Hendrowahyono",
      "kategori": "Pahlawan Nasional",
      "asal": "Yogyakarta",
      "lahir": "Selasa, 10 April 1900 di Yogyakarta, Indonesia",
      "usia": "86 tahun",
      "gugur": "Jumat, 1 Agustus 1986 di Jakarta,Indonesia",
      "lokasimakam": "Taman Makam Pahlawan (TMP) Kalibata, Jakarta.",
      "history": "Kasimo Hendrowahyono dilahirkan di Yogyakarta. Ia adalah anak kedua dari sebelas bersaudara. Orangtuanya adalah Dalikem dan Ronosentika, seorang prajurit Keraton Yogyakarta, dan seorang tokoh yang memperjuangkan hak-hak anak jajahan.[1] Maka sejak kecil IJ Kasimo dididik sesuai dengan tradisi keraton. Dengan demikian, ia merasakan dan paham benar dengan cara hidup keraton yang semuanya berpusat pada Sultan.Ketika kakak tertuanya dipersiapkan mengganti ayahnya, maka Kasimo menggantikan posisi dan sekaligus bertanggung jawab sebagai anak laki-laki tertua. Ia harus bekerja keras membantu ibunya mengurus rumah tangga. Setelah lulus dari Bumi Putra Gading, Kasimo masuk sekolah di Muntilan yang didirikan oleh Romo van Lith. Kasimo saat itu tinggal di asrama. Kasimo kemudian tertarik untuk belajar agama Katolik. Maka pada hari raya Paskah pada bulan April 1913 pada usia 13 tahun, Kasimo dibaptis secara Katolik dan mendapat nama baptis Ignatius Joseph.Setelah dewasa, beliau menjadi guru pertanian di Tegal dan Surakarta.Pada masa kemerdekaan awal, PPKI yang dilarang oleh Jepang dihidupkan kembali atas gagasan Kasimo dan berubah nama menjadi Partai Katolik Republik Indonesia. Antara tahun 1947-1949 ia duduk sebagai Menteri Muda Kemakmuran dalam Kabinet Amir Sjarifuddin, Menteri Persediaan Makanan Rakyat dalam Kabinet Hatta I dan Hatta II. Dalam kabinet peralihan atau Kabinet Soesanto Tirtoprodjo ia juga menjabat sebagai menteri. Kasimo pun juga pernah ikut menjadi anggota Delegasi Perundingan Republik Indonesia.Pada masa Agresi Militer II (Politionele Actie) ia bersama menteri lainnya yang tidak dikurung Belanda bergerilya di Jawa Tengah dan Jawa Timur. Lalu ketika bisa kembali ke Yogyakarta ia memprakarsai kerja sama seluruh partai Katolik Indonesia untuk bersatu menjadi Partai Katolik.Pada masa Republik Indonesia Serikat (RIS), Kasimo duduk sebagai wakil Republik Indonesia dan kemudian setelah RIS dilebur sebagai anggota DPR. Dalam Kabinet Burhanuddin Harahap ia menjabat sebagai Menteri Perdagangan. Kasimo juga ikut berjuang merebut Irian Barat.Kasimo menyatakan pendiriannya untuk menolak gagasan Nasakom yang ditawarkan Bung Karno. Kasimo pun juga menolak Kabinet yang diprakarsai Soekarno dan terdiri dari empat partai pemenang pemilu 1955: PNI, Masyumi, NU dan PKI. Kala itu Masyumi dan Partai Katolik Indonesia yang satu-satunya menolak bekerja sama dengan PKI di kabinet.",
      "img": "https://image.ibb.co/h8q0oz/i_j_kasimo_h.jpg"
    },
    {
      "nama": "Ida Anak Agung Gde Agung",
      "nama2": "Mr. Dr. Ide Anak Agung Gde Agung",
      "kategori": "Pahlawan Nasional",
      "asal": "Yogyakarta",
      "lahir": "Minggu, 24 Juli 1921 di Gianyar, Bali, Indonesia",
      "usia": "77 tahun",
      "gugur": "Kamis , 22 April 1999 di Gianyar, Bali, Indonesia",
      "lokasimakam": "Puri Agung Gianyar, Bali (Monumen).",
      "history": "Dr. Ide Anak Agung Gde Agung (lahir di Gianyar, Bali, 24 Juli 1921 – meninggal 22 April 1999 pada umur 77 tahun) adalah ahli sejarah dan tokoh politik Indonesia. Di Bali ia juga berposisi sebagai raja Gianyar, menggantikan ayahnya Anak Agung Ngurah Agung. Anaknya, Anak Agung Gde Agung, adalah Menteri Masalah-masalah Kemasyarakatan pada Kabinet Persatuan Nasional.Sarjana hukum (Mr.) diraihnya di Jakarta dan gelar doktor diperolehnya di Universitas Utrecht, Belanda, di bidang sejarah. Ia pernah menjabat sebagai Menteri Dalam Negeri maupun Menteri Luar Negeri pada era pemerintahan Presiden Soekarno. Selain itu ia pernah menjabat pula sebagai Dubes RI di Belgia (1951), Portugal, Perancis (1953), dan Austria.Pada tanggal 9 November 2007, almarhum dianugerahi gelar pahlawan nasional oleh Presiden Susilo Bambang Yudhoyono[",
      "img": "https://image.ibb.co/cXbvMK/ida_anak_agung_gde_agung.jpg"
    },
    {
      "nama": "Idham Chalid ",
      "nama2": "Dr. (HC) K.H. Idham Chalid",
      "kategori": "Pahlawan Nasional",
      "asal": "Kalimantan Selatan",
      "lahir": "Sabtu, 27 Agustus 1921 di Satui, Kalimantan Selatan",
      "usia": "88 tahun",
      "gugur": "Minggu, 11 Juli 2010 di Jakarta, Indonesia",
      "lokasimakam": "Cisarua, Bogor, Jawa Barat.",
      "history": "Idham Chalid lahir pada tanggal 27 Agustus 1921 di Satui, bagian tenggara Kalimantan Selatan. Ia merupakan anak sulung dari lima bersaudara. Ayahnya H Muhammad Chalid, penghulu asal Amuntai yang sekitar 200 kilometer dari Kota Banjarmasin. Saat usia Idham enam tahun, keluarganya hijrah ke Amuntai dan tinggal di daerah Tangga Ulin, kampung halaman leluhur ayahnya.Sejak berkiprah dari remaja, karier Idham di PBNU terus menanjak. Ketika NU masih bergabung dengan Masyumi (1950), ia menjadi ketua umum Partai Bulan Bintang Kalimantan Selatan. Sementara itu, ia juga menjadi anggota DPR RIS (1949-1950). Dua tahun kemudian, Idham terpilih menjadi ketua Lembaga Pendidikan Ma'arif NU (1952-1956). Kemudian, ia dipilih menjadi Ketua Umum Pengurus Besar Nahdlatul Ulama pada 1956. Saat dipercaya menjadi orang nomor satu NU ia masih berusia 34 tahun. Jabatan tersebut diembannya selama 28 tahun, yaitu hingga tahun 1984 dan menjadikannya orang terlama yang menjadi ketua umum PBNU.Boleh dikata, selama lebih 30 tahun sebagai orang nomor satu NU, Idham telah mengalami berbagai pasang surut. Di bidang eksekutif, ia beberapa kali jadi menteri, baik saat masa Orde Lama maupun Orde Baru. Pada masa Kabinet Ali Sastroamidjojo II dan Kabinet Djuanda, ia menjabat sebagai wakil Perdana Menteri. Ketika Bung Karno jatuh pada 1966, ia menjadi Menteri Utama bidang Kesejahteraan Rakyat dalam Kabinet Ampera I dan Menteri Negara Kesejahteraan dalam Kabinet Ampera II dan Kabinet Pembangunan I. Setelah itu ia diangkat menjadi ketua MPR/DPR pada periode 1972-1977. Dalam posisi pemerintahan, beliau pernah juga mengemban tugas sebagai Ketua DPA.",
      "img": "https://image.ibb.co/gGDmTz/idham_chalid.jpg"
    },
    {
      "nama": "Ilyas Ya'kub ",
      "nama2": "H. Ilyas Yakoub",
      "kategori": "Pahlawan Nasional",
      "asal": "Sumatera Barat",
      "lahir": "1903 di Asam Kumbang, Bayang, Pesisir Selatan, Sumatera Barat.",
      "usia": "55 tahun",
      "gugur": "Sabtu, 2 Agustus 1958   di Koto Barapak, Bayang, Pesisir Selatan, Sumatera Barat.",
      "lokasimakam": "Depan Masjid Raya Al-Munawarah Koto Barapak, Bayang, Pesisir Selatan, Sumatera Barat.",
      "history": "Ilyas Ya’kub adalah seorang ulama dan syaikhul Islam dari Minangkabau, lulusan Mesir, diangkat menjadi pahlawan kemerdekaan Republik Indonesia dengan SK-Mensos RI Nomor: Pol-61/PK/1968, tanggal 16 Desember 1968 dan dikukuhkan kembali dengan Keputusan Presiden RI (Kepres-RI) Nomor 074/TK/Tahun 1999 tanggal 13 Agustus 1999 serta dianugerahi tanda kehormatan Bintang Mahaputra Adipradana atas jasanya mempertahankan prinsip-perinsip kemerdekaan dari ancaman kolonialisme Belanda sekaligus menggerakkan kemerdekaan RI dengan resiko dibuang Belanda ke Digul (di Papua – Indonesia sekarang) serta beberapa tempat di Malaysia, Singapura, Brunei, Australia dll. Ia pernah memimpin mahasiswa Malaysia-Indonesia di Mesir, juga pendiri Partai Politik PERMI (Persatuan Muslim Indonesia, 1932) berbasis pada lembaga-lembaga pendidikan Islam di Indonesia. Beralasan pula dengan kemampuan dan jasanya sebagai ulama, tokoh pendidikan dan politikus Islam di awal kemerdekaan (1948) ia dipercaya pada negeri yang Islam dan semangat melayunya kuat sebagai Ketua DPR Provinsi Sumatera Tengah merangkap penasehat Gubernur.Sa’at di Mesir ini Haji Ilyas Ya’kub aktif dalam berbagai organisasi dan partai politik di antaranya Hizb al-Wathan (partai tanah air) didirikan oleh Mustafa Kamal semakin membangkitkan semangat anti penjajah. Ia pernah pula menjabat sebagai ketua Perkumpulan Mahasiswa Indonesia dan Malaysia (PMIM) di Mesir. Selain itu ia juga fungsionaris wakil ketua organisasi sosial politik Jam’iyat al-Khairiyah dan ketua organisasi politik Difa` al-Wathan (Ketahanan Tanah Air).Selain gerakan politik yang amat peduli dengan nasib bangsanya terjajah Belanda, Haji Ilyas Ya’kub di Mesir juga aktif menulis artikel dan dipublikasi pada berbagai Surat Kabar Harian di Kairo. Bersama temannya Muchtar Luthfi ia mendirikan dan memimpin Majalah Seruan Al-Azhar dan majalah Pilihan Timur. Majalah Seruan Al-Azhar adalah majalah bulanan mahasiswa sedangkan majalah Pilihan Timur adalah majalah politik. Kedua produk jusnalistik ini banyak dibaca mahasiswa Indonesia – Malaysia di Mesir ketika itu.Gerakan Haji Ilyas Ya’kub dalam jurnalistik dan politik anti penjajah di Mesir, tercium oleh Belanda ketika itu. Melalui perwakilannya di Mesir, Belanda mencoba melunakkan sikap radikal Ilyas Ya’kub, tetapi gagal. Sejak itu Belanda semakin mengaris merah Ilyas Ya’kub tidak saja sebagai radikalis bahkan dicap sebagai ekstrimis dan musuhnya di Indonesia.Ketika masih dalam ancaman Belanda, tahun 1929 Haji Ilyas Ya’kub kembali dari Mesir, memaksanya transit di Singapura kemudian nyasar berlabuh di Jambi. Di tanah air, ia menemui teman-temannya di Jawa yang bergerak dalam PNI dan PSI. Dari pengalaman dua partai temannya tadi (PNI dan Partai Serikat Islam) Ilyas Ya’kub berfikir, bahwa jiwa yang dimiliki kedua partai tersebut, yakni Islam dan kebangsaan adalah penting dikombinasikan, dikonversi dan dikonsolidasikan kemudian diwadahi dengan satu wadah yang refresentartif. Ternyata kemudian Haji Ilyas Ya’kub sekembali dari kunjungan ini tahun 1930 men-set up idenya: Islam dan kebangsaan dalam dua kegiatannya yakni bidang jurnalistik dan politik. Dalam bidang jurnalistik diwadahi dengan penerbitan pers yakni Tabloid Medan Rakyat. Dalam bidang politik ia bersama temannya Mukhtar Luthfi mendirikan wadah baru bernama PERMI (Persatuan Muslimin Indonesia) dengan asas Islam dan kebangsaan. Tujuannya menegakan Islam dan memperkuat wawasan kebangsaan untuk mewujudkan kemerdekaan Indonesia. Dengan dasar Islam dan kebangsaan ini, PERMI menjalankan sikap politik non kooperasi dan tak kenal kompromi dengan bangsa apapun yang kental punya prilaku imperialisme dan kolonialisme. Karena itu pula PERMI secara prinsipil mencap bahwa kapitalisme dan imperalisme merupakan penyebab penderitaan rakyat Indonesia.PERMI pada awal mula bernama PMI (Partai Muslimin Indonesia) didirikan Haji Ilyas Ya’kub tahun 1930. PMI ini berbasis pada lembaga pendidikan Islam Sumatera Thawalib dan Diniyah School. Ide dasarnya, pemberdayaan sekolah agama dengan berbagai inovasi ke arah sistem modern, dimulai perbaikan kurikulum, sistem penjenjangan program dan lama masa pendidikan, memberi perlindungan kepada pelajar serta mengorganisasikan sekolah agama sebagai basis perjuangan kemerdekaan dan sentra pencerdasan bangsa dengan pengatahuan Islam dan kebangsaan. Beralasan kemudian PMI berambisi menambah jumlah sekolah agama dengan mendirikan sekolah baru dengan sistem modern, mulai dari tingkat pendidikan dasar (ibtidaiyah) sampai pendidikan tinggi (Al-Kulliyat). Di antara pendidikan tinggi, di Alang Laweh, 12 Pebruari 1931 didirikan perguruan tinggi dalam bentuk college Islam untuk diploma A dan diploma B, bernama Al-Kulliyat Al-Islamiyah, diselenggarakan intelektual jebolan Timur Tengah di antaranya Janan Thaib (sebagai pimpinan), Syamsuddin Rasyid (onder director) dan Ilyas Ya’kub. Mahasiswa awal diterima lulusan Sumatra Thawalib, Diniyah School, Tarbiyah Islamiyah, AMS (Algemeene Middelbare School), Schakel School dan lulusan sekolah tingkat menengah lainnya.Tahun 1932 PMI mengadakan konsolidasi. Partai ini menyadari perjuangan Islam dan Kebangsaan perlu dikokohkan baik internal maupun eksternal. Tantangan Masyarakat Islam Indonesia sebagai bagian dari Muslim Asean yang ketika itu (sejak abad ke-16) disebut dengan istilah jawi, juga berpeluang berfikir pengembangan Islam tidak terlepas dari politik kekuasaan meskipun di wilayah konsentrasi Islam seperti di Indonesia, Malaysia dan Brunei Darussalam, apalgi di wilayah minoritas Islam. Mari belajar konflik minoritas muslin Moro (sejak abad ke-19) dengan pemerintahan Filipina berbeda sedikit dengan Burma (Myanmar) perkembangan muslin relative stabil sejak tahun 1930-han atau Singapura tahun 1932 sudah mendirikan Jam’iyat (Pesekutuan) Seruan Islam, apakah ini pengaruh Singapura pernah (tahun 1840) menjadi sentra pengembangan Tarekat Naqsyabandi yang dikembangkan Syeikh Ismail Simabur (Minangkabau) di kawasan Nusantara (Asean) menarik untuk diteliti dianalisis sintesis dengan fenomena terakhir (sejak tahun 1957) Muhammaddiyah telah pula berkembang di Singapura bersamaan dengan gerakan dakwah didukung ABIM (Angkatan Belia Islam Malaysia) di Malaysia. Masih kurun itu (1932) kasus di belahan Nusantara (Asean) juga, Thailand yang tidak pernah dijajah misalnya, agama Negara yang diakui kekakuasaan raja secara resmi adalah Budha Trevada, namun kepada masyarakat Islam yang dominant al-syafi’iyah diberikan kemerdekaan menghurus al-ahwal al-syakhshiyyah (hukum keluarga) termasuk munakahat (perkawinan) terutama dalam bentuk NTCR (Nikah Talak-Cerai dan Rujuk) dilakukan kadhi yang mendapat legalisasi pemerintahan raja (lihat juga Taufik Abdullah, d., 2003:305-339). Angin segar dan peluang masyarakat muslim di Nusanatara yakni Negara Asean yang satu ini tidak terlepas dari jaringan pembaharuan Ahmad Wahab (dari Minangkabau) di Bangkok tahun 192-han dan kawan-kawan seperti juga Syeikh Thaher Jalaluddin Al-Falaki (dari Minangkabau) di Malaysia (Yulizal Yunus, 1982).Konsolidasi PMI merupakan bagian kesadaran bagi penguatan lembaga ke-Islam menunjang visi Islam dan kebangsaan Indonesia. Konsolidasi dilakukan dalam bentuk Kongres Besar bertempat di dekat daerah kelahiran Ilyas Ya’kub yakni Koto Marapak (Bayang Pesisir Selatan) dihadiri oleh seluruh pengurus cabang se Sumatera seperti dari Tapanuli Selatan, Bengkulu, Palembang, Lampung dll. Di antara keputusan Kongres Besar, PMI diubah namanya menjadi PERMI yang dicap Belanda sebagai partai Islam radikal revolusioner. Kantornya di gedung perguruan Islamic College, Alang Lawas, Padang.Kalau tadi Ilyas Ya’kub tidak mengenal kompromi dengan komponen yang punya watak imperialisme dan kolonialisme, dalam PERMI ia bisa kompromi dengan Pertindonya Soekarno. Bentuk komprominya dalam bentuk koalisi memperkuat perjuangan kebangsaan, yakni dimana telah ada berdiri cabang Pertindo maka di sana tidak lagi perlu ada cabang PERMI dan sebaliknya. Karena dianggap membahayakan pemerintahan, maka berdasarkan vergarder verbod Belanda mengeluarkan kebijakan exorbita terechten yang menyatakan PERMI terlarang dan diikuti tindakan penangkapan terhadap tokoh-tokohnya. Haji Ilyas Ya’kub bersama dua temannya Mukhtar Luthfi dan Janan Thaib ditangkap dan dipenjarakan. Setelah 9 bulan di penjara Muaro Padang, ia diasingkan selama 10 tahun (1934-1944) ke Bouven Digul Irian Jaya bersama para pejuang pergerakan kemerdekaan Indonesia lainnya. Selama di Digul Haji Ilyas Ya’kub didampingi isteri Tinur sering sakit-sakitan. Masa awal penjajahan Jepang di Indonesia pun, para tahanan Digul semakin memprihatinkan, mereka dipindahkan lagi ke daerah pedalaman Irian Jaya di Kali Bina Wantaka kemudian diasingkan pula ke Australia[3]. Ia senantiasa dibujuk van der Plas dan van Mook (Belanda), namun semangat nasionalis dan Islamnya tidak pernah pudar memotivasi pembangkangannya dalam menentang penjajah dan menggerakkan terwujudnya kemerdekaan Indonesia.Oktober 1945 pemulangan para tahanan perang dari Australia ke Indonesia dengan kapal Experence Bey Oktober, Haji Ilyas Ya’kub tidak diizinkan turun di pelabuhan Tanjung Periuk, bahkan ia kembali ditahan dan diasingkan bersama isteri selama 9 bulan berpindah-pindah di Kupang, Serawak, Brunei Darussalam, kemudian ke Labuhan, Singapura (anaknya iqbal meninggal di sana). Satu tahun Indonesia merdeka (1946) barulah habis masa tahanan dan Haji Ilyas Ya’kub, ia kembali bergabung dengan kaum republik sekembali dari Cerebon. Ia ikut bergrillya pada clas II (1948) dan ikut membentuk PDRI (Pemerintahan Darurat Republik Indonesia) yang kemudian dipimpin oleh Mr. Safruddin Prawiranegara. Ia mendapat tugas menghimpun kekuatan politik (seluruh partai) di Sumatera untuk melawan agresor Belanda. Tahun itu ia menjabat ketua DPR Sumatera Tengah kemudian terpilih lagi sebagai anggota DPRD wakil Masyumi dan merangkap sebagai penasehat Gubernur Sumatera Tengah bidang politik dan agama.",
      "img": "https://image.ibb.co/cJYWve/ilyas_yakub.jpg"
    },
    {
      "nama": "Imam Bonjol",
      "nama2": "Tuangku Imam Bonjol",
      "kategori": "Pahlawan Nasional",
      "asal": "Sumatera Barat",
      "lahir": "1772 di Bonjol, Pasaman, Sumatera Barat",
      "usia": "92 tahun",
      "gugur": "6 November 1864   di Lotak, Pineleng, Minahasa, Sulawesi Utara",
      "lokasimakam": "Lotak, Pineleng, Minahasa, Sulawesi Utara",
      "history": "Pemimpin (Imam) kaum Padri di Bonjol yang memimpin perang melawan Belanda dalam Perang Padri tahun 1803-1838 di Sumatera Barat.",
      "img": "https://image.ibb.co/dNqpgK/imam_bonjol.jpg"
    },
    {
      "nama": "Iskandar Muda",
      "nama2": "Sultan Iskandar Muda",
      "kategori": "Pahlawan Nasional",
      "asal": "NAD (Aceh)",
      "lahir": "1593 di Banda Aceh, Indonesia",
      "usia": "43 tahun",
      "gugur": "27 September 1636 di Banda Aceh, Indonesia",
      "lokasimakam": " Kompleks Makam Pahlawan Nasional Sultan Iskandar Muda, Banda Aceh, NAD, Indonesia.",
      "history": "Sultan Aceh yang Terbesar dalam masa Kesultanan Aceh, yang berkuasa dari tahun 1607 sampai 1636, dengan reputasi internasional sebagai pusat perdagangan dan pembelajaran tentang Islam.",
      "img": "https://image.ibb.co/jHXPFe/iskandar_muda.jpg"
    },
    {
      "nama": "Ismail Marzuki",
      "nama2": "Ismail Marzuki",
      "kategori": "Pahlawan Nasional",
      "asal": "DKI Jakarta",
      "lahir": "11 Mei 1914 di Kwitang, Senen, Jakarta.",
      "usia": "44 tahun",
      "gugur": "25 Mei 1958 di Kampung Bali, Tanah Abang, Jakarta Pusat",
      "lokasimakam": "TPU Karet Bivak, Jakarta",
      "history": "Komposer besar Indonesia. Pencipta Lagu-Lagu Patriotik, antara lain Rayuan Pulau Kelapa, Gugur Bunga, Aryati, Juwita Malam, Sepasang Mata Bola, Melati di Tapal Batas, Indonesia Pusaka, dsb.",
      "img": "https://image.ibb.co/jK50oz/ismail_marzuki.jpg"
    },
    {
      "nama": "Iswahyudi",
      "nama2": "Marsma. R. Iswahjoedi",
      "kategori": "Pahlawan Nasional",
      "asal": "Jawa Timur",
      "lahir": " 15 Juli 1918 di Surabaya, Jawa Timur.",
      "usia": "29 tahun",
      "gugur": "14 Desember 1947   di Tanjung Hantu, Malaysia",
      "lokasimakam": "Taman Makam Pahlawan (TMP) Kalibata, Jakarta",
      "history": "Tokoh Awal di Angkatan Udara. Gugur saat perang mempertahankan Kemerdekaan Indonesia.",
      "img": "https://image.ibb.co/ehy9gK/iswahyudi.jpg"
    },
    {
      "nama": "Iwa Kusumasumantri",
      "nama2": "Prof. Mr. Iwa Koesoema Soemantri",
      "kategori": "Pahlawan Nasional",
      "asal": "Jawa Barat",
      "lahir": "31 Mei 1899 di Ciamis, Jawa Barat",
      "usia": "72 tahun",
      "gugur": "27 November 1971   di Rumah Sakit Cipto Mangunkusumo, Jakarta.",
      "lokasimakam": "TPU Karet Bivak, Jakarta",
      "history": "Anggota Panitia Persiapan Kemerdekaan Indonesia (PPKI). Menteri Perguruan Tinggi dan Ilmu Pengetahuan, Rektor Pertama UNPAD. Menteri Sosial dan Perburuhan ke 1. Menteri Pertahanan.",
      "img": "https://image.ibb.co/iN4h1K/iwa_kusumasumantri.jpg"
    },
    {
      "nama": "Izaak Huru Doko",
      "nama2": "Izaac Huru Doko",
      "kategori": "Pahlawan Nasional",
      "asal": "NTT (Nusa Tenggara Timur)",
      "lahir": " 20 November 1913   di Seba, Pulau Sabu, Kupang, Nusa Tenggara Timur",
      "usia": "71 tahun",
      "gugur": "29 Juli 1985 di Kupang, Nusa Tenggara Timur",
      "lokasimakam": "Kupang, Nusa Tenggara Timur (Monumen & Patung)",
      "history": "Aktifis Kemerdekaan dan Pendidik. Menteri Pengajaran NIT. Menteri Muda Penerangan NIT. Penggagas berdirinya Universitas Udayana di Denpasar Bali (1959) dan Undana Kupang (1962).",
      "img": "https://image.ibb.co/jAu4Fe/izaak_huru_doko.jpg"
    },
    {
      "nama": "J.A. Dimara",
      "nama2": "Mayor TNI Johannes Abraham Dimara",
      "kategori": "Pahlawan Nasional",
      "asal": "Papua",
      "lahir": "16 April 1916 di Korem, Biak Utara, Papua",
      "usia": "84 tahun",
      "gugur": "20 Oktober 2000 di Jakarta, Indonesia",
      "lokasimakam": "Taman Makam Pahlawan (TMP) Kalibata, Jakarta",
      "history": "Pejuang Kemerdekaan Indonesia di Papua terhadap Belanda. Ketua OPI (Organisasi Pembebasan Irian Barat). Bersama Bung Karno ikut menyerukan Trikora di Yogyakarta.",
      "img": "https://image.ibb.co/gaPh1K/j_a_dimara.jpg"
    },
    {
      "nama": "J. Leimena",
      "nama2": "dr. Johanes Leimena",
      "kategori": "Pahlawan Nasional",
      "asal": "Maluku",
      "lahir": "6 Maret 1905   di Ambon, Maluku",
      "usia": "72 tahun",
      "gugur": "29 Maret 1977   di Jakarta, Indonesia",
      "lokasimakam": "Taman Makam Pahlawan (TMP) Kalibata Jakarta",
      "history": " Wakil Perdana Menteri, Menteri Kesehatan, Menteri Sosial, Menteri Ditribusi, Menteri Perguruan Tinggi dan Ilmu Pengetahuan, Ketua Umum Partai Kristen Indonesia (Parkindo), Pendiri GMKI.",
      "img": "https://image.ibb.co/hXuRTz/j_leimena.jpg"
    },
    {
      "nama": "Jamin Ginting",
      "nama2": "Letjen TNI Djamin Gintings",
      "kategori": "Pahlawan Nasional",
      "asal": " Sumatera Utara",
      "lahir": "12 Januari 1921 di Desa Suka, Tiga Panah, Kabupaten Karo, Sumatera Utara",
      "usia": "53 tahun",
      "gugur": "23 Oktober 1974 di Ottawa, Kanada",
      "lokasimakam": "Taman Makam Pahlawan Kalibata Jakarta",
      "history": "Tokoh perjuangan kemerdekaan Republik Indonesia di Sumatera Utara. Kepala Staf Kodam II/Bukit Barisan, Assisten Dua Bagian Perang di TNI, Panglima TT I Bukit Barisan, Panglima Sumatera Utara. Wakil Sekretaris Jenderal Front Nasional di Kabinet Dwikora Revisi Kedua. Penulis buku 'Bukit Kadir'. Sekretaris Presiden merangkap Wakil Sekretaris Negara. Duta Besar RI di Kanada.",
      "img": "https://image.ibb.co/ea66Tz/jamin_ginting.jpg"
    },
    {
      "nama": "John Lie ",
      "nama2": "Laksda Lie Tjeng Tjoan, Jahja Daniel Dharma",
      "kategori": "Pahlawan Nasional",
      "asal": "Sulawesi Utara",
      "lahir": "9 Maret 1911 di Manado, Sulawesi Utara",
      "usia": "77 tahun",
      "gugur": "27 Agustus 1988 di Jakarta, Indonesia",
      "lokasimakam": "Taman Makam Pahlawan (TMP) Kalibata, Jakarta",
      "history": "Laksamana Muda TNI Angkatan Laut. Pejuang Kemerdekaan Indonesia. Komandan Kapal Perang Rajawali. Mendapat penghargaan Bintang Mahaputera Utama dan Bintang Mahaputera Adipradana.",
      "img": "https://image.ibb.co/dVh21K/john_lie.jpg"
    },
    {
      "nama": "Juanda Kartawijaya ",
      "nama2": "Ir. H. Raden Djoeanda Kartawidjaja",
      "kategori": "Pahlawan Kemerdekaan Nasional",
      "asal": "Jawa Tengah",
      "lahir": "14 Januari 1911 di Tasikmalaya, Hindia Belanda, Jawa Tengah",
      "usia": "52 tahun",
      "gugur": " 7 November 1963 di Jakarta, Indonesia",
      "lokasimakam": "Taman Makam Pahlawan (TMP) Kalibata, Jakarta",
      "history": "Perdana Menteri Indonesia Terakhir, Menteri Keuangan ke 11, Menteri Pertahanan ke 11, Menteri Pekerjaan Umum ke 5, Menteri Perhubungan ke 3. Deklarasi Djuanda tahun 1957 (Negara Kepulauan NKRI).",
      "img": "https://image.ibb.co/kLCfoz/juanda_kartawijaya.jpg"
    },
    {
      "nama": "K.S. Tubun ",
      "nama2": "Brigadir Polisi Karel Satsuit Tubun",
      "kategori": "Pahlawan Revolusi",
      "asal": "Maluku",
      "lahir": "14 Oktober 1928   di Tual, Maluku, Indonesia",
      "usia": " 36 tahun",
      "gugur": "1 Oktober 1965   di Jakarta, Indonesia",
      "lokasimakam": "Taman Makam Pahlawan (TMP) Kalibata, Jakarta",
      "history": "Brigadir Polisi. Korban kebiadaban (dibunuh) Gerakan 30 September saat mengawal kediaman Wakil Perdana Menteri, Dr. J. Leimena di Jakarta, yang bertetangga dengan Jenderal A.H. Nasution.",
      "img": "https://image.ibb.co/hC721K/k_s_tubun.jpg"
    },
    {
      "nama": "Katamso D.",
      "nama2": "Brigjen. Katamso Darmokusumo",
      "kategori": "Pahlawan Revolusi",
      "asal": "DIY (Yogyakarta)",
      "lahir": "5 Februari 1923 di Sragen, Jawa Tengah",
      "usia": "42 tahun",
      "gugur": "1 Oktober 1965 di Kentungan, Yogyakarta",
      "lokasimakam": "Taman Makam Pahlawan (TMP) Kusuma Negara Semaki, Yogyakarta",
      "history": "Brigadir Jenderal TNI Angkatan Darat. Dan Rem 072/Pamungkas DIY. Brigjen. Katamso bersama Wakil Dan Rem 072 Kolonel Sugiyono menjadi korban kebiadaban (dianiaya dan dibunuh) oleh Gerakan 30 September di Kentungan, Yogyakarta.",
      "img": "https://image.ibb.co/j4vN1K/katamso_d.jpg"
    },
    {
      "nama": "Ki Bagus Hadikusumo ",
      "nama2": "Ki Bagoes Hadikoesoemo",
      "kategori": "Pahlawan Nasional",
      "asal": "DIY (Yogyakarta)",
      "lahir": "24 November 1890 di Yogyakarta, Indonesia",
      "usia": " 63 tahun",
      "gugur": "4 November 1954 di Jakarta, Indonesia",
      "lokasimakam": " Tempat Pemakaman Umum (TPU) Kuncen, Kecamatan Wirobrajan, Kota Yogyakarta",
      "history": " Tokoh kemerdekaan, Tokoh Islam, Tokoh Muhammadiyah. Ketua Pengurus Besar (PB) Muhammadiyah selama sebelas tahun, dari 1942 hingga 1953. Anggota Badan Penyelidik Usaha-Usaha Persiapan Kemerdekaan Indonesia (BPUPKI), Anggota Panitia Persiapan Kemerdekaan Indonesia (PPKI). Beliau sangat besar perannya dalam perumusan Mukadimah UUD 1945 dengan memberikan landasan ketuhanan, kemanusiaan, keberadaban, dan keadilan.",
      "img": "https://image.ibb.co/mxeFMK/ki_bagus_hadikusumo.jpg"
    },
    {
      "nama": "Ki Hadjar Dewantara",
      "nama2": "Dr. (HC) RM Soewardi Soerjaningrat",
      "kategori": "Pahlawan Kemerdekaan Nasional",
      "asal": "DIY (Yogyakarta)",
      "lahir": "2 Mei 1889 di Yogyakarta, Indonesia",
      "usia": "69 tahun",
      "gugur": "26 April 1959 di Yogyakarta, Indonesia",
      "lokasimakam": "Taman Wijaya Brata, Celeban, Yogyakarta",
      "history": " Bapak Pendidikan Nasional Indonesia. Menteri Pendidikan Nasional Pertama. Pendiri Taman Siswa, Aktivis Pergerakan Kemerdekaan RI. Tanggal kelahirannya diperingati sebagai Hari Pendidikan Nasional.",
      "img": "https://image.ibb.co/g4Dyae/ki_hadjar_dewantara.jpg"
    },
    {
      "nama": "Ki Mangunsarkoro ",
      "nama2": "Ki Sarmidi Mangunsarkoro",
      "kategori": "Pahlawan Nasional",
      "asal": "Jawa Tengah",
      "lahir": "23 Mei 1904 di Surakarta, Jawa Tengah",
      "usia": "53 tahun",
      "gugur": "8 Juni 1957 di Jakarta, Indonesia",
      "lokasimakam": "Makam Keluarga Besar Tamansiswa Taman Wijaya Brata, Celeban, Yogyakarta.",
      "history": "Pendidik dan Pejuang Pendidikan. Menteri Pendidikan, Pengajaran dan Kebudayaan ke 5. Tampil sebagai pembicara dalam Kongres Pemuda 28 Oktober 1928. Penulis berbagai buku pendidikan.",
      "img": "https://image.ibb.co/i1V0oz/ki_mangunsarkoro.jpg"
    },
    {
      "nama": "Kiras Bangun",
      "nama2": "Garamata",
      "kategori": "Pahlawan Nasional",
      "asal": "Sumatera Utara",
      "lahir": "1852 di Kampung Batu Karang, Kabupaten Karo, Sumatera Utara",
      "usia": "90 tahun",
      "gugur": "22 Oktober 1942 di Karo, Sumatera Utara",
      "lokasimakam": "Desa Batukarang, Payung, Kabupaten Karo, Sumatera Utara",
      "history": "Pemimpin Gerilya yang menggalang kekuatan lintas agama di Sumatera Utara dan Aceh untuk menentang penjajahan Belanda.",
      "img": "https://image.ibb.co/ff7foz/kiras_bangun.jpg"
    },
    {
      "nama": "Kusumah Atmaja ",
      "nama2": "Prof. Dr. R. Soelaiman Effendi Koesoemah Atmadja, SH.",
      "kategori": "Pahlawan Kemerdekaan Nasional",
      "asal": "Jawa Barat",
      "lahir": "8 September 1898 di Purwakarta, Jawa Barat",
      "usia": "53 tahun",
      "gugur": "11 Agustus 1952 di Jakarta, Indonesia",
      "lokasimakam": "Taman Makam Pahlawan (TMP) Kalibata, Jakarta.",
      "history": "Ketua Mahkamah Agung Pertama. Anggota Badan Penyelidik Usaha Persiapan Kemerdekaan Indonesia (BPUPKI).",
      "img": "https://image.ibb.co/f5o9gK/kusumah_atmaja.jpg"
    },
    {
      "nama": "L. N. Palar",
      "nama2": "Mr. Lambertus Nicodemus Palar",
      "kategori": "Pahlawan Nasional",
      "asal": "Sulawesi Utara",
      "lahir": "5 Juni 1900 di Rurukan, Tomohon, Sulawesi Utara",
      "usia": "80 tahun",
      "gugur": "12 Februari 1981 di Jakarta, Indonesia",
      "lokasimakam": "Taman Makam Pahlawan (TMP) Kalibata, Jakarta.",
      "history": "Diplomat, Perunding dalam Usaha Pengakuan Internasional Kemerdekaan Indonesia. Duta Besar RI untuk PBB. Duta Besar RI di India, Jerman Timur, Uni Soviet, Amerika Serikat,",
      "img": "https://image.ibb.co/bzfdae/l_n_palar.jpg"
    },
    {
      "nama": "La Maddukelleng ",
      "nama2": "Arung Matowa Wajo XXXIV, Arung Siengkang",
      "kategori": "Pahlawan Nasional",
      "asal": "Sulawesi Selatan",
      "lahir": "1700 di Wajo, Sulawesi Selatan",
      "usia": "65 tahun",
      "gugur": "1765 di Wajo, Sulawesi Selatan",
      "lokasimakam": "Kota Sengkang, Kabupaten Wajo, Sulawesi Selatan",
      "history": "Raja Pasir dari Kesultanan Pasir. Raja Wajo (Arung Matowa Wajo XXXIV) di Kerajaan Wajo. Memimpin pasukan dari suku Bugis, Pasir, Kutai, Makassar serta Bugis-Pagatan, untuk melawan Belanda.",
      "img": "https://image.ibb.co/fzdmTz/la_maddukelleng.jpg"
    },
    {
      "nama": "M.H. Thamrin",
      "nama2": "Mohammad Husni Thamrin",
      "kategori": "Pahlawan Kemerdekaan Nasional",
      "asal": "DKI Jakarta",
      "lahir": "16 Februari 1894 di Weltevreden, Batavia (Jakarta, Indonesia)",
      "usia": "46 tahun",
      "gugur": "11 Januari 1941   di Senen, Batavia (Jakarta, Indonesia)",
      "lokasimakam": "TPU (Pemakaman Umum) Karet, Jakarta.",
      "history": "Politikus dan Aktifis Kemerdekaan. Tokoh Betawi yang pertama kali menjadi anggota Volksraad (Dewan Rakyat) di Hindia Belanda, mewakili kelompok Inlanders (pribumi).",
      "img": "https://image.ibb.co/dZqGTz/m_h_thamrin.jpg"
    },
    {
      "nama": "M.T. Haryono",
      "nama2": "Letjen. Mas Tirtodarmo Harjono",
      "kategori": "Pahlawan Revolusi",
      "asal": "Jawa Timur",
      "lahir": "20 Januari 1924 di Surabaya, Jawa Timur",
      "usia": "41 tahun",
      "gugur": "1 Oktober 1965 di Lubang Buaya, Jakarta",
      "lokasimakam": "Taman Makam Pahlawan (TMP) Kalibata, Jakarta.",
      "history": "Pejuang Kemerdekaan Indonesia. Letnan Jenderal Angkatan Darat, korban kebiadaban (dibunuh) Gerakan 30 September.",
      "img": "https://image.ibb.co/cAjzgK/m_t_haryono.jpg"
    },
    {
      "nama": "Maria Walanda Maramis",
      "nama2": "Maria Josephine Catherine Maramis",
      "kategori": "Pahlawan Nasional",
      "asal": "Sulawesi Utara",
      "lahir": "1 Desember 1872 di Kema, Sulawesi Utara",
      "usia": "51 tahun",
      "gugur": "22 April 1924 di Maumbi, Sulawesi Utara",
      "lokasimakam": "Taman Makam Pahlawan (TMP) Maria Walanda Maramis, Desa Maumbi Kecamatan Airmadidi, Kabupaten Minahasa Utara, Sulawesi Utara.",
      "history": " Pendidik dan Penggiat Hak-Hak Perempuan. Sosok pendobrak adat, pejuang kemajuan dan emansipasi perempuan di dunia politik dan pendidikan. Pendiri Percintaan Ibu Kepada Anak Temurunannya (PIKAT)",
      "img": "https://image.ibb.co/k9uzgK/maria_walanda_maramis.jpg"
    },
    {
      "nama": "Martha Christina Tiahahu",
      "nama2": "Martha Christina Tiahahu",
      "kategori": "Pahlawan Nasional",
      "asal": " Maluku",
      "lahir": "4 Januari 1800 di Abubu, Nusa Laut, Maluku, Indonesia",
      "usia": "17 tahun",
      "gugur": "2 Januari 1818   di Laut Banda, Maluku, Indonesia",
      "lokasimakam": " Karang Panjang, Ambon Maluku (Patung, Monumen yang menghadap laut)",
      "history": " Pejuang Kemerdekaan yang unik yaitu seorang puteri remaja yang turut dalam pertempuran melawan tentara kolonial Belanda dalam perang Pattimura tahun 1817. Meninggal dalam tahanan Belanda.",
      "img": "https://image.ibb.co/eODEFe/martha_christina_tiahahu.jpg"
    },
    {
      "nama": "Marthen Indey",
      "nama2": "Marthen Indey",
      "kategori": "Pahlawan Nasional",
      "asal": "Papua",
      "lahir": "14 Maret 1912   di Doromena, Jayapura, Papua, Indonesia",
      "usia": " 74 tahun",
      "gugur": "17 Juli 1986   di Doromena, Jayapura, Papua, Indonesia",
      "lokasimakam": "Kompleks Makam Pahlawan Nasional Marthen Indey, Kampung Sabron, Kabupaten Jayapura, Papua",
      "history": " Aktifis Kemerdekaan Indonesia yang membantu Pembentukan NKRI (Negara Kesatuan Republik Indonesia), khususnya Pembebasan Papua dari Penjajah Belanda.",
      "img": "https://image.ibb.co/iWuMve/marthen_indey.jpg"
    },
    {
      "nama": "Mas Isman",
      "nama2": "Mayor Jenderal Mas Isman",
      "kategori": "Pahlawan Nasional",
      "asal": "Jawa Timur",
      "lahir": "1 Januari 1924 di Bondowoso, Jawa Timur",
      "usia": "58 tahun",
      "gugur": "12 Desember 1982 di Surabaya, Jawa Timur",
      "lokasimakam": "Pemakaman Umum Tanah Kusir, Jakarta",
      "history": "Pendiri Koperasi Simpan Pinjam Gotong Royong (Kosgoro) pada 10 November 1957. Komandan BKR Pelajar Surabaya sejak 9 November 1945. Anggota delegasi RI untuk berunding di PBB pada 1958. Kepala Perwakilan RI di Rangoon, Birma pada 1959, Duta Besar RI di Bangkok, Thailand (1960-1964), dan Kairo, Mesir (1964-1967). Selama menjadi anggota DPR/MPR RI 1978-1982, beliau tetap berkiprah dalam bidang organisasi kemasyarakatan, pendidikan, dan kemanusiaan.",
      "img": "https://image.ibb.co/dsAGTz/mas_iman.jpg"
    },
    {
      "nama": "Mas Mansur",
      "nama2": "K.H. Mas Mansoer",
      "kategori": "Pahlawan Kemerdekaan Nasional",
      "asal": "Jawa Timur",
      "lahir": "25 Juni 1896 di Surabaya, Jawa Timur",
      "usia": "49 tahun",
      "gugur": "25 April 1946 di Kalisosok, Surabaya, Jawa Timur",
      "lokasimakam": "Gipo Surabaya, Jawa Timur",
      "history": "Pejuang Kemerdekaan Indonesia. Ketua Umum Pengurus Besar Muhammadiyah (1937-1943). Tokoh Pembaharu Islam. Terkenal sebagai Empat Serangkai (Soekarno, M. Hatta, Ki Hadjar Dewantara, dan Mas Mansur).",
      "img": "https://image.ibb.co/n1nwTz/mas_mansur.jpg"
    },
    {
      "nama": "Maskun Sumadireja ",
      "nama2": "Maskoen Soemadiredja",
      "kategori": "Pahlawan Nasional",
      "asal": "Jawa Barat",
      "lahir": "25 Mei 1907 di Bandung, Jawa Barat",
      "usia": "78 tahun",
      "gugur": "4 Januari 1986 di Jakarta, Indonesia",
      "lokasimakam": "Taman Makam Pahlawan (TMP) Kalibata, Jakarta",
      "history": "Aktifis Kemerdekaan Indonesia, Politisi.",
      "img": "https://image.ibb.co/kiRC1K/maskun_sumadireja.jpg"
    },
    {
      "nama": "Moehammad Jasin",
      "nama2": "Komjen Dr. H. Muhammad Jasin",
      "kategori": "Pahlawan Nasional",
      "asal": "Jawa Timur",
      "lahir": "9 Juni 1920   di Bau-Bau, Buton, Sulawesi Tenggara",
      "usia": "92 tahun",
      "gugur": "3 Mei 2012   di RS Polri Kramat Jati, Jakarta",
      "lokasimakam": "Taman Makam Pahlawan (TMP) Kalibata, Jakarta.",
      "history": "Komjen Dr. H. Moehammad Jasin adalah Bapak Brigade Mobil (Brimob) Polri. Komandan Tokubetsu Keisatsutai (Polisi Istimewa) Surabaya, dan mengubahnya menjadi Kepolisian Negara Republik Indonesia. Menjadi Kepala Kepolisian di Karesidenan Malang (1946), berjasa mengatasi Agresi Militer Belanda dan APRA (Angkatan Perang Ratu Adil) di Bandung, serta pengamanan dari ancaman DI/TII. Komandan Mobiele Brigade Besar MBB Jatim. Anggota Dewan Pertimbangan Agung (DPA), anggota MPRS dan MPR. Duta Besar Luar Biasa dan Berkuasa Penuh RI untuk Tanzania.",
      "img": "https://image.ibb.co/bOWqoz/moehammad_jasin.jpg"
    },
    {
      "nama": "Mohammad Hatta",
      "nama2": "Dr. (HC) Drs. H. Mohammad Hatta",
      "kategori": "Pahlawan Nasional, Pahlawan Proklamator",
      "asal": "Sumatera Barat",
      "lahir": "12 Agustus 1902 di Bukit Tinggi, Sumatera Barat",
      "usia": "77 tahun",
      "gugur": "14 Maret 1980 di Jakarta, Indonesia",
      "lokasimakam": "TPU Tanah Kusir, Jakarta Selatan, DKI Jakarta.",
      "history": "Aktifis Kemerdekaan Indonesia. Proklamator RI, Negarawan, Ekonom, Administrator. Wakil Presiden Pertama Republik Indonesia. Perdana Menteri ke 3. Menteri Pertahanan ke 4. Bapak Koperasi Indonesia.",
      "img": "https://image.ibb.co/mvGO8z/mohammad_hatta.jpg"
    },
    {
      "nama": "Natsir",
      "nama2": "Dr. Mohammad Natsir",
      "kategori": "Pahlawan Nasional",
      "asal": "Sumatera Barat",
      "lahir": "17 Juli 1908  di Alahan Panjang, Lembah Gumanti, Solok, Sumatera Barat",
      "usia": "84 tahun",
      "gugur": "6 Februari 1993   di Jakarta, Indonesia",
      "lokasimakam": "TPU Karet Bivak, Tanah Abang, Jakarta.",
      "history": "Pejuang Kemerdekaan Indonesia, Politisi, Sastrawan, Penulis (45 buku). Tokoh Sederhana Sepanjang Zaman. Perdana Menteri Indonesia Ke 5. Menteri Komunikasi dan Informatika ke 2. Pendiri dan Pemimpin Partai Masyumi. Presiden Liga Muslim se-Dunia (World Muslim Congress), Ketua Dewan Masjid se-Dunia.",
      "img": "https://image.ibb.co/fXyEFe/mohammad_natsir.jpg"
    },
    {
      "nama": "Mohammad Yamin ",
      "nama2": "Prof. Mohammad Yamin, SH.",
      "kategori": "Pahlawan Nasional",
      "asal": "Sumatera Barat",
      "lahir": "24 Agustus 1903   di Talawi, Sawahlunto, Sumatera Barat",
      "usia": "59 tahun",
      "gugur": "17 Oktober 1962   di Jakarta, Indonesia",
      "lokasimakam": "MPN Prof. Dr. Muhammad Yamin, SH., Talawi, Kec. Talawi, Kota Sawahlunto, Sumatera Barat",
      "history": "Aktifis Kemerdekaan Indonesia. Sastrawan, sejarawan, budayawan, politikus, ahli hukum. Anggota BPUPKI. Menteri Penerangan. Menteri Pengajaran, Pendidikan, dan Kebudayaan. Menteri Kehakiman. Menteri Sosial dan Budaya. Ketua Dewan Perancang Nasional. Ketua Dewan Pengawas IKBN Antara, dsb.",
      "img": "https://image.ibb.co/c5Bqoz/mohammad_yamin.jpg"
    },
    {
      "nama": "Muhammad Mangundiprojo",
      "nama2": "H.R. Mohammad Mangoendiprodjo",
      "kategori": "Pahlawan Nasional ",
      "asal": "Jawa Tengah",
      "lahir": "5 Januari 1905 di Sragen, Jawa Tengah",
      "usia": "83 tahun",
      "gugur": "13 Desember 1988 di Bandar Lampung, Lampung",
      "lokasimakam": "Taman Makam Pahlawan Bandar Lampung, Lampung",
      "history": "Pejuang kemerdekaan, salah satu pemimpin Pertempuran Surabaya (perlawanan terhadap pasukan Sekutu) yang akhirnya dijadikan sebagai Hari Pahlawan Indonesia (10 November). Kepala Divisi Tentara Keamanan Rakyat Jawa Timur ke-1. Bupati Ponorogo ke 4, Residen (Gubernur) pertama Lampung. Cucunya adalah Indroyono Soesilo, Menteri Kemaritiman Indonesia 2014-2019.",
      "img": "https://image.ibb.co/mUDQMK/muhammad_mangundiprojo.jpg"
    },
    {
      "nama": "Mustopo",
      "nama2": "Mayjen. Prof. Dr. Moestopo",
      "kategori": "Pahlawan Nasional",
      "asal": "Jawa Timur",
      "lahir": "13 Juli 1913 di Ngadiluwih, Kediri, Jawa Timur",
      "usia": "73 tahun",
      "gugur": "29 September 1986 di Bandung, Jawa Barat, Indonesia",
      "lokasimakam": "Taman Makam Pahlawan (TMP) Cikutra, Bandung, Jawa Barat.",
      "history": "Pejuang Kemerdekaan Indonesia. Dokter gigi Indonesia dan Pendidik. Menteri Pertahanan Ad. Interim. Penasehat Jenderal Sudirman. Panglima Pasukan Penggempur dan Panglima Teritorial Jawa Timur. Pendiri dan Ketua Yayasan Pendidikan Prof. Dr. Moestopo.",
      "img": "https://image.ibb.co/iuxkMK/mustopo.jpg"
    },
    {
      "nama": "Muwardi",
      "nama2": "dr. Moewardi, Sp.THT.",
      "kategori": "Pahlawan Nasional",
      "asal": "Jawa Tengah",
      "lahir": "1907 di Pati, Jawa Tengah",
      "usia": "41 tahun",
      "gugur": "13 Oktober 1948 di Surakarta (Solo), Jawa Tengah",
      "lokasimakam": "RS. dr. Muwardi Surakarta, Jawa Tengah (Monumen/Patung)",
      "history": "Pejuang Kemerdekaan Indonesia. Komisaris Besar Kepanduan Bangsa Indonesia. Pemimpin Redaksi Majalah Jong-Java. Ketua Jong-Java Cabang Jakarta. Turut mengikrarkan Sumpah Pemuda 28 Oktober 1928. Menangani Keamanan saat Proklamasi Kemerdekaan.",
      "img": "https://image.ibb.co/c0nkMK/muwardi.jpg"
    },
    {
      "nama": "Nani Wartabone",
      "nama2": "H. Nani Wartabone",
      "kategori": "Pahlawan Nasional",
      "asal": "Gorontalo",
      "lahir": "30 Januari 1907 di Kampung Suwawa, Gorontalo",
      "usia": "78 tahun",
      "gugur": "3 Januari 1986 di Suwawa, Gorontalo",
      "lokasimakam": "Taman Makam Pahlawan (TMP) Nani Wartabone, Desa Bube (Kec. Suwawa), Kab. Bone Bolango, Gorontalo.",
      "history": "Pejuang Kemerdekaan Indonesia. Proklamator Kemerdekaan Indonesia 23 Januari 1942 di Gorontalo. Residen Sulawesi Utara. Kepala pemerintahan di Gorontalo, Kepala Daerah Sulawesi Utara. Anggota MPRS, Anggota DPRGR, Anggota Dewan Perancang Nasional, Anggota DPA.",
      "img": "https://image.ibb.co/kWeX1K/nani_wartabone.jpg"
    },
    {
      "nama": "Nur Ali",
      "nama2": "KH. Noer Alie",
      "kategori": "Pahlawan Nasional",
      "asal": "Jawa Barat",
      "lahir": "1914 di Bekasi, Jawa Barat",
      "usia": "78 tahun",
      "gugur": "1992 di Bekasi, Jawa Barat",
      "lokasimakam": "Cikarang, Bekasi, Jawa Barat.",
      "history": "Pejuang Kemerdekaan Indonesia. Pemimpin Islam dan Pendidik. Memimpin Tentara Mahasiswa selama Revolusi Nasional.",
      "img": "https://image.ibb.co/g4SKgK/nur_ali.jpg"
    },
    {
      "nama": "Nyai Ahmad Dahlan",
      "nama2": "Siti Walidah, Nyai Achmad Dachlan",
      "kategori": "Pahlawan Nasional",
      "asal": "DIY (Yogyakarta)",
      "lahir": "1872 di Kauman, Yogyakarta, Indonesia",
      "usia": "74 tahun",
      "gugur": "31 Mei 1946 di Kauman, Yogyakarta, Indonesia",
      "lokasimakam": "Masjid Gedhe Kauman, Gondomanan, Yogyakarta.",
      "history": "Tokoh Emansipasi Perempuan. Tokoh Pembaharu Islam. Pendiri dan Pemimpin Aisyiyah. Berpastiripasi dalam diskusi perang bersama Jenderal Sudirman dan Presiden Sukarno. Tokoh Muhammadiyah, istri K.H. Ahmad Dahlan.",
      "img": "https://image.ibb.co/e2mC1K/nyai_ahmad_dahlan.jpg"
    },
    {
      "nama": "Nyi Ageng Serang",
      "nama2": "Raden Ajeng Kustiyah Wulaningsih Retno Edi",
      "kategori": "Pahlawan Nasional",
      "asal": "Jawa Tengah",
      "lahir": "1752 di Serang, Purwodadi, Jawa Tengah",
      "usia": "76 tahun",
      "gugur": "1828 di Yogyakarta, Indonesia",
      "lokasimakam": "Banjarharjo, Kalibawang, Kulon Progo, DI Yogyakarta",
      "history": "Salah satu Panglima Perang melawan Kolonial Belanda pada Perang Diponegoro. Penasehat siasat perang Pangeran Diponegroro. Puteri Panembahan Notoprojo. Keturunan Sunan Kalijaga, Nenek moyang Ki Hajar Dewantara.",
      "img": "https://image.ibb.co/fzxkMK/nyi_ageng_serang.jpg"
    },
    {
      "nama": "Opu Daeng Risadju",
      "nama2": "Famajjah, Fammajah",
      "kategori": "Pahlawan Nasional",
      "asal": "Sulawesi Selatan",
      "lahir": "1880 di Palopo, Sulawesi Selatan",
      "usia": "84 tahun",
      "gugur": "10 Februari 1964  di Palopo, Sulawesi Selatan",
      "lokasimakam": "Perkuburan Raja-Raja Luwu, Lakkoe, Palopo, Sulawesi Selatan.",
      "history": "Pejuang Kemerdekaan Indonesia. Bangsawan Keturunan Raja-raja Gowa, Bone dan Luwu. Cendekiawan, Wanita Politisi Pertama, berperang melawan Belanda selama Revolusi Nasional. Ketua PSII Wilayah Tanah Luwu Palopo.",
      "img": "https://image.ibb.co/nrzzgK/opu_daeng_risadju.jpg"
    },
    {
      "nama": "Oto Iskandar Dinata",
      "nama2": "Jalak Harupat, Raden Otto Iskandar di Nata",
      "kategori": "Pahlawan Nasional",
      "asal": "Jawa Barat",
      "lahir": "31 Maret 1897 di Bojongsoang, Bandung, Jawa Barat",
      "usia": "48 tahun",
      "gugur": "20 Desember 1945   di Mauk, Tangerang, Banten",
      "lokasimakam": "MPN Oto Iskandar Dinata, Pasir Pahlawan, Kec. Lembang, Kab. Bandung Barat, Jawa Barat",
      "history": "ejuang Kemerdekaan Indonesia. Anggota BPUPKI dan PPKI. Ketua Paguyuban Pasundan. Anggota Volksraad (Dewan Rakyat). Wakil Ketua Budi Utomo cabang Bandung dan Pekalongan. Pemimpin Surat Kabar Tjahaja (1942-1945).",
      "img": "https://image.ibb.co/hi7kMK/oto_iskandar_dinata.jpg"
    },
    {
      "nama": "Pangeran Sambernyowo ",
      "nama2": "KGPAA Mangkunegoro I, Raden Mas Said",
      "kategori": "Pahlawan Nasional",
      "asal": "Jawa Tengah",
      "lahir": "7 April 1725 di Kraton Kartasura, Jawa Tengah",
      "usia": "70 tahun",
      "gugur": "28 Desember 1795 di Surakarta, Jawa Tengah",
      "lokasimakam": "Astana Mangadeg (Komplek Makam Raja-raja Mangkunegara I, II, III), Desa Karang Bangun Kecamatan Matesih, Kabupaten Karanganyar, Jawa Tengah.",
      "history": " Pendiri Praja Mangkunegaran, Pendiri Istana Mangkunegaran. Memimpin Perjuangan melawan Penjajah Belanda di Jawa Tengah. Dikenal dekat dengan rakyat. Julukan Pangeran Sambernyawa diberikan VOC, karena dalam setiap peperangan selalu membawa kematian bagi lawannya.",
      "img": "https://image.ibb.co/b59zgK/pagerang_sumbernyowo.jpg"
    },
    {
      "nama": "Pajongga Daeng Ngalle ",
      "nama2": "H. Pajonga Daeng Ngalie Karaeng Polongbangkeng",
      "kategori": "Pahlawan Nasional",
      "asal": "Sulawesi Selatan",
      "lahir": "1901 di Takalar, Sulawesi Selatan",
      "usia": "57 tahun",
      "gugur": "23 Februari 1958 di Takalar, Sulawesi Selatan",
      "lokasimakam": "Taman Makam Pahlawan (TMP) Kabupaten Takalar, Sulawesi Selatan.",
      "history": "Pejuang Pembentukan Republik Indonesia. Ketua Laskar Gerakan Muda Bajoang, dan Koordinator Serangan di Sulawesi Selatan selama Revolusi Nasional. Karaeng (Kepala Pemerintahan Distrik) Polongbangkeng.",
      "img": "https://image.ibb.co/duxkMK/pajongga_daeng_ngalle.jpg"
    },
    {
      "nama": "Pakubuwana VI ",
      "nama2": "Sri Susuhunan Pakubuwono VI, Sinuhun Bangun Tapa",
      "kategori": "Pahlawan Nasional",
      "asal": "Jawa Tengah",
      "lahir": "26 April 1807 di Surakarta, Jawa Tengah",
      "usia": "42 tahun",
      "gugur": "2 Juni 1849 di Ambon, Maluku, Indonesia",
      "lokasimakam": "Astana Imogiri, Kompleks Pemakaman Keluarga Raja Keturunan Mataram, Bantul, DIY.",
      "history": " Raja Kasunanan Surakarta yang memerintah tahun 1823 - 1830. Pendukung Perjuangan Pangeran Diponegoro melawan Pasukan Kolonial Belanda.",
      "img": "https://image.ibb.co/nRhKgK/pakubuwana_vi.jpg"
    },
    {
      "nama": "Pakubuwana X ",
      "nama2": "Sri Susuhunan Pakubuwono X",
      "kategori": "Pahlawan Nasional",
      "asal": "Jawa Tengah",
      "lahir": "29 November 1866 di Surakarta, Jawa Tengah",
      "usia": "72 tahun",
      "gugur": "22 Februari 1939 di Surakarta",
      "lokasimakam": "Astana Imogiri, Kompleks Pemakaman Keluarga Raja Keturunan Mataram, Bantul, DIY.",
      "history": " Raja Kasunanan Surakarta yang memerintah tahun 1893 - 1939. Disebut sebagai Sinuhun Wicaksana atau Raja Besar dan Bijaksana. Pendukung berbagai kegiatan untuk kepentingan Indonesia (Pendirian Organisasi Sarekat Dagang Islam, Kongres Bahasa Indonesia I, penerbitan media massa, dsb).",
      "img": "https://image.ibb.co/fESKgK/pakubuwana_x.jpg"
    },
    {
      "nama": "Pangeran Antasari ",
      "nama2": "Panembahan Amiruddin Khalifatul Mukminin",
      "kategori": "Pahlawan Nasional",
      "asal": "Kalimantan Selatan",
      "lahir": "1809 di Kayu Tangi, Kesultanan Banjar",
      "usia": "53 tahun",
      "gugur": "11 Oktober 1862   di Kampung Bayan Begok, Sampirang, Barito Utara, Kalimantan Tengah",
      "lokasimakam": "aman Makam Perang Banjar, Kelurahan Surgi Mufti, Banjarmasin, Kalimatan Selatan",
      "history": "Sultan Banjar. Panembahan Amiruddin Khalifatul Mukminin, yaitu pemimpin pemerintahan, panglima perang dan pemuka agama tertinggi. Memimpin Kerajaan Banjar melawan Pasukan Belanda.",
      "img": "https://image.ibb.co/mYKoae/pangerang_antasari.jpg"
    },
    {
      "nama": "Pattimura ",
      "nama2": "Kapitan Pattimura, Thomas Matulessy",
      "kategori": "Pahlawan Nasional",
      "asal": "Maluku",
      "lahir": "8 Juni 1783   di Haria, Saparua, Maluku, Indonesia",
      "usia": "34 tahun ",
      "gugur": "16 Desember 1817   di New Victoria, Ambon, Maluku, Indonesia",
      "lokasimakam": "Ambon, Maluku (Pattimura Park/Taman Pattimura, Monumen Pattimura)",
      "history": " Pemimpin dan Panglima Perang Maluku melawan Pasukan Kolonial Belanda (Perang Pattimura). Memimpin Raja-raja Patih, Para Kapitan, dan Tua-tua Adat di Maluku. Menggalang persatuan dengan kerajaan Ternate dan Tidore, Raja-raja di Bali, Sulawesi dan Jawa untuk berperang melawan pasukan Belanda.",
      "img": "https://image.ibb.co/nDfuFe/pattimura.jpg"
    },
    {
      "nama": "Pierre Tendean",
      "nama2": "Kapten CZI. Pierre Andreas Tendean",
      "kategori": "Pahlawan Nasional",
      "asal": "DKI Jakarta",
      "lahir": "21 Februari 1939   di Batavia (Jakarta, Indonesia)",
      "usia": " 26 tahun",
      "gugur": "1 Oktober 1965   di Lubang Buaya, Jakarta, Indonesia",
      "lokasimakam": "Taman Makam Pahlawan (TMP) Kalibata, Jakarta.",
      "history": "Ajudan Jenderal Abdul Haris Nasution, korban kebiadaban (dibunuh) Gerakan 30 September.",
      "img": "https://image.ibb.co/dyts1K/pierre_tendean.jpg"
    },
    {
      "nama": "Pong Tiku ",
      "nama2": "Pongtiku, Nene Baso",
      "kategori": "Pahlawan Nasional",
      "asal": "Sulawesi Selatan",
      "lahir": "1846 di Panggala Toraja Utara, Sulawesi Selatan",
      "usia": "61 tahun",
      "gugur": "10 Juli 1907 di Sungai Sadan, Singki Rantepao, Toraja, Sulawesi Selatan",
      "lokasimakam": " Kecamatan Rinding Allo kabupaten Toraja Utara, Sulawesi Selatan.",
      "history": "Bangsawan Toraja. Panglima Perang di Tana Toraja dan Toraja Utara yang memimpin perlawanan terhadap Penjajah Belanda.",
      "img": "https://image.ibb.co/d6N8ae/pong_tiku.jpg"
    },
    {
      "nama": "R. A. Kartini ",
      "nama2": "Raden Adjeng Kartini, Raden Ayu Kartini",
      "kategori": "Pahlawan Nasional",
      "asal": "Jawa Tengah",
      "lahir": "21 April 1879   di Jepara, Jawa Tengah",
      "usia": "25 tahun",
      "gugur": "17 September 1904   di Rembang, Jawa Tengah",
      "lokasimakam": "Desa Bulu, Kecamatan Bulu, Rembang, Jawa Tengah.",
      "history": " Pelopor kebangkitan perempuan pribumi. Pejuang Hak-Hak Perempuan dari Jawa. Buku 'Habis Gelap Terbitlah Terang' berisi Surat-surat yang pernah dikirimkan Kartini kepada teman-temannya di Eropa yang sekaligus berisi pemikirannya.",
      "img": "https://image.ibb.co/dNZMve/r_a_kartini.jpg"
    },
    {
      "nama": "R. E. Martadinata ",
      "nama2": "Laksamana Laut Raden Eddy Martadinata",
      "kategori": "Pahlawan Nasional",
      "asal": "Jawa Barat",
      "lahir": "29 Maret 1921 di Bandung, Jawa Barat",
      "usia": "45 tahun",
      "gugur": "1 Oktober 1965   di Lubang Buaya, Jakarta",
      "lokasimakam": "Taman Makam Pahlawan (TMP) Kalibata, Jakarta.",
      "history": "Letnan Jenderal Angkatan Darat, korban kebiadaban (dibunuh) Gerakan 30 September. Ajudan Jenderal Sudirman, turut dalam pertempuran Ambarawa. Kepala Staf Tentara dan Teritorial (T&T) IV/Diponegoro. Deputy Kepala Staf Angkatan Darat wilayah Sumatera.",
      "img": "https://image.ibb.co/hbFi8z/r_e_martadinata.jpg"
    },
    {
      "nama": "R. Suprapto",
      "nama2": "Letjend. Raden Soeprapto",
      "kategori": "Pahlawan Nasional",
      "asal": "Jawa Tengah",
      "lahir": "20 Juni 1920 di Purwokerto, Jawa Tengah",
      "usia": "45 tahun",
      "gugur": "1 Oktober 1965   di Lubang Buaya, Jakarta",
      "lokasimakam": "Taman Makam Pahlawan (TMP) Kalibata, Jakarta",
      "history": "Letnan Jenderal Angkatan Darat, korban kebiadaban (dibunuh) Gerakan 30 September. Ajudan Jenderal Sudirman, turut dalam pertempuran Ambarawa. Kepala Staf Tentara dan Teritorial (T&T) IV/Diponegoro. Deputy Kepala Staf Angkatan Darat wilayah Sumatera.",
      "img": "https://image.ibb.co/iZJ38z/r_suprapto.jpg"
    },
    {
      "nama": "Raden Tumenggung Setia Pahlawan",
      "nama2": "Abdul Kadir",
      "kategori": "Pahlawan Nasional",
      "asal": "Kalimantan Barat",
      "lahir": "1771 di Sintang, Kalimantan Barat",
      "usia": "104 tahun",
      "gugur": "1875 di Tanjung Suka Dua, Melawi, Kalimantan Barat",
      "lokasimakam": "Natali Mangguk Liang, Melawi, Kalimantan Barat",
      "history": "Kepala Pemerintahan Melawi. Berperang melawan Pasukan Kolonial Belanda. Berhasil mengembangkan potensi perekonomian wilayah Melawi dan mempersatukan Suku Dayak dengan Melayu.",
      "img": "https://image.ibb.co/fuhwTz/raden_tumenggung_setia_pahlawan.jpg"
    },
    {
      "nama": "Radin Inten II",
      "nama2": "Radin Inten II gelar Kesuma Ratu",
      "kategori": "Pahlawan Nasional",
      "asal": "5 Oktober 1856 di Negara Ratu (Lampung), Indonesia",
      "lahir": "1834 di Negara Ratu (Lampung), Indonesia",
      "usia": "22 tahun",
      "gugur": "5 Oktober 1856   di Negara Ratu (Lampung), Indonesia",
      "lokasimakam": "Desa Gedungharta, Kelurahan Cempaka, Kecamatan Penengahan, Kabupaten Lampung Selatan",
      "history": "Raja di Negara Ratu (sekarang Provinsi Lampung), masih keturunan Fatahillah (Sunan Gunung Jati). Memperjuangkan kemakmuran rakyat Lampung dan memimpin Revolusi melawan Penjajah Belanda.",
      "img": "https://image.ibb.co/hqDgve/radin_inten_ii.jpg"
    },
    {
      "nama": "Raja Haji Fisabilillah",
      "nama2": "Pangeran Sutawijaya, Panembahan Senopati",
      "kategori": "Pahlawan Nasional",
      "asal": "Riau",
      "lahir": "1725 di Kota Lama, Ulusungai, Riau, Indonesia",
      "usia": "59 tahun",
      "gugur": "18 Juni 1784 di Teluk Ketapang, Melaka (sekarang Malaysia).",
      "lokasimakam": "Pulau Penyengat, Indera Sakti, Tanjung Pinang, Kepulauan Riau.",
      "history": "Raja (Yang Dipertuan Muda) Kerajaan Melayu Riau-Lingga-Johor-Pahang IV. Berhasil membangun pulau Biram Dewa di sungai Riau Lama. Memimpin Perlawanan terhadap Pasukan Kolonial Belanda. Seorang Pujangga Besar, Sastrawan yang berjasa besar meletakkan dasar-dasar Bahasa Indonesia.",
      "img": "https://image.ibb.co/bxpzgK/raja_haji_fisabilillah.jpg"
    },
    {
      "nama": "Rajiman Wedyodiningrat",
      "nama2": "dr. KRT Radjiman Wedyodiningrat, M.Art",
      "kategori": "Pahlawan Nasional",
      "asal": "DIY (Yogyakarta)",
      "lahir": "21 April 1879 di Yogyakarta, Indonesia",
      "usia": "73 tahu",
      "gugur": "20 September 1952 di Ngawi, Jawa Timur, Indonesia",
      "lokasimakam": "Kompleks Makam Pahlawan Dr. Wahidin Soedirohoesodo, Malati, Sleman, Yogyakarta",
      "history": "Tokoh Pendiri Republik Indonesia. Pendiri dan Ketua organisasi Boedi Oetomo. Ketua BPUPKI. Anggota DPA. Pemimpin sidang DPR pertama saat Indonesia menjadi NKRI. Dokter ahli penyakit pes.",
      "img": "https://image.ibb.co/b5JEFe/rajiman_wedyodiningrat.jpg"
    },
    {
      "nama": "Ranggong Daeng Romo",
      "nama2": "Ranggong Daeng Romo",
      "kategori": "Pahlawan Nasional",
      "asal": "Sulawesi Selatan",
      "lahir": "1915 di Kampung Bone-Bone, Polongbangkeng, Kabupaten Takalar, Sulawesi Selatan",
      "usia": "32 tahun",
      "gugur": "27 Februari 1947 di Markas besar Lapris, Langgese",
      "lokasimakam": "Kompleks makam Desa Ko'mara Kecamatan Polombangkeng Utara, Kabupaten Takalar, Sulawesi Selatan.",
      "history": "Pejuang Kemerdekaan Indonesia. Pemimpin Laskar Lipan Bajeng. Panglima LAPRIS (Laskar Pemberontak Rakyat Indonesia Sulawesi), gabungan laskar-laskar di Sulawesi Selatan yang berperang melawan Belanda.",
      "img": "https://image.ibb.co/iASVoz/ranggong_daeng_romo.jpg"
    },
    {
      "nama": "Rasuna Said ",
      "nama2": "Hajjah Rangkayo Rasuna Said",
      "kategori": "Pahlawan Nasional",
      "asal": "Sumatera Barat",
      "lahir": "14 September 1910 di Maninjau, Agam, Sumatera Barat",
      "usia": "55 tahun",
      "gugur": "2 November 1965 di Jakarta, Indonesia",
      "lokasimakam": "Taman Makam Pahlawan (TMP) Kalibata, Jakarta",
      "history": "Pejuang Kemerdekaan Indonesia. Penggiat Hak-Hak Perempuan. Anggota DPR RIS. Anggota DPA.",
      "img": "https://image.ibb.co/n3igve/rasuna_said.jpg"
    },
    {
      "nama": "Saharjo",
      "nama2": "Dr. Sahardjo, SH.",
      "kategori": "Pahlawan Nasional",
      "asal": "Jawa Tengah",
      "lahir": "26 Juni 1909   di Solo, Jawa Tengah",
      "usia": "54 tahun",
      "gugur": "13 November 1963   di Jakarta, Indonesia",
      "lokasimakam": "Taman Makam Pahlawan (TMP) Kalibata, Jakarta",
      "history": "Tokoh penting dalam reformasi hukum di Indonesia. Menteri Hukum dan Hak Asasi Manusia ke-11. Hasil buah pemikirannya yang penting adalah Undang-undang Warga Negara Indonesia tahun 1947 dan Undang-undang Pemilihan Umum tahun 1953.",
      "img": "https://image.ibb.co/mKoQMK/saharjo.jpg"
    },
    {
      "nama": "Sam Ratulangi ",
      "nama2": "Dr. Gerungan Saul Samuel Jacob Ratulangi",
      "kategori": "Pahlawan Nasional",
      "asal": "Sulawesi Utara ",
      "lahir": "5 November 1890 di Tondano, Sulawesi Utara",
      "usia": "58 tahun",
      "gugur": "30 Juni 1949 di Jakarta, Indonesia",
      "lokasimakam": "Kelurahan Wawalintouan, Kecamatan Tondano Minahasa, Sulawesi Utara",
      "history": "Pejuang Kemerdekaan Indonesia. Tokoh multidimensional, terkenal dengan filsafatnya: 'Si tou timou tumou tou' yang artinya: manusia baru dapat disebut sebagai manusia, jika sudah dapat memanusiakan manusia. Gubernur Sulawesi Utara pertama.",
      "img": "https://image.ibb.co/hho38z/sam_ratulangi.jpg"
    },
    {
      "nama": "Samanhudi ",
      "nama2": "Kyai Haji Samanhudi",
      "kategori": "Pahlawan Nasional",
      "asal": " Jawa Tengah ",
      "lahir": "1868   di Laweyan, Surakarta, Jawa Tengah",
      "usia": "88 tahun",
      "gugur": "28 Desember 1956   di Klaten, Jawa Tengah",
      "lokasimakam": "Banaran, Kecamatan Grogol, Kabupaten Sukoharjo, Jawa Tengah",
      "history": "Pejuang Kemerdekaan Indonesia. Pendiri dan Ketua Sarekat Dagang Islam (SDI). Ketua Kehormatan SI (Sarekat Islam). Pendiri Barisan Pemberontak Indonesia Cabang Solo dan Gerakan Persatuan Pancasila untuk melawan Belanda, serta membentuk laskar Gerakan Kesatuan Alap-alap.",
      "img": "https://image.ibb.co/fe7wTz/samanhudi.jpg"
    },
    {
      "nama": "Silas Papare",
      "nama2": "Papua",
      "kategori": "Pahlawan Nasional",
      "asal": "Papua",
      "lahir": "18 Desember 1918 di Serui, Kepulauan Yapen, Papua, Indonesia",
      "usia": "54 tahun",
      "gugur": "7 Maret 1973 di Serui, Kepulauan Yapen, Papua, Indonesia",
      "lokasimakam": "Taman Makam Pahlawan (TMP) Serui, Kepulauan Yapen, Papua, Indonesia.",
      "history": "",
      "img": "https://image.ibb.co/imregK/silas_papare.jpg"
    },
    {
      "nama": "Sisingamangaraja XII ",
      "nama2": "Raja Si Singamangaradja XII, Ompu Pulo Batu",
      "kategori": "Pahlawan Nasional",
      "asal": "Sumatera Utara",
      "lahir": "18 Februari 1845 di Bakkara, Tapanuli, Sumatra Utara.",
      "usia": "62 tahun",
      "gugur": " 17 Juni 1907 di Desa Si Onom Hudon, perbatasan Kabupaten Tapanuli Utara dan Kabupaten Dairi.",
      "lokasimakam": "Makam Pahlawan Nasional di Soposurung, Balige, Sumatera Utara.",
      "history": "Maharaja di Negeri Toba, Sumatera Utara. Memimpin perjuangan secara bergerilya melawan Pasukan Kolonial Belanda dalam waktu yang cukup lama (30 tahun, 1877-1907). Dalam beberapa peperangan, beliau bekerjasama dengan pasukan dari Kerajaan Aceh.",
      "img": "https://image.ibb.co/iC9Mve/sisingamangaraja_xii.jpg"
    },
    {
      "nama": "S. Parman ",
      "nama2": "Letjend. Siswondo Parman",
      "kategori": "Pahlawan Nasional",
      "asal": "Jawa Tengah",
      "lahir": "4 Agustus 1918 di Wonosobo, Jawa Tengah",
      "usia": "47 tahun ",
      "gugur": "1 Oktober 1965 di Lubang Buaya, Jakarta",
      "lokasimakam": "Taman Makam Pahlawan (TMP) Kalibata, Jakarta",
      "history": " Letnant Jenderal Angkatan Darat. Kepala Staf Markas Besar Polisi Tentara (PT) di Yogyakarta. Kepala Staf Gubernur Militer Jakarta Raya. Atase Militer RI di London. Asisten I Menteri/Panglima Angkatan Darat. Perwira Intelijen RI, korban kebiadaban (dibunuh) Gerakan 30 September.",
      "img": "https://image.ibb.co/dxLTae/siswondo_parman.jpg"
    },
    {
      "nama": "Slamet Riyadi",
      "nama2": "Brigjen. Ignatius Slamet Rijadi",
      "kategori": "Pahlawan Nasional",
      "asal": "Jawa Tengah",
      "lahir": "26 Juli 1927 di Surakarta, Jawa Tengah",
      "usia": "23 tahun",
      "gugur": "4 November 1950 di Ambon, Maluku, Indonesia",
      "lokasimakam": "1. Taman Makam Pahlawan (TMP) depan klompeks Taman Jurug Jebres Solo, Jawa Tengah. 2. Ambon, Maluku.",
      "history": "Pejuang Kemerdekaan Indonesia. Brigadir Jenderal Angkatan Darat. Memimpin pasukan Indonesia di beberapa daerah di Jawa Tengah, termasuk Ambarawa dan Semarang untuk melawan penjajah Belanda. Gugur/meninggal saat memadamkan pemberontakan RMS di Maluku yang didukung Belanda.",
      "img": "https://image.ibb.co/b2NKgK/slamet_riyadi.jpg"
    },
    {
      "nama": "Sudirman ",
      "nama2": "Jenderal Besar Raden Soedirmanc",
      "kategori": "Pahlawan Nasional",
      "asal": "Jawa Tengah ",
      "lahir": " 24 Januari 1916 di Purbalingga, Jawa Tengah",
      "usia": "34 tahun",
      "gugur": "29 Januari 1950 di Magelang, Jawa Tengah",
      "lokasimakam": "Taman Makam Pahlawan (TMP) Kusumanegara Semaki, Yogyakarta.",
      "history": " Pejuang Kemerdekaan Indonesia. Seorang Guru, Panglima Besar Tentara Nasional Indonesia pertama (TKR, Tentara Keamanan Rakyat), dari tahun 1945 sampai 1950 yang merupakan tahun kritis dan sangat menentukan kemerdekaan Republik Indonesia.",
      "img": "https://image.ibb.co/f37kMK/sudirman.jpg"
    },
    {
      "nama": "Sugiono ",
      "nama2": "Kolonel Inf. R. Sugiyono Mangunwiyoto",
      "kategori": "Pahlawan Nasional",
      "asal": "DIY (Yogyakarta)",
      "lahir": "12 Agustus 1926 di Gedaren, Sumbergiri, Ponjong, Gunung Kidul, DI Yogyakarta.",
      "usia": "39 tahun",
      "gugur": "1 Oktober 1965   di Kentungan, Yogyakarta",
      "lokasimakam": "Taman Makam Pahlawan (TMP) Kusumanegara Semaki, Yogyakarta.",
      "history": "Kolonel Infanteri TNI Angkatan Darat. Wakil Dan Rem 072/Pamungkas DIY. Kolonel Sugiyono bersama Dan Rem 072 Brigjen. Katamso menjadi korban kebiadaban (dianiaya dan dibunuh) oleh Gerakan 30 September di Kentungan, Yogyakarta.",
      "img": "https://image.ibb.co/khR1ve/sugiono.jpg"
    },
    {
      "nama": "Suharso",
      "nama2": "Prof. Dr. R. Soeharso",
      "kategori": "Pahlawan Nasional",
      "asal": " Jawa Tengah",
      "lahir": "13 Mei 1912 di Ampel, Boyolali, Jawa Tengah",
      "usia": " 58 tahun ",
      "gugur": "27 Februari 1971   di Rumah Jl. Slamet Riyadi, Surakarta, Jawa Tengah",
      "lokasimakam": " Dukuh Seboto, Desa Seboto, Kecamatan Ampel, Kabupaten Boyolali, Jawa Tengah.",
      "history": "Pejuang Kemanusiaan. Dokter ahli bedah. Bapak Orthopaedic Indonesia. Pendiri Pusat Rehabilitasi penderita cacat jasmani di Surakarta, Jawa Tengah. Pelopor Medis di Bidang Prostesis (kaki dan tangan tiruan). Pendiri Rumah Sakit Ortopedi dan Yayasan Pemeliharaan Anak-anak Cacat di Surakarta.",
      "img": "https://image.ibb.co/jTYgve/suharso.jpg"
    },
    {
      "nama": "Sukarjo Wiryopranoto ",
      "nama2": "Soekardjo Wirjopranoto",
      "kategori": "Pahlawan Nasional",
      "asal": "Jawa Tengah",
      "lahir": "5 Juni 1903 di Kesugihan, Cilacap, Jawa Tengah",
      "usia": "59 tahun",
      "gugur": "23 Oktober 1962 di New York, Amerika Serikat",
      "lokasimakam": " Taman Makam Pahlawan (TMP) Kalibata, Jakarta",
      "history": " Perintis Kemerdekaan Indonesia. Pendiri Persatuan Bangsa Indonesia (PBI) bersama dr. Soetomo. Anggota Volksraad. Sekretaris Gabungan Politik Indonesia (Gapi). Memimpin surat kabar Asia Raya. Pembina majalah Mimbar Indonesia. Duta Besar di Italia, Vatikan, RRC. Wakil Tetap Indonesia di PBB.",
      "img": "https://image.ibb.co/k8yQMK/sukarjo_wiryopranoto.jpg"
    },
    {
      "nama": "Sukarni ",
      "nama2": "Soekarni Kartodiwirjo",
      "kategori": "Pahlawan Nasional",
      "asal": "Jawa Timur",
      "lahir": "14 Juli 1916   di Blitar, Jawa Timur",
      "usia": "54 tahun",
      "gugur": "7 Mei 1971 di Jakarta",
      "lokasimakam": "Taman Makam Pahlawan Kalibata Jakarta",
      "history": "Tokoh kemerdekaan, diplomat, dan politisi. Salah satu tokoh kelompok pejuang pemuda yang berperan penting dalam mempercepat proklamasikan kemerdekaan RI pada 17 Agustus 1945, dengan cara melakukan 'penculikan' terhadap Soekarno-Hatta ke Rengasdengklok, turut merumuskan naskah proklamasi. Pendiri organisasi Persatuan Pemuda Kita. Ketua Pengurus Besar Indonesia Muda. Anggota Konstituante, Anggota Dewan Pertimbangan Agung. Duta Besar RI untuk RRT (Republik Rakyat Tiongkok) dan Mongolia.",
      "img": "https://image.ibb.co/bQpX1K/sukarni.jpg"
    },
    {
      "nama": "Sukarno",
      "nama2": "Dr.(HC) Ir. H. Soekarno",
      "kategori": "Pahlawan Nasional, Pahlawan Proklamator",
      "asal": "Jawa Timur",
      "lahir": "6 Juni 1901 di Surabaya, Jawa Timur",
      "usia": "69 tahun",
      "gugur": "21 Juni 1970 di RSPAD (Rumah Sakit Pusat Angkatan Darat) Gatot Subroto, Jakarta.",
      "lokasimakam": "Kompeks Makam Soekarno, Blitar, Jawa Timur",
      "history": "Proklamator Kemerdekaan Indonesia (bersama Mohammad Hatta). Presiden Indonesia Pertama. Mendapatkan gelar Doktor Honoris Causa dari 26 universitas terkemuka di Dunia. Pendiri Partai Nasional Indonesia. Pemrakarsa Konferensi Asia Afrika dan Gerakan Non Blok. Anggota BPUPKI, Ketua Panitia Perancang UUD, Ketua PPKI (Panitia Persiapan Kemerdekaan Indonesia).",
      "img": "https://image.ibb.co/mSSwTz/sukarno.jpg"
    },
    {
      "nama": "Sultan Daeng Raja ",
      "nama2": "Hadji Andi Sultan Daeng Radja",
      "kategori": "Pahlawan Nasional",
      "asal": "Sulawesi Selatan",
      "lahir": "20 Mei 1894   di Matekko, Gantarang",
      "usia": "68 tahun",
      "gugur": "17 Mei 1963   di Rumah Sakit Pelamonia Makassar, Sulawesi Selatan",
      "lokasimakam": "Di belakang Mesjid Raya Ponre, Kabupaten Bulukumba, Sulawesi Selatan",
      "history": "Tokoh Kemerdekaan Indonesia. Regen (Kepala Adat) Gantarang. Turut aktif dalam Kongres Pemuda Indonesia 28 Oktober 1928 yang menghasilkan Sumpah Pemuda. Bupati Daerah Bantaeng (Sulawesi Selatan). Anggota Konstituante Indonesia. Turut aktif dalam rapat Panitia Persiapan Kemerdekaan Indonesia (PPKI). Pemrakarsa pembentukan organisasi Persatuan Pergerakan Nasional Indonesia (PPNI).",
      "img": "https://image.ibb.co/dWbqoz/sultan_daeng_raja.jpg"
    },
    {
      "nama": "Sultan Mahmud Badaruddin II",
      "nama2": "Raden Hasan Pangeran Ratu",
      "kategori": "Pahlawan Nasional",
      "asal": "Sumatera Selatan",
      "lahir": "1 Rajab 1181 H (23 Nov 1767) di Palembang, Sumatera Selatan, Indonesia",
      "usia": "84 tahun",
      "gugur": "26 September 1852   di Ternate, Maluku Utara, Indonesia",
      "lokasimakam": "Pekuburan Islam Kelurahan Makassar Barat, Kecamatan Ternate Tengah, Kota Ternate, Maluku Utara, Indonesia.",
      "history": "Raja terbesar di Kesultanan Palembang Darussalam (memerintah tahun 1803-1813 dan 1818-1821). Memimpin pertempuran melawan Penjajah Inggris dan Belanda, salah satu peperangan terbesar adalah Perang Menteng (dari kata Muntinghe) 11-15 Juni 1819 yang dimenangkan pasukan Sultan Mahmud Badaruddin II. Pada Pertempuran terakhir 22 Mei - 24 Juni 1821, Belanda berhasil mengalahkan Kesultanan Palembang. Tanggal 13 Juli 1821, sultan beserta sebagian keluarganya diasingkan ke Pulau Ternate, Maluku Utara. Selama 31 tahun beliau diasingkan di Ternate, dan tanggal 26 September 1852, di Ternate, beliau meninggal dunia dalam usia 84 tahun.",
      "img": "https://image.ibb.co/kM5Tae/sultan_mahmud_badaruddin_ii.jpg"
    },
    {
      "nama": "Sultan Nuku",
      "nama2": "Nuku Muhammad Amiruddin Kaicil Paparangan",
      "kategori": "Pahlawan Nasional",
      "asal": "Maluku Utara",
      "lahir": "1738   di Soasiu, Tidore, Maluku Utara, Indonesia",
      "usia": "67 tahun",
      "gugur": "14 November 1805 di Tidore, Maluku Utara, Indonesia",
      "lokasimakam": "Kompleks Makam Sultan Nuku, di Lingkungan Soambelo, Kelurahan Soa Sio, Tidore, Maluku Utara.",
      "history": "Sultan (Raja) ke 30 di Kerajaan Tidore (Kesultanan Tidore), dan Tidore mencapai puncak kejayaannya pada saat diperintah Sultan Nuku. Beliau sekaligus sebagai Jou Barakati (Panglima Perang) yang memimpin Pertempuran laut maupun darat melawan Pasukan Kolonial Belanda, dengan cita-cita membebaskan seluruh kepulauan Maluku Utara (Maloko Kie Raha) dari penjajah bangsa asing.",
      "img": "https://image.ibb.co/ipAi8z/sultan_nuku.jpg"
    },
    {
      "nama": "Sultan Syahrir",
      "nama2": "Soetan Sjahrir)",
      "kategori": "Pahlawan Nasional ",
      "asal": "Sumatera Barat",
      "lahir": "Jumat, 5 Maret 1909 di Padang Panjang, Sumatera Barat",
      "usia": "57 tahun",
      "gugur": "Sabtu, 9 April 1966 di Zurich, Swiss",
      "lokasimakam": "Taman Makam Pahlawan (TMP) Kalibata, Jakarta",
      "history": "Sutan Syahrir (ejaan lama: Soetan Sjahrir) (lahir di Padang Panjang, Sumatera Barat, 5 Maret 1909 - meninggal di Zürich, Swiss, 9 April 1966 pada umur 57 tahun) adalah Pahlawan Nasional (Keppres No. 76 Tahun 1966, tanggal 9 April 1966). Meskipun perawakannya kecil, yang oleh teman-temannya sering dijuluki Si Kancil, Sutan Syahrir adalah salah satu penggemar olah raga dirgantara, pernah menerbangkan pesawat kecil dari Jakarta ke Yogyakarta pada kesempatan kunjungan ke Yogyakarta. Di samping itu juga senang sekali dengan musik klasik, di mana beliau juga bisa memainkan biola. Sutan Syahrir adalah Perdana Menteri Indonesia Pertama (Perdana Menteri termuda di dunia, usia 36 th), ia menjabat sebagai Perdana Menteri Indonesia dari 14 November 1945 hingga 20 Juni 1947. Ia menjadi Menteri Dalam Negeri ke dua, Menteri Luar Negeri ke dua, Pendiri Partai Sosialis Indonesia (PSI), Pemimpin Redaksi Majalah Himpunan Pemuda Nasionalis, Penggagas Pendirian Himpunan Pemuda Nasionalis (1927), Jong Indonesie (Pemuda Indonesia) yang menjadi motor Konggres Pemuda Indonesia (1928); Ketua Partai Nasional Indonesia (PNI Baru) pada tahun 1932; Duta Besar Keliling (Ambassador-at-Large) RI. Sutan Syahrir menjadi Ketua delegasi RI pada Perundingan Linggarjati. Setelah kasus PRRI tahun 1958, hubungan Sutan Syahrir dan Presiden Soekarno memburuk sampai akhirnya PSI (Partai Sosialis Indonesia) dibubarkan tahun 1960. Tahun 1962 hingga 1965, Syahrir ditangkap dan dipenjarakan tanpa diadili sampai menderita stroke. Setelah itu Syahrir diijinkan untuk berobat ke Zurich Swis, salah seorang kawan dekat yang pernah menjabat wakil ketua PSI Sugondo Djojopuspito menghantarkan beliau di Bandara Kemayoran dan Syahrir memeluk Sugondo degan air mata, dan akhirnya meninggal di Swiss pada tanggal 9 April 1966.",
      "img": "https://image.ibb.co/fW3gve/sultan_syahrir.jpg"
    },
    {
      "nama": "Sultan Thaha Syaifuddin ",
      "nama2": "Raden Thaha Adiningrat",
      "kategori": "Pahlawan Nasional",
      "asal": "Jambi",
      "lahir": "1816 di Istana Tanah Pilih Kampung Gedang Kerajaan Jambi, Jambi, Indonesia",
      "usia": "88 tahun",
      "gugur": "Selasa, 26 April 1904 di Desa Betung Bedarah, Kecamatan Tebo Ilir, Kabupaten Tebo",
      "lokasimakam": "Muara Tebo, Kabupaten Tebo, Jambi.",
      "history": "Sultan Thaha Syaifuddin adalah Raja terakhir di Kesultanan Jambi, seorang Pahlawan Nasional Indonesia. Beliau memimpin rakyat Jambi untuk berperang melawan Pasukan Kolonial Belanda sejak menjadi Raja/Sultan (dari tahun 1855 - 1904, hampir 50 tahun). Terkenal sebagai raja yang rendah hati, suka bergaul dengan rakyatnya dan sangat membenci penjajah Belanda. Pada tahun 1904, Belanda melakukan peyergapan terhadap pasukan Sultan Thaha di dusun Betung Bedarah. Dalam peyergapan itu, Sultan Thaha yang saat itu berusia 88 tahun Gugur (ditangkap dan dibunuh) oleh Belanda. Jasadnya dikebumikan di Desa Betung Bedarah, Kecamatan Tebo Ilir, Kabupaten Tebo, Jambi, yang kini dijadikan sebagai Makam Pahlawan Nasional Sultan Thaha Syaifuddin.",
      "img": "https://image.ibb.co/m4Ogve/sultan_thaha_syaifuddin.jpg"
    },
    {
      "nama": "Supeno",
      "nama2": "Supeno",
      "kategori": "Pahlawan Nasional",
      "asal": "Jawa Tengah",
      "lahir": "Senin, 12 Juni 1916 di Kota Pekalongan, Jawa Tengah",
      "usia": "32 tahun",
      "gugur": "Kamis, 24 Februari 1949  di Ganter, Ngliman, Sawahan, Nganjuk, Jawa Timur",
      "lokasimakam": "Taman Makam Pahlawan (TMP) Semaki, Yogyakarta.",
      "history": "Soepeno (lahir di Kota Pekalongan, 12 Juni 1916 – meninggal di Ganter, Ngliman, Sawahan, Nganjuk, 24 Februari 1949 pada umur 32 tahun) adalah Menteri Pembangunan/Pemuda pada Kabinet Hatta I. Dia meninggal dunia sewaktu masih menjabat dalam jabatan tersebut akibat Agresi Militer Belanda II. Di masa Kabinet Hatta yang Pertama, ia diangkat menjadi Menteri Pemuda dan Olahraga. Sewaktu Belanda menyerang Indonesia pada 19 Desember 1948, Supeno menjadi Menteri Pemuda dan Pembangunan RI. Supeno ikut bergerilya dan pasukan Belanda terus memburunya. Setelah berbulan-bulan bergerilya, Supeno dan rombongannya tertangkap Belanda di Desa Ganter, Nganjuk setelah Belanda menyerang wilayah Ganter pada 24 Februari 1949. Tentara Belanda menyuruhnya jongkok dan mengintrogasi dia. Soepeno mengatakan bahwa ia adalah penduduk daerah tersebut namun Belanda tidak percaya. Akhirnya, pelipisnya ditembak dan Supeno tewas seketika. Supeno pun kemudian dimakamkan di Nganjuk. Setahun kemudian, makamnya dipindahkan ke TMP Semaki, Yogyakarta.",
      "img": "https://image.ibb.co/idMZFe/supeno.jpg"
    },
    {
      "nama": "Supomo",
      "nama2": "Prof. Dr.Mr.Soepomo",
      "kategori": "Pahlawan Kemerdekaan Nasional",
      "asal": "Jawa Tengah",
      "lahir": "Kamis, 22 Januari 1903 di Sukoharjo, Jawa Tengah",
      "usia": "55 tahun",
      "gugur": "Jumat, 12 September 1958   di Jakarta, Indonesia",
      "lokasimakam": "Makam Keluarga di Kampung Yosoroto, Solo, Jawa Tengah.",
      "history": "Prof. Mr.Dr Soepomo (Ejaan Soewandi: Supomo; lahir di Sukoharjo, Jawa Tengah, 22 Januari 1903 – meninggal di Jakarta, 12 September 1958 pada umur 55 tahun) adalah seorang pahlawan nasional Indonesia. Soepomo dikenal sebagai arsitek Undang-undang Dasar 1945, bersama dengan Muhammad Yamin dan Sukarno. Hampir tidak ada biografi tentang Soepomo, kecuali satu yang dikerjakan Soegito (1977) berdasarkan proyek Departemen Pendidikan dan Kebudayaan. Marsilam Simanjuntak berpendapat bahwa Soepomo adalah sumber dari munculnya fasisme di Indonesia. Soepomo mengagumi sistem pemerintahan Jerman dan Jepang. Simanjuntak menilai Negara 'Orde Baru' ala Jenderal Soeharto adalah bentuk negara yang paling dekat dengan ideal Soepomo, kesimpulan yang masih perlu diperdebatkan ulang",
      "img": "https://image.ibb.co/dXD38z/supomo.jpg"
    },
    {
      "nama": "Supriyadi",
      "nama2": "Soedanco Soeprijadi",
      "kategori": "Pahlawan Nasional",
      "asal": "Jawa Timur",
      "lahir": "Jumat, 13 April 1923 di Trenggalek, Jawa Timur",
      "usia": "22 tahun",
      "gugur": "1945 di Biltar, Jawa Timur(sebagian menyatakan hilang, namun dipastikan gugur sebelum 17 Agustus 1945).",
      "lokasimakam": "Di Depan bekas markas PETA, Jl. Soedanco Soepriyadi, Blitar, Jawa Timur (Monumen/Patung)",
      "history": "Pada Oktober 1943, Jepang mendirikan milisi PETA untuk membantu tentara Jepang menghadapi Sekutu. Supriyadi bergabung dengan PETA dengan pangkat shodancho atau komandan platon, dan setelah mengikuti pelatihan ditugaskan di Blitar, Jawa Timur. Ia ditugaskan mengawasi pekerja romusha. Penderitaan pekerja-pekerja tersebut mendorongnya untuk memberontak melawan Jepang.Saat Soekarno sedang mengunjungi orangtuanya di Blitar, pasukan PETA memberitahunya bahwa mereka sedang merencanakan pemberontakan dan meminta pendapat Soekarno. Soekarno meminta mereka untuk mempertimbangkan akibatnya, tetapi Supriyadi yakin pemberontakan akan berhasil.Pada 14 Februari 1945, tentara PETA mulai memberontak. Namun, Jepang berhasil memadamkan pemberontakan ini. Enam (atau delapan) orang dihukum mati dan sisanya dipenjara antara tiga tahun hingga seumur hidup. Namun, Supriyadi tidak dihukum mati. Ada yang mengatakan Supriyadi melarikan diri dan bersembunyi dari Jepang dan tidak pernah ditemukan sesudahnya. Pada 6 Oktober 1945, pemerintah Indonesia yang baru didirikan menyatakan Supriyadi sebagai Menteri Keamanan Rakyat. Namun, ia tidak pernah muncul, dan pada tanggal 20 Oktober digantikan oleh menteri ad interim Imam Muhammad Suliyoadikusumo. Hingga kini nasibnya masih misterius. Ia secara resmi dinyatakan sebagai Pahlawan Nasional Indonesia pada 9 Agustus 1975 berdasarkan Keputusan Presiden No. 063/TK/1975.",
      "img": "https://image.ibb.co/dBckMK/supriyadi.jpg"
    },
    {
      "nama": "Suroso",
      "nama2": "Raden Pandji Soeroso",
      "kategori": "Pahlawan Nasional ",
      "asal": "Jawa Timur",
      "lahir": "Jumat, 3 November 1893   di Porong, Sidoarjo, Jawa Timur",
      "usia": "87 tahun",
      "gugur": "Sabtu, 16 Mei 1981   di Jakarta, Indonesia",
      "lokasimakam": "Mojokerto, Jawa Timur",
      "history": "Raden Pandji Soeroso (EYD: Suroso, lahir di Porong, Sidoarjo, Jawa Timur, 3 November 1893 – meninggal di Indonesia, 16 Mei 1981 pada umur 87 tahun) adalah mantan Gubernur Jawa Tengah, mantan Menteri Pekerjaan Umum Republik Indonesia, dan mantan anggota BPUPKI/PPKI. Ia juga bertugas sebagai wakil ketua BPUPKI yang dipimpin oleh K.R.T. Radjiman Wedyodiningrat.Pemerintah Indonesia telah mengangkat Raden Pandji Soeroso sebagai salah seorang Pahlawan Nasional Indonesia, melalui Surat Keputusan Presiden No. 81/TK/1986. Ia juga dikenal sebagai Pendiri Koperasi Pegawai Negeri Republik Indonesia, sehingga ia juga dijuluki Bapak Koperasi Pegawai Negeri Republik Indonesia.",
      "img": "https://image.ibb.co/mBd9gK/suroso.jpg"
    },
    {
      "nama": "Suryo ",
      "nama2": "Raden Mas Tumenggung Ario Soerjo",
      "kategori": "Pahlawan Kemerdekaan Nasional",
      "asal": "Jawa Timur",
      "lahir": "Sabtu, 9 Juli 1895 di Magetan, Jawa Timur",
      "usia": "53 tahun",
      "gugur": "Jumat, 10 September 1948 di Bago, Kedunggalar, Ngawi, Jawa Timur",
      "lokasimakam": "Sasono Mulyo, Sawahan, Kabupaten Magetan, Jawa Timur.",
      "history": "Gubernur Ario Suryo (Raden Mas Tumenggung Ario Soerjo, biasa dikenal dengan nama Gubernur Soerjo); lahir di Magetan, Jawa Timur, 9 Juli 1898 – meninggal di Bago, Kedunggalar, Ngawi, Jawa Timur, 10 September 1948 pada umur 50 tahun) adalah seorang pahlawan nasional Indonesia dan gubernur pertama Jawa Timur dari tahun 1945 hingga tahun 1948. Sebelumnya, ia menjabat Bupati di Kabupaten Magetan dari tahun 1938 hingga tahun 1943. Ia adalah menantu Raden Mas Arja Hadiwinoto. Setelah menjabat bupati Magetan, ia menjabat Su Cho Kan Bojonegoro pada tahun 1943.RM Suryo membuat perjanjian gencatan senjata dengan komandan pasukan Inggris Brigadir Jendral Mallaby di Surabaya pada tanggal 26 Oktober 1945. Namun tetap saja meletus pertempuran tiga hari di Surabaya 28-30 Oktober yang membuat Inggris terdesak. Presiden Sukarno memutuskan datang ke Surabaya untuk mendamaikan kedua pihak.Gencatan senjata yang disepakati tidak diketahui sepebuhnya oleh para pejuang pribumi. Tetap saja terjadi kontak senjata yang menewaskan Mallaby. Hal ini menyulut kemarahan pasukan Inggris. Komandan pasukan yang bernama Jenderal Mansergh mengultimatum rakyat Surabaya supaya menyerahkan semua senjata paling tanggal 9 November 1945, atau keesokan harinya Surabaya akan dihancurkan.Menanggapi ultimatum tersebut, Presiden Sukarno menyerahkan sepenuhnya keputusan di tangan pemerintah Jawa Timur, yaitu menolak atau menyerah. Gubernur Suryo dengan tegas berpidato di RRI bahwa Arek-Arek Suroboyo akan melawan ultimatum Inggris sampai darah penghabisan.Maka meletuslah pertempuran besar antara rakyat Jawa Timur melawan Inggris di Surabaya yang dimulai tanggal 10 November 1945. Selama tiga minggu pertempuran terjadi di mana Surabaya akhirnya menjadi kota mati. Gubernur Suryo termasuk golongan yang terakhir meninggalkan Surabaya untuk kemudian membangun pemerintahan darurat di Mojokerto.Monumen Gubernur Arioe Soerjo di NgawiTanggal 10 September 1948, mobil RM Suryo dicegat orang tak dikenal di tengah hutan Peleng, Kedunggalar, Ngawi. Dua perwira polisi yang lewat dengan mobil ikut ditangkap. Ke 3 orang lalu ditelanjangi, diseret ke dalam hutan dan dibunuh. Mayat ke 3 orang ditemukan keesokan harinya oleh seorang pencari kayu bakar.R. M. T. Soerjo dimakamkan di makam Sasono Mulyo, Sawahan, Kabupaten Magetan. Sebuah monumen yang dibangun untuk mengenang jasa-jasanya terletak di Kecamatan Kedunggalar kabupaten Ngawi.",
      "img": "https://image.ibb.co/jsW6Tz/suryo.jpg"
    },
    {
      "nama": "Suryopranoto",
      "nama2": "Raden Mas Soerjopranoto",
      "kategori": "Pahlawan Kemerdekaan Nasional",
      "asal": "DIY (Yogyakarta)",
      "lahir": "Rabu, 11 Januari 1871 di Yogyakarta, Indonesia",
      "usia": "88 tahun",
      "gugur": "Kamis, 15 Oktober 1959 di Cimahi, Jawa Barat",
      "lokasimakam": "Kotagede, Yogyakarta",
      "history": "Pangeran Soerjopranoto dan juga bangsawan-bangsawan lainnya di Praja Paku Alaman, umumnya tidak pernah menyembunyikan kenyataan sejarah, bahwa di dalam tubuh kerabat Paku Alaman itu, terutama Sri Paku Alam ke-II telah mengalir darah rakyat jelata yang segar yang berasal dari seorang petani di desa Sewon, Bantul, Yogyakarta, yang bernama Ronodigdoyo.Pada zaman Perang Perebutan Mahkota III (1747-1755) ia ikut terjun dalam perjuangan melawan Belanda (VOC), dan pernah memberikan jasa yang luar biasa kepada Pangeran Mangkubumi, adik Sultan Pakubuwono II. Sebab itu kepadanya dijanjikan kedudukan yang baik, apabila pemberontakan Pangeran Mangkubumi itu berhasil dengan kemenangan.Tapi sesudah perang selesai dan Pangeran Mangkubumi memperoleh bagian Barat Kerajaan Mataram setelah Perjanjian Gijanti (1755) dan ia naik tahta menjadi Sultan Hamengku Buwono ke-I, Sri Sultan alpa akan janjinya, dan memberikan Ronodigdoyo pada kedudukannya sebagai prajurit.Karena sakit hati, maka Ronodigdoyo meninggalkan istana tanpa pamit dan kemudian mendirikan perguruan di desa Sewon. Ia kawin dengan gadis desa setempat dan kemudian beranak tiga orang, yaitu : Prawironoto, Prawirodirdjo, dan seorang anak perempuan, Sedah Mirah (Sirih Mirah).Dikemudian hari putera mahkota, yang nantinya menjadi Sri Sultan Hamengku Buwono ke-II, yang belum tahu menahu asal usul Sedah Mirah, telah jatuh cinta kepada gadis desa itu. Maka tanpa sengaja setelah mereka menikah, Ronodigdoyo terangkat dengan sendirinya kepada kedudukan yang mulia, sebagai besan Sri Sultan Hamengku Buwono Ke-I.Ketika Sultan yang pertama mangkat pada tahun 1792, putera mahkota segera naik tahta menjadi Sultan Hamengku Buwono ke-II, dan Sedah Mirah diangkat menjadi permaisuri, bergelar Kanjeng Ratu Kencana Woelan (atau Kencana Woengoe). Dari permaisuri yang berasal dari rakyat jelata ini dilahirkan tiga orang anak, puteri semua, dan ternyata ketiganya diperistri oleh bangsawan-bangsawan yang memiliki kedudukan yang penting dalam sejarah, dan menurunkan pejuang-pejuang bangsa. Yang Pertama adalah Kanjeng Ratu Ayoe yang kemudian menjadi permaisuri Sri Paku Alam ke-II dan menjadi asal keturunan pahlawan-pahlawan nasional Aoejopranoto, dan Ki Hadjar Dewantara. Yang Kedua, Kanjeng Ratu Anom yang diperistri oleh Adipati Madiun dan kemudian yang Ketiga, Kanjeng Ratu Timoer, yang deperistri oleh Patih Sedolawe dan menurunkan Gondokoesoemo, yang cukup dikenal dalam Perang Diponogoro (1825-1830).",
      "img": "https://image.ibb.co/h5GvMK/suryopranoto.jpg"
    },
    {
      "nama": "Sutomo",
      "nama2": "Bung Tomo, Mayor Jenderal Soetomo",
      "kategori": "Pahlawan Nasional",
      "asal": "Jawa Timur",
      "lahir": "Minggu, 3 Oktober 1920 di Surabaya, Jawa Timur",
      "usia": "61 tahun",
      "gugur": "Rabu, 7 Oktober 1981 di Padang Arafah, Arab Saud",
      "lokasimakam": "TPU (Tempat Pemakamna Umum) Ngagel, Surabaya, Jawa Timur.",
      "history": "Sutomo pernah menjadi seorang jurnalis yang sukses. Kemudian ia bergabung dengan sejumlah kelompok politik dan sosial. Ketika ia terpilih pada 1944 untuk menjadi anggota Gerakan Rakyat Baru yang disponsori Jepang, hampir tak seorang pun yang mengenal dia. Namun semua ini mempersiapkan Sutomo untuk peranannya yang sangat penting, ketika pada Oktober dan November 1945, ia menjadi salah satu Pemimpin yang menggerakkan dan membangkitkan semangat rakyat Surabaya, yang pada waktu itu Surabaya diserang habis-habisan oleh tentara-tentara NICA. Sutomo terutama sekali dikenang karena seruan-seruan pembukaannya di dalam siaran-siaran radionya yang penuh dengan emosi.Meskipun Indonesia kalah dalam Pertempuran 10 November itu, kejadian ini tetap dicatat sebagai salah satu peristiwa terpenting dalam sejarah Kemerdekaan Indonesia. Setelah kemerdekaan Indonesia, Sutomo sempat terjun dalam dunia politik pada tahun 1950-an, namun ia tidak merasa bahagia dan kemudian menghilang dari panggung politik. Pada akhir masa pemerintahan Soekarno dan awal pemerintahan Suharto yang mula-mula didukungnya, Sutomo kembali muncul sebagai tokoh nasional.Padahal, berbagai jabatan kenegaraan penting pernah disandang Bung Tomo. Ia pernah menjabat Menteri Negara Urusan Bekas Pejuang Bersenjata/Veteran sekaligus Menteri Sosial Ad Interim pada 1955-1956 di era Kabinet Perdana Menteri Burhanuddin Harahap. Bung Tomo juga tercatat sebagai anggota DPR pada 1956-1959 yang mewakili Partai Rakyat Indonesia.Namun pada awal 1970-an, ia kembali berbeda pendapat dengan pemerintahan Orde Baru. Ia berbicara dengan keras terhadap program-program Suharto sehingga pada 11 April 1978 ia ditahan oleh pemerintah Indonesia yang tampaknya khawatir akan kritik-kritiknya yang keras. Baru setahun kemudian ia dilepaskan oleh Suharto. Meskipun semangatnya tidak hancur di dalam penjara,Sutomo sangat bersungguh-sungguh dalam kehidupan imannya, namun tidak menganggap dirinya sebagai seorang Muslim saleh, ataupun calon pembaharu dalam agama. Pada 7 Oktober 1981 ia meninggal dunia di Padang Arafah, ketika sedang menunaikan ibadah haji. Berbeda dengan tradisi untuk memakamkan para jemaah haji yang meninggal dalam ziarah ke tanah suci, jenazah Bung Tomo dibawa kembali ke tanah air dan dimakamkan bukan di sebuah Taman Makam Pahlawan, melainkan di Tempat Pemakaman Umum Ngagel di Surabaya.",
      "img": "https://image.ibb.co/gC1UgK/sutomo_bungtomo.jpg"
    },
    {
      "nama": "Sutomo",
      "nama2": "dr.Soetomo",
      "kategori": "Pahlawan Kemerdekaan Nasional",
      "asal": "Jawa Timur",
      "lahir": "Senin, 30 Juli 1888 di Ngepeh, Loceret, Nganjuk, Jawa Timur",
      "usia": "49 tahun",
      "gugur": " Senin, 30 Mei 1938   di Surabaya, Jawa Timur",
      "lokasimakam": "Gedung Nasional Indonesia (GNI) di Jalan Bubutan, Surabaya, Jawa Timur",
      "history": "Sutomo (dr. Soetomo, lahir di Ngepeh, Loceret, Nganjuk, Jawa Timur, 30 Juli 1888 – meninggal di Surabaya, Jawa Timur, 30 Mei 1938 pada umur 49 tahun) adalah tokoh pendiri Budi Utomo, organisasi pergerakan yang pertama di Indonesia.Pada tahun 1903, Soetomo menempuh pendidikan kedokteran di School tot Opleiding van Inlandsche Artsen, Batavia. Bersama kawan-kawan dari STOVIA inilah Soetomo mendirikan perkumpulan yang bernama Budi Utomo, pada tahun 1908. Setelah lulus pada tahun 1911, ia bekerja sebagai dokter pemerintah di berbagai daerah di Jawa dan Sumatra. Pada tahun 1917, Soetomo menikah dengan seorang perawat Belanda. Pada tahun 1919 sampai 1923, Soetomo melanjutkan studi kedokteran di Belanda.Pada tahun 1924, Soetomo mendirikan Indonesian Study Club (dalam bahasa Belanda Indonesische Studie Club atau Kelompok Studi Indonesia) di Surabaya, pada tahun 1930 mendirikan Partai Bangsa Indonesia dan pada tahun 1935 mendirikan Parindra (Partai Indonesia Raya).",
      "img": "https://image.ibb.co/emBUgK/sutomo_drsutomo.jpg"
    },
    {
      "nama": "Sutoyo Siswomiharjo ",
      "nama2": "Mayjen.Soetojo Siswomihardjo",
      "kategori": "Pahlawan Revolusi",
      "asal": "Jawa Tengah",
      "lahir": "Senin, 28 Agustus 1922 di Kebumen, Jawa Tengah",
      "usia": "43 tahun",
      "gugur": "Jumat, 1 Oktober 1965   di Lubang Buaya, Jakarta",
      "lokasimakam": "Taman Makam Pahlawan (TMP) Kalibata, Jakarta",
      "history": "Setelah proklamasi kemerdekaan Indonesia pada tahun 1945, Sutoyo bergabung ke dalam bagian Polisi Tentara Keamanan Rakyat (TKR), cikal bakal Tentara Nasional Indonesia. Hal ini kemudian menjadi Polisi Militer Indonesia. Pada Juni 1946, ia diangkat menjadi ajudan Kolonel Gatot Soebroto, komandan Polisi Militer. Ia terus mengalami kenaikan pangkat di dalam Polisi Militer, dan pada tahun 1954 ia menjadi kepala staf di Markas Besar Polisi Militer. Dia memegang posisi ini selama dua tahun sebelum diangkat menjadi asisten atase militer di kedutaan besar Indonesia di London. Setelah pelatihan di Sekolah Staf dan Komando Angkatan Darat di Bandung dari tahun 1959 hingga 1960, ia diangkat menjadi Inspektur Kehakiman Angkatan Darat, kemudian karena pengalaman hukumnya, pada tahun 1961 ia menjadi inspektur kehakiman/jaksa militer utama. Pejuang Kemerdekaan Indonesia. Kepala Staf Markas Besar Polisi Militer. Asisten Atase Militer Kedutaan Besar Indonesia di London. Inspektur Kehakiman / Jaksa Militer Utama. Menjadi korban kebiadaban (dibunuh) Gerakan 30 September.",
      "img": "https://image.ibb.co/ciVN1K/sutoyo_siswomiharjo.jpg"
    },
    {
      "nama": "Syafrudding Prawiranegara ",
      "nama2": "Mr.Sjafrudding Prawiranegara",
      "kategori": "Pahlawan Nasional",
      "asal": "Sumatera Barat & Banten",
      "lahir": "Selasa, 28 Februari 1911 di Anyer Kidul, Serang, Banten",
      "usia": "77 tahun",
      "gugur": "Rabu, 15 Februari 1989 di Jakarta, Indonesia",
      "lokasimakam": "Pemekaman Umum (TPU) Tanah Kusir, Jakarta",
      "history": "Mr. Syafruddin Prawiranegara, atau juga ditulis Sjafruddin Prawiranegara (lahir di Serang, Banten, 28 Februari 1911 – meninggal di Jakarta, 15 Februari 1989 pada umur 77 tahun) adalah pejuang pada masa kemerdekaan Republik Indonesia yang juga pernah menjabat sebagai Presiden/Ketua PDRI (Pemerintah Darurat Republik Indonesia) ketika pemerintahan Republik Indonesia di Yogyakarta jatuh ke tangan Belanda saat Agresi Militer Belanda II pada tanggal 19 Desember 1948.",
      "img": "https://image.ibb.co/e3A0oz/syafruddin_prawiranegara.jpg"
    },
    {
      "nama": "Syarif  Kasim II ",
      "nama2": "Sultan Asyaidis Syarif Kasim Sani Abdul Jalil Syarifudding",
      "kategori": "Pahlawan Nasional",
      "asal": "Riau",
      "lahir": "Jumat, 1 Desember 1893 di Siak Sri Indrapura, Riau",
      "usia": "74 tahun",
      "gugur": "Selasa, 23 April 1968 di Rumbai, Pekanbaru, Riau",
      "lokasimakam": "Siak Sri Indrapura, Kabupaten Siak, Riau",
      "history": "Yang Dipertuan Besar Syarif Kasim Abdul Jalil Saifuddin atau Sultan Syarif Kasim II (lahir di Siak Sri Indrapura, Riau, 1 Desember 1893 - meninggal di Rumbai, Pekanbaru, Riau, 23 April 1968 pada umur 74 tahun) adalah sultan ke-12 Kesultanan Siak Sri Indrapura yang mendapat gelar/penghargaan sebagai Pahlawan Nasional (Keppres No. 109/TK/1998, tanggal 6 November 1998). Beliau dinobatkan sebagai sultan pada umur 21 tahun menggantikan ayahnya Sultan Syarif Hasyim. Sultan Syarif Kasim II merupakan seorang pendukung perjuangan Kemerdekaan Indonesia, serta mendorong raja-raja di Sumatera Timur untuk mendukung dan mengintegrasikan diri dengan Republik Indonesia. Tidak lama setelah proklamasi beliau menyatakan Kesultanan Siak sebagai bagian wilayah Indonesia, dan menyumbangkan harta kekayaannya sejumlah 13 juta gulden untuk Pemerintah Republik Indonesia, setara dengan 214,5 juta gulden (tahun 2014) atau 120,1 juta USD atau Rp 1,47 trilyun. ",
      "img": "https://image.ibb.co/cHX21K/syarif_kasim_ii.jpg"
    },
    {
      "nama": "T.B. Simatupang ",
      "nama2": "Dr.(HC)Mr.Teuku Muhammad Hasan",
      "kategori": "Pahlawan Nasional ",
      "asal": "Sumatera Utara",
      "lahir": "Rabu, 28 Januari 1920 di Sidikalang, Sumatera Utara",
      "usia": "69 tahun",
      "gugur": "Senin, 1 Januari 1990 di Jakarta, Indonesia",
      "lokasimakam": "",
      "history": "Tahi Bonar Simatupang atau yang lebih dikenal dengan nama T.B. Simatupang (lahir di Sidikalang, Sumatera Utara, Indonesia, 28 Januari 1920 – meninggal di Jakarta, 1 Januari 1990 pada umur 69 tahun) adalah Pahlawan Nasional (Keppres No. 68/TK/2013, tanggal 6 November 2013) Dalam masa perjuangan mempertahankan kemerdekaan, Simatupang turut berjuang melawan penjajahan Belanda. Ia diangkat menjadi Wakil Kepala Staf Angkatan Perang RI (1948-1949) dan kemudian dalam usia yang sangat muda ia menjabat sebagai Kepala Staf Angkatan Perang RI (1950-1954). Pada tahun 1954-1959 ia diangkat sebagai Penasihat Militer di Departemen Pertahanan RI. Ia kemudian mengundurkan diri dengan pangkat Letnan Jenderal dari dinas aktifnya di kemiliteran karena perbedaan prinsipnya dengan Presiden Soekarno pada waktu itu. TB Simatupang yang merumuskan Sumpah Prajurit dan Sapta Marga TNI. Ia juga pernah menjadi Ketua PGI (Persekutuan Gereja Indonesia), Ketua Majelis Pertimbangan PGI, Ketua Dewan Gereja Asia, Ketua Dewan Gereja se-Dunia. Di bidang pendidikan, ia menjadi Ketua Yayasan Universitas Kristen Indonesia (UKI), dan Ketua Yayasan Institut Pendidikan dan Pembinaan Manajemen (IPPM).Pejuang Kemerdekaan Indonesia, Penulis. Kepala Staf Angkatan Perang RI (1950-1954). Penasihat Militer di Departemen Pertahanan RI (1954-1959). Perumus Sumpah Prajurit dan Sapta Marga TNI. Ketua PGI (Persekutuan Gereja Indonesia), Ketua Majelis Pertimbangan PGI, Ketua Dewan Gereja Asia, Ketua Dewan Gereja se-Dunia. Ketua Yayasan Universitas Kristen Indonesia (UKI). Ketua Yayasan Institut Pendidikan dan Pembinaan Manajemen (IPPM).",
      "img": "https://image.ibb.co/drU4Fe/t_b_simatupang.jpg"
    },
    {
      "nama": "T.M. Hasan",
      "nama2": "Dr.(HC)Mr.Teuku Muhammad Hasan",
      "kategori": "Pahlawan Nasional ",
      "asal": "NAD (Aceh)",
      "lahir": "Rabu, 4 April 1906 di Sigli, Kabupaten Pidie, Nanggroe Aceh Darussalam, Indonesia",
      "usia": "91 tahun",
      "gugur": "Minggu, 21 September 1997 di Jakarta, Indonesia",
      "lokasimakam": "Taman Makam Pahlawan (TMP) Kalibata, Jakarta",
      "history": "Pejuang Kemerdekaan Indonesia. Bangsawan Aceh, Wakil Presiden Pemerintah Darurat Republik Indonesia (PDRI). Gubernur Sumatera Pertama. Menteri Pendidikan dan Kebudayaan. Menteri Dalam Negeri, Menteri Agama. Ketua Komisi Perdagangan dan Industri DPRS. Ketua Panitia Negara Urusan Pertambangan (PNUP) yang berhasil Menasionalisasi beberapa Perusahaan Minyak Asing. Pendiri Universitas Serambi Mekkah.",
      "img": "https://image.ibb.co/kgCPFe/t_m_hasan.jpg"
    },
    {
      "nama": "Tan Malaka ",
      "nama2": "Ibrahim Gelar Datuk Sultan Malaka)",
      "kategori": "Pahlawan Kemerdekaan Nasional",
      "asal": "Sumatera Utara",
      "lahir": "Rabu, 2 Juni 1897   di Nagari Pandam Gadang, Suliki, Sumatera Barat",
      "usia": "51 tahun ",
      "gugur": "Senin, 21 Februari 1949   di Kaki Gunung Wilis, Desa Selopanggung, Kediri, Jawa Timur.",
      "lokasimakam": "Kaki Gunung Wilis, Desa Selopanggung, Kediri, Jawa Timur.",
      "history": "Tan Malaka atau Ibrahim gelar Datuk Tan Malaka (lahir di Nagari Pandam Gadang, Suliki, Sumatera Barat, 2 Juni 1897 – meninggal di Desa Selopanggung, Kediri, Jawa Timur, 21 Februari 1949 pada umur 51 tahun) adalah Pahlawan Kemerdekaan Nasional (Keppres No. 53 Tahun 1963, tanggal 28 Maret 1963). Tan Malaka seorang aktivis Kemerdekaan Indonesia, Filsuf, Nasionalis, penggagas berdirinya Buku Madilog (Materialisme, Dialektika, Logika) dan Gerpolek (Gerilya-Politik dan Ekonomi) keduanya dianggap merupakan karya penting dari Tan Malaka. Peristiwa 3 Juli 1946 yang didahului dengan penangkapan dan penahanan Tan Malaka bersama pimpinan Persatuan Perjuangan, di dalam penjara tanpa pernah diadili selama dua setengah tahun. Setelah meletus pemberontakan FDR/PKI di Madiun, September 1948 dengan pimpinan Musso dan Amir Syarifuddin, barulah Tan Malaka dikeluarkan begitu saja dari penjara. Pada tahun 1949 tepatnya bulan Februari Tan Malaka hilang di tengah-tengah perjuangan bersama Gerilya Pembela Proklamasi di Pethok, Kediri, Jawa Timur. Tapi akhirnya misteri tersebut terungkap juga dari penuturan Harry A. Poeze, seorang Sejarawan Belanda yang menyebutkan bahwa Tan Malaka ditembak mati pada tanggal 21 Februari 1949 di lereng Gunung Wilis, tepatnya di Desa Selopanggung, Kecamatan Semen, Kabupaten Kediri, Jawa Timur.Aktivis Kemerdekaan Indonesia. Seorang Filsuf, Nasionalis, Penggagas berdirinya Republik Indonesia (1924), Penggagas dialog Komunis dengan Islam. Pada kongres PKI 24-25 Desember 1921 diangkat sebagai Pemimpin Partai Komunis Indonesia (PKI). Pendiri Partai Republik Indonesia (PARI). Perintis Pendirian Partai Murba (Musyawarah Rakyat Banyak).",
      "img": "https://image.ibb.co/n2dLoz/tan_malaka.jpg"
    },
    {
      "nama": "Teuku Nyak Arief",
      "nama2": "Teuku Nyak Arief",
      "kategori": "Pahlawan Nasional",
      "asal": "NAD (Aceh)",
      "lahir": " Senin, 17 Juli 1899 di Ulee Lheue, Banda Aceh, Nanggroe Aceh Darussalam, Indonesia",
      "usia": "46 tahun",
      "gugur": "Sabtu, 4 Mei 1946 di Takengon, Aceh Tengah, NAD, Indonesia",
      "lokasimakam": "Tanah pemakaman keluarga di Lamreung (dua kilometer dari Lamnyong), Banda Aceh, NAD, Indonesia.",
      "history": "Teuku Nyak Arief dikenal sebagai orator ulung walaupun selalu berbicara seperlunya saja. Sangat gemar membaca terutama yang menyangkut politik dan pemerintahan serta mendalami pengetahuan Agama. Oleh sebab itu tidak mengherankan kalau dalam usia muda ia telah giat dalam pergerakan.Ia diangkat menjadi ketua National Indische Partij cabang Kutaraja pada tahun 1919. Setahun kemudian menggantikan Ayahnya sebagai Panglima Sagi 26 Mukim. Kemudian pada tahun 1927 Ia diangkat Sejak tahun 1932 T. Nyak Arif memimpin gerakan dibawah tanah menentang penjajahan Belanda di Aceh.Teuku Nyak Arif aktif dalam kegiatan-kegiatan peningkatan pendidikan di Aceh, ia bersama Mr. Teuku Muhammad Hasan mendirikan Perguruan Taman Siswa di Kutaraja pada tanggal 11 Juli 1937. Dalam kepengurusan lembaga yang diprakarsai oleh Ki Hajar Dewantara ini, T. Nyak Arif menjadi sekretaris dengan ketuanya Mr. Teuku Muhammad Hasan.Bersama Mr. T.M Hasan, ia ikut mempelopori berdirinya organisasi Atjehsche Studiefonds (Dana Pelajar Aceh) yang bertujuan untuk membantu anak-anak Aceh yang cerdas tetapi tidak mampu untuk sekolah.Pada tahun 1939 berdiri Persatuan Ulama Aceh, disingkat PUSA yang diketuai oleh Teungku Daud Beureu'eh. Pemuda-pemuda PUSA mengadakan hubungan dengan Jepang di Malaya sejak 1940 sampai 1942. Kemudian Jepang mempergunakan PUSA untuk melemahkan Belanda di Aceh dengan segala jalan. Teuku Nyak Arif prihatin melihat langkah-langkah PUSA dan menganggapnya sebagai suatu kemunduran bagi pergerakan nasional.",
      "img": "https://image.ibb.co/duZFMK/teuku_nyak_arief.jpg"
    },
    {
      "nama": "Teuku Tjik Ditoro ",
      "nama2": "Teungku Chik di Tiro Muhammad Saman",
      "kategori": "Pahlawan Nasional",
      "asal": "NAD (Aceh)",
      "lahir": "1836 di Dayah Jrueng kenegerian Cumbok Lam Lo, Tiro, Pidie, Aceh, Indonesia",
      "usia": "55 tahun",
      "gugur": "Januari 1891 di Benteng Aneuk Galong, Aceh Besar, Aceh, Indonesia",
      "lokasimakam": "Kompleks Pemakaman Pahlawan Nasional di kawasan Meureu, Kecamatan Indrapuri, Aceh Besar, NAD, Indonesia.",
      "history": "Teuku Tjik Ditiro atau Muhammad Saman, adalah seorang pahlawan dari Aceh. Ia adalah putra dari Teungku Syekh Ubaidillah. Sedangkan ibunya bernama Siti Aisyah, putri Teungku Syekh Abdussalam Muda Tiro. Ia lahir pada tahun 1836, bertepatan dengan 1251 Hijriah di Dayah Jrueng kenegerian Cumbok Lam Lo, Tiro, daerah Pidie, Aceh. Ia dibesarkan dalam lingkungan agama yang ketat. Ketika ia menunaikan ibadah haji di Mekkah, ia memperdalam lagi ilmu agamanya. Selain itu tidak lupa ia menjumpai pimpinan-pimpinan Islam yang ada di sana, sehingga ia mulai tahu tentang perjuangan para pemimpin tersebut dalam berjuang melawan imperialisme dan kolonialisme. Sesuai dengan ajaran agama yang diyakininya, Teuku Tjik Ditiro sanggup berkorban apa saja baik harta benda, kedudukan, maupun nyawanya demi tegaknya agama dan bangsa. Keyakinan ini dibuktikan dengan kehidupan nyata, yang kemudian lebih dikenal dengan Perang Sabil. Dengan Perang Sabilnya, satu persatu benteng Belanda dapat direbut. Begitu pula wilayah-wilayah yang selama ini diduduki Belanda jatuh ke tangan pasukan Teuku Tjik Ditiro. Pada bulan Mei tahun 1881, pasukan Teuku Tjik Ditiro dapat merebut benteng Belanda Lambaro, Aneuk Galong dan lain-lain. Belanda merasa kewalahan akhirnya memakai 'siasat liuk' dengan mengirim makanan yang sudah dibubuhi racun. Tanpa curiga sedikitpun Teuku Tjik Ditiro memakannya, dan akhirnya meninggal pada bulan Januari 1891 di benteng Aneuk Galong. Teuku Tjik Ditiro dimakamkan di Kompleks Pemakaman Pahlawan Nasional di kawasan Meureu, Kecamatan Indrapuri, Aceh Besar, Nanggroe Aceh Darussalam.",
      "img": "https://image.ibb.co/cJcfoz/teuku_tjik_ditiro.jpg"
    },
    {
      "nama": "Teuku Umar ",
      "nama2": "Teuku Umar ",
      "kategori": "Pahlawan Nasional",
      "asal": "NAD (Aceh)",
      "lahir": "1854 di Meulaboh, Aceh Barat, NAD, Indonesia",
      "usia": "45 tahun",
      "gugur": "Sabtu, 11 Februari 1899 di Meulaboh, Aceh Barat, NAD, Indonesia",
      "lokasimakam": "Kampung Mugo, Meulaboh, Aceh Barat, NAD, Indonesia.",
      "history": "Teuku Umar yang dilahirkan di Meulaboh Aceh Barat pada tahun 1854, adalah anak seorang Uleebalang bernama Teuku Achmad Mahmud dari perkawinan dengan adik perempuan Raja Meulaboh. Umar mempunyai dua orang saudara perempuan dan tiga saudara laki-laki.Nenek moyang Umar adalah Datuk Makhudum Sati berasal dari Minangkabau. Salah seorang keturunan Datuk Makhudum Sati pernah berjasa terhadap Sultan Aceh, yang pada waktu itu terancam oleh seorang Panglima Sagi yang ingin merebut kekuasaannya. Berkat jasanya tersebut, orang itu diangkat menjadi Uleebalang VI Mukim dengan gelar Teuku Nan Ranceh. Teuku Nan Ranceh mempunyai dua orang putra yaitu Teuku Nanta Setia dan Teuku Ahmad Mahmud. Sepeninggal Teuku Nan Ranceh, Teuku Nanta Setia menggantikan kedudukan ayahnya sebagai Uleebalang VI Mukim. la mempunyai anak perempuan bernama Cut Nyak Dhien[2] .Teuku Umar dari kecil dikenal sebagai anak yang cerdas, pemberani, dan kadang suka berkelahi dengan teman-teman sebayanya. Ia juga memiliki sifat yang keras dan pantang menyerah dalam menghadapi segala persoalan. Teuku Umar tidak pernah mendapakan pendidikan formal. Meski demikian, ia mampu menjadi seorang pemimpin yang kuat, cerdas , dan pemberani.Pemimpin Gerilya Aceh yang berperang melawan Pasukan Kolonial Belanda pada masa perang Aceh (1873-1904). Seluruh komando perang Aceh mulai tahun 1896 berada di bawah pimpinan Teuku Umar. Pertama kali dalam sejarah perang Aceh, tentara Aceh dipegang oleh satu komando, yaitu Teuku Umar. Suami Cut Nyak Dhien (juga Pahlawan Nasional).",
      "img": "https://image.ibb.co/cfZRTz/teuku_umar.jpg"
    },
    {
      "nama": "Tien Suharto",
      "nama2": "Ny.Hj.Raden Ayu Fatimah Siti Hartinah Soeharto",
      "kategori": "Pahlawan Nasional",
      "asal": " Jawa Tengah",
      "lahir": "Kamis, 23 Agustus 1923 di Desa Jaten, Surakarta (Solo), Jawa Tengah",
      "usia": "72 tahun",
      "gugur": "Minggu, 28 April 1996 di Rumah Sakit Gatot Subroto, Jakarta, Indonesia",
      "lokasimakam": "Astana Giri Bangun, Desa Girilayu, Kecamatan Matesih, Kabupaten Karanganyar, Jawa Tengah.",
      "history": "Raden Ayu Siti Hartinah (lahir di Desa Jaten, Surakarta, Jawa Tengah, 23 Agustus 1923 – meninggal di Jakarta, 28 April 1996 pada umur 72 tahun) adalah istri Presiden Indonesia kedua, Jenderal Purnawirawan Soeharto. Siti Hartinah, yang sehari-hari dipanggil 'Tien' merupakan anak kedua pasangan KPH Soemoharjomo dan Raden Ayu Hatmanti Hatmohoedojo. Ia merupakan canggah Mangkunagara III dari garis ibu. Tien menikah dengan Soeharto pada tanggal 26 Desember 1947 di Surakarta. Siti kemudian dianugerahi gelar pahlawan nasional R.I. tak lama setelah kematiannya.  Ibu Negara Republik Indonesia (1967 - 1996), Istri Presiden Suharto, aktif dalam Kegiatan Sosial dan Budaya. Penggagas sekaligus Pendiri Taman Mini Indonesia Indah (TMII). Anggota Laskar Putri Indonesia (LPI), penunjang kesuksesan perjuangan.",
      "img": "https://image.ibb.co/bwpFMK/tien_suharto.jpg"
    },
    {
      "nama": "Tirto Adi Suryo ",
      "nama2": "Raden Mas  Djokomono Tirto Adhi Soerjo",
      "kategori": "Pahlawan Nasional",
      "asal": "Jawa Tengah",
      "lahir": "1880 di Blora, Jawa Tengah",
      "usia": "38 tahun",
      "gugur": "Sabtu, 7 Desember 1918   di Jakarta, Indonesia",
      "lokasimakam": "Pemakaman Blender, Kebon Pedes, Bogor, Jawa Barat",
      "history": "RM Tirto Adhi Soerjo adalah perintis industri surat kabar dan organisasi kebangsaan di Tanah Air. Dalam rentang hidupnya yang singkat, antara 1880–1918, Tirto Adhi Soerjo berhasil memicu kebangkitan pergerakan kaum terdidik di Indonesia. Raden Mas Djokomono Tirto Adhi Soerjo lahir di Blora pada 1880. Ia adalah putra dari Raden Mas Tirtonoto, Bupati Bodjonegoro, yang masih merupakan kerabat dari Raden Adjeng Kartini. Sementara itu, salah seorang kakaknya, yakni Raden Mas Said, adalah Bupati Blora dan seorang tokoh reformasi sosial yang membuka sekolah untuk kaum perempuan. Kakaknya yang lain, yakni Raden Tirto Adi Koesoemo, adalah seorang jaksa di Rembang. Sementara itu, salah seorang sepupunya, yakni Raden Mas Brotodiningrat, adalah Bupati Madiun. RM Tirto Adhi Soerjo adalah pendiri koran pertama Indonesia, Medan Prijaji. Di masa itu, industri penerbitan surat kabar dikuasai orang keturunan Eropa dan Tionghoa. RM Tirto Adhi Soerjo dkk adalah pribumi pertama yang menerbitkan surat kabar. Seluruh pekerja Medan Prijaji, mulai dari penanggungjawab, percetakan, penerbitan hingga wartawannya adalah pribumi. Pemberitaan-pemberitaan harian Medan Prijaji sering dianggap menyinggung pemerintahan Kolonial Hindia Belanda saat itu. Di tahun 1912 Medan Prijaji terkena delik pers yang dianggap menghina Residen Ravenswaai dan Residen Boissevain yang dituduh menghalangi putera R. Adipati Djodjodiningrat (suami Raden Adjeng Kartini) menggantikan ayahnya. RM Tirto Adhi Soerjo dijatuhi pembuangan ke pulau Bacan di Halmahera selama 6 bulan. Sekembali dari Ambon, pada 1914-1918, Tirto Adhi Soerjo sakit-sakitan dan akhirnya meninggal pada 7 Desember 1918. Mula-mula dia dimakamkan di Mangga Dua Jakarta kemudian dipindahkan ke Bogor pada tahun 1973. Di nisannya tertulis, Perintis Kemerdekaan; Perintis Pers Indonesia, Layaklah ia disebut sebagai Bapak Pers Nasional. Dia mendapat anugerah semasa Orde Baru di tahun 1973 sebagai Perintis Pers Indonesia. Di masa pemerintahan SBY sekarang ini, selain gelar pahlawan nasional, RM Tirto Adhi Soerjo juga memperoleh tanda kehormatan Bintang Mahaputera Adipradana yang diserahkan kepada keluarganya pada 3 November 2006.",
      "img": "https://image.ibb.co/gqo9gK/tirto_adi_suryo.jpg"
    },
    {
      "nama": "Tjilik Riwut ",
      "nama2": "Marsekal Pertama Tjilik Riwut",
      "kategori": "Pahlawan Nasional",
      "asal": "Kalimantan Tengah",
      "lahir": "Sabtu, 2 Februari 1918 di Desa Kasongan, Kecamatan Katingan Hilir, Kabupaten Katingan, Kalimantan Tengah.",
      "usia": "69 tahun",
      "gugur": "Senin, 17 Agustus 1987 di Kota Banjarmasin, Kalimantan Selatan",
      "lokasimakam": "Makam Pahlawan Sanaman Lampang, Palangka Raya, Kalimantan Tengah",
      "history": "Marsekal Pertama TNI Tjilik Riwut (lahir di Kasongan, 2 Februari 1918 – meninggal di Kota Banjarmasin, Kalimantan Selatan, 17 Agustus 1987 pada umur 69 tahun) adalah salah satu pahlawan nasional Indonesia dan Gubernur Kalimantan Tengah.Tjilik Riwut yang dengan bangga selalu menyatakan diri sebagai 'orang hutan' karena lahir dan dibesarkan di belantara Kalimantan, adalah pencinta alam sejati juga sangat menjunjung tinggi budaya leluhurnya. Ketika masih belia ia telah tiga kali mengelilingi pulau Kalimantan hanya dengan berjalan kaki, naik perahu dan rakit.Tjilik Riwut adalah salah satu putera Dayak yang menjadi KNIP. Perjalanan dan perjuangannya kemudian melampau batas-batas kesukuan untuk menjadi salah satu pejuang bangsa. Penetapannya sebagai Pahlawan Nasional pada tahun 1998 merupakan wujud penghargaan atas perjuangan pada masa kemerdekaan dan pengabdian membangun Kalimantan (Tengah).Setelah dari Pulau Jawa untuk menuntut ilmu, Tjilik Riwut diterjunkan ke Kalimantan oleh Pangeran Muhammad Noor, gubernur Borneo saat itu sebagai pelaksana misi Pemerintah Republik Indonesia yang baru saja terbentuk, namun beliau tidak terjun. Nama-nama yang terjun merebut kalimantan adalah Harry Aryadi Sumantri, Iskandar, Sersan Mayor Kosasih, F. M. Suyoto, Bahrie, J. Bitak, C. Williem, Imanuel, Mika Amirudin, Ali Akbar, M. Dahlan, J. H. Darius, dan Marawi.",
      "img": "https://image.ibb.co/fwZh1K/tjilik_riwut.jpg"
    },
    {
      "nama": "Tuanku Tambusai ",
      "nama2": "Tuanku Haji Muhammad Saleh",
      "kategori": "Pahlawan Nasional",
      "asal": "Riau",
      "lahir": "Jumat, 5 November 1784 di Dalu-dalu, Nagari Tambusai, Rokan Hulu, Riau, Indonesia.",
      "usia": "98 tahun",
      "gugur": "Minggu, 12 November 1882   di Seremban, Negeri Sembilan, Malaysia",
      "lokasimakam": "Seremban, Negeri Sembilan, Malaysia",
      "history": "Tuanku Tambusai (lahir di Tambusai, Rokan Hulu, Riau, 5 November 1784 - meninggal di Negeri Sembilan, Malaysia, 12 November 1882 pada umur 98 tahun) adalah Pahlawan Nasional (Keppres No. 71/TK/1995, tanggal 7 Agustus 1995). Beliau terkenal sebagai 'De Padrische Tijger van Rokan' (Harimau Paderi dari Rokan), karena amat sulit dikalahkan, tidak pernah menyerah, dan tidak mau berdamai dengan Belanda. Tuanku Tambusai memimpin pasukan gabungan Dalu-dalu, Lubuksikaping, Padanglawas, Angkola, Mandailing, dan Natal untuk berperang melawan Pasukan Kolonial Belanda dalam Perang Padri bersama Tuanku Imam Bonjol. Berkat kecerdikannya, benteng Belanda Fort Amerongen dapat dihancurkan. Bonjol yang telah jatuh ke tangan Belanda dapat direbut kembali walaupun tidak bertahan lama. Tuanku Tambusai tidak saja menghadapi Belanda, tetapi juga sekaligus pasukan Raja Gedombang (regent Mandailing) dan Tumenggung Kartoredjo, yang berpihak kepada Belanda. Pada tanggal 28 Desember 1838, benteng Dalu-dalu jatuh ke tangan Belanda. Lewat pintu rahasia, ia meloloskan diri dari kepungan Belanda dan sekutu-sekutunya. Ia mengungsi dan wafat di Seremban, Negeri Sembilan, Malaysia pada tanggal 12 November 1882. Makamnya juga berada di Seremban, Negeri Sembilan, Malaysia.",
      "img": "https://image.ibb.co/bVmJae/tuanku_tambusai.jpg"
    },
    {
      "nama": "Untung Suropati ",
      "nama2": "Tumenggung Wironegoro",
      "kategori": "Pahlawan Nasional",
      "asal": "Jawa Timur dan Bali",
      "lahir": "1660 di Bali, Indonesia",
      "usia": "46 tahun",
      "gugur": "Minggu, 5 Desember 1706   di Bangil, Jawa Timur, Indonesia",
      "lokasimakam": " 1. Bantul - Yogyakarta, 2. Mancilan - Pasuruan, 3. Belik - Pasuruan, 4. Kebon Agung - Pasuruan, 5. Bangil, 6. Mojokerto, Jawa Timur, Indonesia",
      "history": "Untung Suropati (Tumenggung Wironegoro, Surawiroaji), lahir di Bali, 1660 - meninggal dunia di Bangil, Jawa Timur, 5 Desember 1706 pada umur 46 tahun adalah Pahlawan Nasional (Keppres No. 106/TK/1975, tanggal 3 November 1975). Untung Surapati merupakan seorang tokoh dalam sejarah Nusantara yang dicatat dalam Babad Tanah Jawi. Kisahnya menjadi legendaris karena mengisahkan seorang anak dari Bangsawan Bali yang berasal dari keturunan Prabu Kertajaya (Raja terakhir Panjalu/Kediri). Dan menjadi Raja/Adipati di Pasuruan dan bergelar Tumenggung Wironegoro (Raden Adipati Wironegoro). Ia terkenal sebagai Raja yang Pemberani dan Berhati Mulia, yang memimpin banyak pertempuran di sebagian besar wilayah Jawa Timur melawan Pasukan Kolonial Belanda (VOC). Pada bulan September 1706 gabungan pasukan VOC, Kartasura, Madura, dan Surabaya dipimpin Mayor Goovert Knole menyerbu Pasuruan. Pertempuran di benteng Bangil akhirnya menewaskan Untung Surapati alias Wiranegara tanggal 17 Oktober 1706. Namun ia berwasiat agar kematiannya dirahasiakan. Makam Surapati pun dibuat rata dengan tanah. Bangsa Indonesia menghargai Pahlawan Untung Suropati dalam berbagai bentuk, diantaranya Kapal Perang 872 diberi nama KRI Untung Suropati, TMP di Malang diberi nama TMP Untung Suropati, nama jalan di berbagai kota di Indonesia, dsb.",
      "img": "https://image.ibb.co/fcadae/untung_suropati.jpg"
    },
    {
      "nama": "Urip Sumoharjo ",
      "nama2": "Jendral Oerip Soemohadjo",
      "kategori": "Pahlawan Kemerdekaan Nasional ",
      "asal": "Jawa Tengah",
      "lahir": "Rabu, 22 Februari 1893 di Purworejo, Jawa Tengah, Indonesia",
      "usia": "55 tahun",
      "gugur": "Rabu, 17 November 1948 di Yoyakarta, Indonesia",
      "lokasimakam": "Taman Makam Pahlawan (TMP) Kusumanegara Semaki, Yogyakarta",
      "history": "Jenderal Oerip Soemohardjo (EYD: Urip Sumoharjo; lahir 22 Februari 1893 - meninggal 17 November 1948 pada umur 55 tahun) adalah Pahlawan Kemerdekaan Nasional (Keppres No. 314 Tahun 1964, tanggal 10 Desember 1964), seorang jenderal dan kepala staf umum Tentara Nasional Indonesia pertama pada masa Revolusi Jenderal Oerip Soemohardjo membentuk Angkatan Perang Nasional Indonesia yang pertama. Beliau juga sebagai Penasehat Wakil Presiden (merangkap Menteri Pertahanan). Urip telah beberapa bulan berada dalam kondisi lemah dan menjalani perawatan dari Dr. Sim Ki Ay. Pada malam 17 November 1948 Oerip wafat di kamarnya di Yogyakarta akibat serangan jantung. Setelah disemayamkan selama semalam, beliau dikebumikan keesokan harinya di Taman Makam Pahlawan Semaki dan secara anumerta pangkatnya dinaikkan menjadi jenderal. Oerip meninggalkan seorang istri dan putri angkat bernama Abby, namun Abby meninggal dunia karena malaria pada Januari 1951.Pejuang Kemerdekaan Indonesia. Pemimpin Tentara Keamanan Rakyat RI yang Pertama (sebelum Sudirman). Membentuk Angkatan Perang Nasional Indonesia yang pertama. Penasehat Wakil Presiden (merangkap Menteri Pertahanan).",
      "img": "https://image.ibb.co/mvR6Tz/urip_sumoharjo.jpg"
    },
    {
      "nama": "Usman Janatin ",
      "nama2": "Serda.KKO.Oesman Djanatin bin Haji Mohammad Ali",
      "kategori": "Pahlawan Nasional",
      "asal": " Jawa Timur ",
      "lahir": "Kamis Pon, 18 Maret 1943 di Dukuh Tawangsari, Desa Jatisaba, Kecamatan Purbalingga, Kabupaten Purbalingga, Jawa Tengah",
      "usia": "25 tahun",
      "gugur": "Kamis, 17 Oktober 1968   di Singapura",
      "lokasimakam": "Taman Makam Pahlawan (TMP) Kalibata, Jakarta",
      "history": "Sersan Dua KKO Anumerta Usman Janatin bin H. Ali Hasan (lahir di Dukuh Tawangsari, Desa Jatisaba, Kecamatan Purbalingga, Kabupaten Purbalingga, Jawa Tengah, 18 Maret 1943 – meninggal di Singapura, 17 Oktober 1968 pada umur 25 tahun) adalah salah satu dari dua anggota KKO (Korps Komando Operasi; kini disebut Marinir) Indonesia yang ditangkap di Singapura pada saat terjadinya Konfrontasi dengan Malaysia.Bersama dengan seorang anggota KKO lainnya bernama Harun Thohir, ia dihukum gantung oleh pemerintah Singapura pada Oktober 1968 dengan tuduhan meletakkan bom di wilayah pusat kota Singapura yang padat pada 10 Maret 1965 (lihat Pengeboman MacDonald House).Ia dimakamkan di TMP Kalibata, Jakarta.",
      "img": "https://image.ibb.co/iiJLoz/usman_janatin.jpg"
    },
    {
      "nama": "W.R. Supratman ",
      "nama2": "Wage Roedolf Soepratman",
      "kategori": "Pahlawan Nasional",
      "asal": "Jawa Timur",
      "lahir": " Senin, 9 Maret 1903   di Jatinegara, Jakarta, Indonesia",
      "usia": "35 tahun",
      "gugur": "Rabu, 17 Agustus 1938   di Surabaya, Jawa Timur, Indonesia",
      "lokasimakam": "Jalan Kenjeran, Surabaya, Jawa Timur",
      "history": "Wage Rudolf Supratman, disingkar WR Supratman (lahir di Jatinegara, Batavia, 9 Maret 1903 - meninggal di Surabaya, Jawa Timur, 17 Agustus 1938 pada umur 35 tahun) adalah pencipta lagu kebangsaan Indonesia, 'Indonesia Raya' (diciptakan tahun 1924) dan pahlawan nasional Indonesia (Keppres No. 16/TK/1971, tanggal 20 Mei 1971) . Beliau seorang aktifis Pergerakan Nasional. Pada malam penutupan Kongres Pemuda II, 28 Oktober 1928, WR Soepratman memperdengarkan lagu ciptaannya 'Indonesia Raya', dan pada saat itulah untuk pertama kalinya lagu Indonesia Raya dikumandangkan di depan umum. Semua yang hadir terpukau mendengarnya. Dengan cepat lagu itu terkenal di kalangan pergerakan nasional. Apabila partai-partai politik mengadakan kongres, maka lagu Indonesia Raya selalu dinyanyikan. Lagu itu merupakan perwujudan rasa persatuan dan kehendak untuk merdeka. Hari kelahiran Soepratman, 9 Maret, oleh Megawati Soekarnoputri saat menjadi presiden RI, diresmikan sebagai Hari Musik Nasional. Sesudah Indonesia merdeka, lagu Indonesia Raya dijadikan lagu kebangsaan, lambang persatuan bangsa. Tetapi, pencipta lagu itu, Wage Roedolf Soepratman, tidak sempat menikmati hidup dalam suasana kemerdekaan. Akibat menciptakan lagu Indonesia Raya, ia selalu diburu oleh polisi Hindia Belanda, sampai jatuh sakit di Surabaya. Karena lagu ciptaannya yang terakhir 'Matahari Terbit' pada awal Agustus 1938, ia ditangkap ketika menyiarkan lagu tersebut bersama pandu-pandu di NIROM Jalan Embong Malang, Surabaya dan ditahan di penjara Kalisosok, Surabaya. Ia meninggal pada tanggal 17 Agustus 1938 karena sakit. Uniknya, beliau meninggal tanggal 17 Agustus 1938, seolah pertanda bahwa Indonesia merdeka tanggal 17 Agustus.",
      "img": "https://image.ibb.co/dUSrve/w_r_supratman.jpg"
    },
    {
      "nama": "W.Z. Johannes",
      "nama2": "Prof. Dr. Wilhelmus Zakaria Johannes",
      "kategori": "Pahlawan Nasional",
      "asal": "NTT (Nusa Tenggara Timur)",
      "lahir": "1895 di Termanu, Pulau Rote, Nusa Tenggara Timur, Indonesia.",
      "usia": "57 tahun",
      "gugur": "Kamis, 4 September 1952   di Den Haag, Belanda",
      "lokasimakam": "Pemakaman Umum (TPU) Jati Petamburan, Jakarta Pusat.",
      "history": "Pendidik dan Pejuang Pergerakan Nasional. Ahli Rontgen Pertama Indonesia. Pelopor Medis Bidang Radiologi. Turut mendirikan Badan Persiapan Persatuan Kristen (BPPK), yang menjelma menjadi Partai Kristen Indonesia (Parkindo). Ketua Partai Kristen Nasional (PKN). Juga membentuk organisasi perjuangan, yakni Gerakan Rakyat Indonesia Sunda Kecil (GRISK) untuk mempertahankan Kemerdekaan RI. Anggota BP KNIP (Badan Pekerja Komite Nasional Indonesia Pusat). Presiden (Rektor) Universitas Indonesia.",
      "img": "https://image.ibb.co/cTURTz/w_z_johannes.jpg"
    },
    {
      "nama": "Wahid Hasyim ",
      "nama2": "Kiai Haji Abdul Wahid Hasjim",
      "kategori": "Pahlawan Kemerdekaan Nasional",
      "asal": "Jawa Timur",
      "lahir": "Senin, 1 Juni 1914   di Tebu Ireng, Jombang, Jawa Timur",
      "usia": "38 tahun",
      "gugur": "Minggu, 19 April 1953   di Cimahi, Jawa Barat",
      "lokasimakam": "Tebu Ireng, Jombang, Jawa Timur",
      "history": "Pemimpin Nahdlatul Ulama, Menteri Agama Indonesia Pertama. Ketua Majelis Syuro Muslimin Indonesia (Masyumi). Perintis pembentukan Barisan Hizbullah yang membantu perjuangan mewujudkan kemerdekaan Indonesia. Pendiri Sekolah Tinggi Islam di Jakarta. Anggota Badan Penyelidik Usaha-usaha Persiapan Kemerdekaan Indonesia (BPUPKI), beliau menjadi anggota termuda. Anggota Panitia Persiapan Kemerdekaan Indonesia (PPKI). Beliau adalah ayah dari Gus Dur (Abdurrahman Wahid) dan anak dari Hasyim Asy'arie (juga Pahlawan Nasional Indonesia). Beliau adalah ayah dari presiden keempat Indonesia, Abdurrahman Wahid (Gus Dur) dan anak dari Hasyim Asy'arie (juga pahlawan nasional Indonesia). Wahid Hasjim dimakamkan di Tebuireng, Jombang.KH. Wahid Hasyim adalah Pemimpin Nahdlatul Ulama, Menteri Agama Indonesia Pertama, Ketua Majelis Syuro Muslimin Indonesia (Masyumi).Beliau merintis pembentukan Barisan Hizbullah yang membantu perjuangan mewujudkan kemerdekaan Indonesia; pendiri Sekolah Tinggi Islam di Jakarta; Anggota Badan Penyelidik Usaha-usaha Persiapan Kemerdekaan Indonesia (BPUPKI), beliau menjadi anggota termuda; Anggota Panitia Persiapan Kemerdekaan Indonesia (PPKI). Rumusan 'Ketuhanan Yang Maha Esa' dalam Pancasila sebagai pengganti dari 'Kewajiban Menjalankan Syariat Islam bagi Pemeluknya' tidak terlepas dari peran seorang Wahid Hasjim. Wahid dikenal sebagai tokoh yang moderat, substantif, dan inklusif. Salah satu perkataannya yang terkenal adalah tiap-tiap Muslim mesti demokrat, karena agama Islam adalah agama Demokratis KH Wahid Hasjim meninggal dunia dalam sebuah kecelakaan mobil di Kota Cimahi tanggal 19 April 1953.",
      "img": "https://image.ibb.co/d9crve/wahid_hasyim.jpg"
    },
    {
      "nama": "Wahidin Sudirohusodo",
      "nama2": "dr. Wahidin Soedirohoesodo",
      "kategori": "Pahlawan Nasional",
      "asal": "DIY (Yogyakarta)",
      "lahir": "Rabu, 7 Januari 1852   di Mlati, Sleman, Yogyakarta, Indonesia",
      "usia": "65 tahun",
      "gugur": "Sabtu, 26 Mei 1917   di Yogyakarta, DIY, Indonesia",
      "lokasimakam": "",
      "history": " Jl. Magelang, Desa Sendangadi. Kecamatan Mlati, Sleman, Yogyakarta",
      "img": "https://image.ibb.co/eCt9gK/wahidin_sudirohusodo.jpg"
    },
    {
      "nama": "Wolter Monginsidi",
      "nama2": "Robert Wolter Monginsidi",
      "kategori": "Pahlawan Nasional",
      "asal": "Sulawesi Utara ",
      "lahir": "Sabtu, 14 Februari 1925   di Malalayang, Manado, Sulawesi Utara",
      "usia": "24 tahun",
      "gugur": "Senin, 5 September 1949   di Pacinang, Makassar, Sulawesi Selatan",
      "lokasimakam": "Taman Makam Pahlawan (TMP) Panaikang, Makassar, Sulawesi Selatan",
      "history": "Pejuang Kemerdekaan Indonesia. Pada tanggal 17 Juli 1946, Monginsidi dengan Ranggong Daeng Romo dan lainnya membentuk Laskar Pemberontak Rakyat Indonesia Sulawesi (LAPRIS) untuk bertempur melawan Belanda. Akhirnya tertangkap Belanda dan dihukuman mati (dieksekusi oleh tim penembak) pada 5 September 1949.",
      "img": "https://image.ibb.co/gXPh1K/wolter_monginsidi.jpg"
    },
    {
      "nama": "Yos Sudarso",
      "nama2": "Laksmana Madya Josaphat Soedarso",
      "kategori": "Pahlawan Nasional",
      "asal": " Sulawesi Selatan",
      "lahir": "Selasa, 24 November 1925   di Salatiga, Jawa Tengah",
      "usia": "36 tahun",
      "gugur": "Senin, 5 September 1949   di Pacinang, Makassar, Sulawesi Selatan",
      "lokasimakam": "Monumen Yos Sudarso, Surabaya, Jawa Timur.",
      "history": " Beliau adalah Deputi Operasi Komando Staf Angkatan Laut (KSAL) yang terjun langsung dalam pertempuran membebaskan Papua (Irian Barat) dari Penjajah Belanda. Tanggal 15 Januari 1962, beliau gugur di atas KRI Macan Tutul dalam peristiwa pertempuran Laut Arafura Kepulauan Aru dengan kekuatan yang tidak seimbang, setelah ditembak oleh kapal patroli Hr. Ms. Eversten milik armada Belanda.",
      "img": "https://image.ibb.co/mf5pgK/yos_sudarso.jpg"
    },
    {
      "nama": "Yusuf Al-Makasari ",
      "nama2": "Syekh Yusuf Abul Mahasin Tajul Khalwati Al-Makasari",
      "kategori": "Pahlawan Nasional",
      "asal": "Sulawesi Selatan",
      "lahir": "Jumat, 3 Juli 1626   di Gowa, Sulawesi Selatan",
      "usia": "73 tahun",
      "gugur": "Sabtu, 23 Mei 1699   di Cape Town, Afrika Selatan",
      "lokasimakam": "Macassar Faure, Afrika Selatan",
      "history": "Bangsawan dari Kerajaan Goa (sulawesi Selatan). Mufti (penasehat spiritual) di Kerajaan Banten. Memimpin tentara Makassar dan Bugis membantu Rakyat Banten melawan Penjajah Belanda/VOC (pada massa Sultan Ageng Tirtayasa dan Pangeran Purbaya). Ditangkap Belanda tahun 1684 dan ditahan di Cirebon, dipindah ke Batavia (Jakarta), selanjutnya dibuang ke pulau Ceylon (Sri Lanka). Di Sri Lanka, Beliau membentuk Jaringan Islam yang luas, dan melalui murid-muridnya di Nusantara terus mengobarkan perlawanan terhadap Belanda. Akhirnya diasingkan ke Zandvliet, Afrika Selatan. Disini beliau terus menyebarkan Agama Islam sekaligus semangat anti penjajahan terhadap rakyat Afrika Selatan, sampai wafat (23 Mei 1699). Nelson Mandela menyebutnya sebagai 'Salah Seorang Putra Afrika Terbaik'.",
      "img": "https://image.ibb.co/mE2rve/yusuf_almakasari.jpg"
    },
    {
      "nama": "Zainal Mustafa ",
      "nama2": "K.H. Zaenal Moesthofa, Hoedaeni",
      "kategori": "Pahlawan Nasional ",
      "asal": "Jawa Barat",
      "lahir": "1899 di Bageur, Cimerah, Singaparna, Tasikmalaya, Jawa Barat",
      "usia": "45 tahun",
      "gugur": "Rabu, 25 Oktober 1944   di Ancol, Jakarta Utara, Indonesia",
      "lokasimakam": "Taman Makam Pahlawan (TMP) Sukamanah, Tasikmalaya, Jawa Barat.",
      "history": " Pemimpin perjuangan/pertempuran melawan penjajah Jepang di Tasikmalaya. Salah satu yang terkenal adalah Pertempuran Singaparna (25 Februari 1944). Pendiri sekaligus Pemimpin Pondok Pesantren Sukamanah di Tasikmalaya. Terkenal sebagai Ulama yang Berani, Tegas, dan anti penjajahan.",
      "img": "https://image.ibb.co/fTapgK/zainal_mustafa.jpg"
    },
    {
      "nama": "Zainul Arifin",
      "nama2": "Kiai Haji Zainul Arifin Pohan",
      "kategori": "Pahlawan Kemerdekaan Nasional",
      "asal": "Sumatera Utara",
      "lahir": "Kamis, 2 September 1909   di Barus, Tapanuli Tengah, Sumatera Utara",
      "usia": "54 tahun",
      "gugur": "Sabtu, 2 Maret 1963   di Jakarta, Indonesia",
      "lokasimakam": "Taman Makam Pahlawan (TMP) Kalibata, Jakarta",
      "history": "Pejuang Kemerdekaan Indonesia. Seorang politisi Nahdlatul Ulama (NU) terkemuka yang sejak remaja di zaman penjajahan Belanda sudah aktif dalam organisasi kepemudaan NU, GP Ansor. Panglima Pasukan Semi-militer Hizbullah. Anggota Badan Pekerja Komite Nasional Indonesia Pusat (BP KNIP). Wakil Perdana Menteri Indonesia (30 Juli 1953 - 12 Agustus 1955). Ketua Dewan Perwakilan Rakyat ke-2 (DPRGR, 1960 - 1963).Zainul Arifin lahir sebagai anak tunggal dari keturunan raja Barus, Sultan Ramali bin Tuangku Raja Barus Sultan Sahi Alam Pohan dengan perempuan bangsawan asal Kotanopan, Mandailing, Siti Baiyah boru Nasution. Memasuki era Demokrasi Terpimpin, Arifin bersedia mengetuai DPR Gotong Royong (DPRGR) sebagai upaya partai NU membendung kekuatan Partai Komunis Indonesia (PKI) di parlemen. Di tengah meningkatnya suhu politik, pada 14 Mei 1962, saat shalat Idul Adha di barisan terdepan bersama Sukarno, Zainul tertembak peluru yang diarahkan seorang pemberontak DI/TII dalam percobaannya membunuh presiden. Zainul Arifin akhirnya wafat 2 Maret 1963 setelah menderita luka bekas tembakan dibahunya selama sepuluh bulan, dan dimakamkan di Taman Makam Pahlawan (TMP) Kalibata, Jakarta. Dan pada tahun yang sama (1963), beliau dianugerahi gelar Pahlawan Kemerdekaan Nasional (Keppres No. 35 Tahun 1963, tanggal 4 Maret 1963).",
      "img": "https://image.ibb.co/bMRJae/zainul_arifin.jpg"
    }
  ]
}